{"Id": 1, "PostId": 5, "Text": "This sounds more like a description for the skepticism SE", "CreationDate": "2010-12-14T21:42:18.773", "UserId": 23}
{"Id": 2, "PostId": 11, "Score": 1, "Text": "Be serious, I imagine 75% of the users are in the US. It might be localized -- but, is it *too localized*...", "CreationDate": "2010-12-15T01:01:02.730", "UserId": 5}
{"Id": 3, "PostId": 7, "Score": 3, "Text": "Is there a reason to explicitly narrow the focus that much?", "CreationDate": "2010-12-15T03:54:34.420", "UserId": 11}
{"Id": 4, "PostId": 11, "Text": "I think that making it too US centric would generally decrease the appeal of the site. There are other parts of the world that are painfully (and unofficially) non-secular (Indian Subcontinent, West Asia, Africa, etc), where such a site could be useful for creating awareness. It is important to keep up the appeal for users from various countries.", "CreationDate": "2010-12-15T05:41:40.903", "UserId": 218}
{"Id": 5, "PostId": 12, "Text": "Well, there is no such thing on FAQ http://atheism.stackexchange.com/faq - Really, if you want it that way, the site itself ought to be renamed.", "CreationDate": "2010-12-15T05:43:09.903", "UserId": 218}
{"Id": 6, "PostId": 12, "Text": "All components of the internet are understood to be American, I'm not(surely I'm as much a part of the internet as a keyboard). In fact if the goal of this site is to represent atheism from an American perspective perhaps the site should have been called atheism USA.", "CreationDate": "2010-12-15T05:47:08.853", "UserId": 30}
{"Id": 7, "PostId": 12, "Text": "It's like Aluminum vs Aluminium, there are two perspectives that matter: USA, and Europe. And, we outnumber them and are more likely to speak English. Like it or hate it, you're using UTF-8 because we accommodate the world in exchange for it not getting in our way when we chose not to. We also don't call this the \"English Atheism\" even though questions in french will probably not float tpo well with Jeff.", "CreationDate": "2010-12-15T05:50:07.537", "UserId": 5}
{"Id": 8, "PostId": 7, "Text": "I'm not saying this should be the only topic addressed. Just that it should be one of the things addressed/", "CreationDate": "2010-12-15T07:10:38.157", "UserId": 23}
{"Id": 9, "PostId": 12, "Score": 7, "Text": "I'm assuming thats a joke..... its a joke right? Because whenever people here in South Africa complain about how painful Americans are about how wonderful their country is I stick up for the Americans and let the South Africans know that only the stupid ones are like that.... :}", "CreationDate": "2010-12-15T07:53:21.493", "UserId": 222}
{"Id": 10, "PostId": 15, "Score": 1, "Text": "atheism = !theism. So surely the only way to talk about it is in relation to what it is against? Otherwise there's nothing to talk about. If people are mainly interested in the Judeo-Christian religions then they should be able to talk about that, if the site attracts lots of muslims or mormons, they should be able to talk about that. I don't see how this site can exist without theological questions.", "CreationDate": "2010-12-15T07:57:24.953", "UserId": 222}
{"Id": 11, "PostId": 15, "Text": "Or possibly the scope of the site should be smaller.....", "CreationDate": "2010-12-15T07:58:26.263", "UserId": 222}
{"Id": 12, "PostId": 6, "Text": "I agree with you @Nick T. Good to see you here!", "CreationDate": "2010-12-15T09:31:45.517", "UserId": 54}
{"Id": 14, "PostId": 22, "Score": 1, "Text": "+1 It seems that a commitment to formalizing the structure and definition of this site is sitting back seat to venting. I think this will work itself out given a few days and a few mod hammers.", "CreationDate": "2010-12-15T14:07:51.100", "UserId": 135}
{"Id": 15, "PostId": 27, "Text": "The problems of Philosophy are caused by \"all those primitive propositions which are assumed as true without proof by the various sciences\" -Wittgenstein", "CreationDate": "2010-12-15T14:20:40.540", "UserId": 135}
{"Id": 16, "PostId": 15, "Score": 1, "Text": "The smaller the scope, the less time before we burn out. The scope will have to be carefully considered lest we run out of questions after a year.", "CreationDate": "2010-12-15T14:48:50.097", "UserId": 88}
{"Id": 17, "PostId": 26, "Score": 1, "Text": "I have to give you credit for pure awesome. You asked, answered, commented on your answer and went through with the suggestion. You are a one man army.", "CreationDate": "2010-12-15T14:54:00.170", "UserId": 88}
{"Id": 18, "PostId": 29, "Text": "You're supposed to soapbox here.", "CreationDate": "2010-12-15T14:59:35.967", "UserId": 88}
{"Id": 19, "PostId": 28, "Score": 1, "Text": "If we do that, many of the \"problems\" that people are honestly seeking answers to will be closed not because they can't be answered *eventually*, but because they are ambiguous and nobody ever bothered to sit down and suss out the differences between words. The site can be helpful with due diligence; at least for the time being to get some kind of baseline of **how to talk** about these things (which is the only skill the linked questions was lacking).", "CreationDate": "2010-12-15T15:00:59.427", "UserId": 135}
{"Id": 20, "PostId": 28, "Text": "I agree, which is why I usually comment on a question asking the author to refine it before making close votes. Ultimately, though, if it can't be drawn down to a real question, it should probably not make it. I think that we'll get better questions and answers, even if we lose a few interesting questions, if we're serious about what we find acceptable.", "CreationDate": "2010-12-15T15:03:22.077", "UserId": 88}
{"Id": 21, "PostId": 26, "Score": 1, "Text": "I'm also helping retag things semantic.", "CreationDate": "2010-12-15T15:06:46.910", "UserId": 88}
{"Id": 22, "PostId": 31, "Text": "Yeah, I tried to start a question to find out, but no CW checkbox. I'm lost too at this point, but I'm looking with you.", "CreationDate": "2010-12-15T15:08:26.017", "UserId": 88}
{"Id": 23, "PostId": 31, "Text": "I posted an answer and hit the checkbox just to see what would happen. It's day 2, let's play!", "CreationDate": "2010-12-15T15:11:48.820", "UserId": 88}
{"Id": 24, "PostId": 31, "Text": "@Josiah: Heheh it's beta, and I think we lack moderators here. You might be one of them ;-)", "CreationDate": "2010-12-15T15:15:52.050", "UserId": 197}
{"Id": 26, "PostId": 31, "Text": "@Yasir, I have a deep love for stackoverflow, but I'm not an amazing or knowledgeable person [about programming]. Atheism on a stackexchange is just freaking awesome. I hope we can get the kind of community the three main stack sites have. ", "CreationDate": "2010-12-15T15:18:08.283", "UserId": 88}
{"Id": 28, "PostId": 26, "Text": "I all but guarantee that using the referral link from the site itself will not do anything, especially from within the same sub-site :P", "CreationDate": "2010-12-15T15:39:06.507", "UserId": 11}
{"Id": 29, "PostId": 26, "Text": "@Nick Ok; I wasn't sure I thought I saw some quibbling about ref links (and how they shouldnt be used due to rep farming; but I don't think it yields the rep anyway), may have been another SE though", "CreationDate": "2010-12-15T15:43:14.617", "UserId": 135}
{"Id": 30, "PostId": 34, "Text": "@Nick T: We do not have moderators ATM, do we?", "CreationDate": "2010-12-15T15:44:54.897", "UserId": 197}
{"Id": 31, "PostId": 34, "Text": "@Yasir: There are no Ath.SE-specific moderators yet.  I believe 7 days after public beta launches (~13 days from now), pro tem mods are appointed by the powers that be.  ", "CreationDate": "2010-12-15T15:47:14.503", "UserId": 11}
{"Id": 33, "PostId": 29, "Text": "Can you link a couple?  There is a massive sliding scale when it comes to this topic I'd imagine.", "CreationDate": "2010-12-15T15:51:08.010", "UserId": 11}
{"Id": 34, "PostId": 20, "Score": 1, "Text": "All those links point to questions, not answers.  To get the link for a particular answer, click \"link\" just below its body.", "CreationDate": "2010-12-15T15:53:38.727", "UserId": 11}
{"Id": 35, "PostId": 24, "Text": "Although I think that theology will inevitably play a part in the scope of this site, I like the allowance for requesting a debunking method as one way to narrow its usage.", "CreationDate": "2010-12-15T15:53:46.583", "UserId": 135}
{"Id": 36, "PostId": 20, "Text": "Actually, they all go to specific answers. My guess is after a scolding in a comment and a downvote at my own expense they've removed it... Self-moderation might work, maybe we should send an email to team@stackoverflow.com", "CreationDate": "2010-12-15T15:57:54.803", "UserId": 5}
{"Id": 37, "PostId": 34, "Text": "That certainly explains our confusion, thanks Nick.", "CreationDate": "2010-12-15T15:58:17.577", "UserId": 88}
{"Id": 38, "PostId": 29, "Text": "@Nick it's odd, I'm re-reading a lot of these and it's tough. I think that's also why I haven't answered my own question with some proposed rules for the questions, or formulas for how questions shouldn't be asked... still looking.", "CreationDate": "2010-12-15T16:41:22.173", "UserId": 135}
{"Id": 39, "PostId": 25, "Text": "Thanks, this is exactly what I wanted to know.", "CreationDate": "2010-12-15T16:53:54.390", "UserId": 184}
{"Id": 40, "PostId": 12, "Text": "@Grimsqueaker: Hear, hear.", "CreationDate": "2010-12-15T17:09:48.720", "UserId": 65}
{"Id": 42, "PostId": 6, "Score": 1, "Text": "I so wanted to retag your question with the [atheism] tag.", "CreationDate": "2010-12-15T17:33:06.150", "UserId": 88}
{"Id": 43, "PostId": 38, "Text": "Except for a case where no answers are right, answers should be accepted.", "CreationDate": "2010-12-15T17:35:53.277", "UserId": 88}
{"Id": 46, "PostId": 40, "Text": "That makes a lot of sense.", "CreationDate": "2010-12-15T17:46:59.603", "UserId": 65}
{"Id": 48, "PostId": 4, "Score": 1, "Text": "Wow, I'm not sure how I made that mistake. Editing it now.", "CreationDate": "2010-12-15T18:27:49.457", "UserId": 104}
{"Id": 49, "PostId": 14, "Score": 2, "Text": "And a warning that preaching will be dealt with more quickly than they've probably ever seen, thanks to how SE works.", "CreationDate": "2010-12-15T18:35:41.637", "UserId": 88}
{"Id": 50, "PostId": 7, "Score": 1, "Text": "It's more of a problem on reddit, I think, but here.. well, they only get to ask it once. After that, we start closing for being identical.", "CreationDate": "2010-12-15T18:36:42.197", "UserId": 88}
{"Id": 51, "PostId": 43, "Text": "I agree that we as readers of questions are prone to jump to assumptions, especially considering much of the language in the questions is not always interpreted the same by all people. Semantics aside, how do you recommend formulating questions so they are more accurate to the intent? Or what tendencies have you seen in inaccurately worded questions?", "CreationDate": "2010-12-15T18:49:07.470", "UserId": 135}
{"Id": 52, "PostId": 41, "Text": "Thanks for the listing. Of course anyone of us would likely have shifted certain ones into another category. For the most part I think that we have some questions in the \"Fits\" category that are just poorly worded, some in the \"Flame-y / Doesn't Fit\" category (lumped together since they might well be closed) that are fun today, tomorrow, but are noise the day after. Many \"Fits\" questions will be edited down once we have mods fortunately, but in the mean time, there really needs to be a stricter formulation of how to ask questions before our stack gets closed.", "CreationDate": "2010-12-15T18:53:46.860", "UserId": 135}
{"Id": 53, "PostId": 26, "Text": "@Josiah btw I really like the \"Debate-points\" tag; was that all you?", "CreationDate": "2010-12-15T18:57:20.680", "UserId": 135}
{"Id": 54, "PostId": 26, "Text": "No, there was a post that started it and I picked it up.http://atheism.stackexchange.com/questions/415/believing-in-evolution-without-fossil-evidence  It looks like Evan Carroll owns it. ", "CreationDate": "2010-12-15T18:58:35.290", "UserId": 88}
{"Id": 55, "PostId": 14, "Text": "@Josiah: +1 Ahah", "CreationDate": "2010-12-15T19:04:54.387", "UserId": 197}
{"Id": 56, "PostId": 20, "Text": "@evan wow you're right, the owners removed the posts in every case. I guess this is the self-moderation you were talking about! The general philosophy is \"give us an answer we can learn something from\", sort of like .. http://ycombinator.com/newswelcome.html", "CreationDate": "2010-12-15T19:15:24.300", "UserId": 207}
{"Id": 57, "PostId": 49, "Score": 1, "Text": "I changed the one [debate] tag into this, probably should be a synonym.", "CreationDate": "2010-12-15T19:18:45.280", "UserId": 88}
{"Id": 58, "PostId": 49, "Text": "I am glad: it would have appeared to be a command otherwise :) - \"Debate!\"", "CreationDate": "2010-12-15T19:19:58.237", "UserId": 135}
{"Id": 59, "PostId": 49, "Text": "What about the tags here? http://atheism.stackexchange.com/questions/11/why-atheism-is-still-frowned-upon-the-society", "CreationDate": "2010-12-15T19:20:56.727", "UserId": 88}
{"Id": 60, "PostId": 51, "Text": "We might want something that strikes \"debate\" for the sake of confusion.... though if someone starts typing debate they'll get both tags which is kind of nice...", "CreationDate": "2010-12-15T19:25:15.113", "UserId": 135}
{"Id": 61, "PostId": 49, "Text": "revised as debate-points & cultural identity from debate & society: society is too general and using debate in that instance seems a bit more in line with converting people. I think maybe a separate answer for a tag incorporating the theme of proselytizing might help.", "CreationDate": "2010-12-15T19:26:29.810", "UserId": 135}
{"Id": 62, "PostId": 43, "Text": "Those are hard questions. Surprisingly enough I have wrestled with the formulation of wording forever. This has already made me wonder if it is worth the cost of doing it. I saw that it was put out there as a question. I will have to think on it, to try and come up with some ideas. I haven't come up with anything to great in the last 20 years, but you never know what today will bring. Semantics are a bitch.", "CreationDate": "2010-12-15T19:28:25.100", "UserId": 184}
{"Id": 65, "PostId": 57, "Text": "The intent of this discussion is to gather some consensus for the proper course of action to take, rather then someone going off on their own and \"fixing\" everything based on their solitary point of view.  As for \"in-jokes...\"; that is no excuse to not be civil.", "CreationDate": "2010-12-15T20:08:01.477", "UserId": 11}
{"Id": 66, "PostId": 57, "Text": "The point of the reputation system is that people that have the power are probably the kind of people that should have that power. I also edited to make it more on topic, thanks.", "CreationDate": "2010-12-15T20:16:57.890", "UserId": 88}
{"Id": 67, "PostId": 57, "Text": "My point was that *just because someone has sufficient reputation* doesn't mean they should go around unilaterally changing things to be agreeable to them.  Furthermore, there is not a 1:1 correlation between reputation and responsibility.", "CreationDate": "2010-12-15T20:28:58.603", "UserId": 11}
{"Id": 68, "PostId": 57, "Text": "I agreed, and I edited my post to be more clear about how I felt about it. Since SE provides revision histories, if someone does go around being an asshat with edit power other editors can fix it.", "CreationDate": "2010-12-15T20:30:32.710", "UserId": 88}
{"Id": 69, "PostId": 54, "Text": "can you use easier english; what is *veiled conjeture...*?", "CreationDate": "2010-12-15T21:35:00.103", "UserId": 141}
{"Id": 71, "PostId": 64, "Text": "Do you have any examples of other SE sites?", "CreationDate": "2010-12-15T23:16:42.923", "UserId": 88}
{"Id": 72, "PostId": 61, "Text": "I agree with you. There really seems like a finite amount of material that can fit here within the guidelines.", "CreationDate": "2010-12-15T23:17:56.433", "UserId": 88}
{"Id": 73, "PostId": 14, "Score": 2, "Text": "@Josiah: And `Don't Preach` printed in large red friendly letters on the cover? ;)", "CreationDate": "2010-12-15T23:29:59.727", "UserId": 104}
{"Id": 74, "PostId": 11, "Score": 1, "Text": "@Evan: Where does that figure come from? Why 75% and not, say, 10%?", "CreationDate": "2010-12-16T00:19:23.710", "UserId": 80}
{"Id": 75, "PostId": 18, "Text": "It is called an Oxford comma or serial comma: http://en.wikipedia.org/wiki/Serial_comma", "CreationDate": "2010-12-16T00:26:23.673", "UserId": 80}
{"Id": 76, "PostId": 64, "Text": "It's not all that common, but a search for \"followup\" on StackOverflow brings up some questions: http://stackoverflow.com/search?q=followup . I might have seen something like that on gaming.SE or gamedev.SE as well.", "CreationDate": "2010-12-16T00:51:11.170", "UserId": 255}
{"Id": 77, "PostId": 55, "Text": "I expect a neutral tone from SE, so I agree on all three points. Personally I don't capitalize the 'g' in god for the same reason I don't capitalize the 'c' in car.  To me it is more of a description of something than a proper noun.", "CreationDate": "2010-12-16T05:07:32.700", "UserId": 74}
{"Id": 78, "PostId": 20, "Text": "Clever, if I respond, and you don't like it you just delete it!!!", "CreationDate": "2010-12-16T05:43:14.937", "UserId": 5}
{"Id": 79, "PostId": 11, "Text": "I think the distinction is in the topic presents one generic question, then the explanation of the question throws in a specific country case, leaving people wanting to answer the question then having to say 'but here in Australia' or 'here in the UK' or 'here in the <insert country of origin' ...", "CreationDate": "2010-12-16T07:41:53.317", "UserId": 160}
{"Id": 80, "PostId": 65, "Text": "i love this one", "CreationDate": "2010-12-16T07:54:45.580", "UserId": 141}
{"Id": 82, "PostId": 69, "Text": "I think we should leave this with a [specific-religion] tag; it would be like having a [peppers] tag versus [green-peppers], [jalapeno-peppers], [habanero-peppers]. That said, I think this assertion is *definitely up for debate* based on questions being asked and whether there is a need for such specificity.", "CreationDate": "2010-12-16T13:22:19.577", "UserId": 135}
{"Id": 83, "PostId": 70, "Text": "Would questions about [place of worship] be on topic for Atheism? If Atheists want information about a mosque, shouldn't they ask a Muslim?", "CreationDate": "2010-12-16T13:28:09.497", "UserId": 135}
{"Id": 84, "PostId": 68, "Text": "How would we have monotheism related questions? Would it be related to specific arguments for said entity's existence? I think there are some questions, but if you could give some depth it might be more helpful.", "CreationDate": "2010-12-16T13:29:10.930", "UserId": 135}
{"Id": 85, "PostId": 68, "Text": "There are already a lot of religion tags out there, adding more descriptive tags won't hurt. But should we go with mono/poly or \"abrahamic\", \"buddhist\", etc?", "CreationDate": "2010-12-16T14:40:01.647", "UserId": 88}
{"Id": 86, "PostId": 65, "Text": "It's a bit cliched for my taste, but I think that also carries benefits. Thinking about it from a google search perspective, it's immediately obvious what a.se is about and what you'll find inside. People also have familiarity with the wording. It'd be nice to find something less cliched, with the same benefits, though.", "CreationDate": "2010-12-16T14:45:41.403", "UserId": 88}
{"Id": 87, "PostId": 73, "Text": "Isn't there a dictionary definition? The lack of belief in a deity or deities, or something to that effect?", "CreationDate": "2010-12-16T16:13:42.980", "UserId": 88}
{"Id": 88, "PostId": 71, "Text": "Added the reference text and a link.", "CreationDate": "2010-12-16T16:17:00.637", "UserId": 88}
{"Id": 89, "PostId": 73, "Text": "@Jos by virtue of the differences in the semantics questions it is my impression that we need a definition that is more precise for the FAQ so that everyone is working with a shared (collectively manicured? ) reference; goes the same for clarifying definitions for agnostic,  anti-theist, etc. ", "CreationDate": "2010-12-16T16:29:38.143", "UserId": 135}
{"Id": 90, "PostId": 73, "Score": 1, "Text": "Mayhaps we could do an all inclusive one, that deals with strong/weak, gnostic/agnostic, monism whatever the other ism is, etc?", "CreationDate": "2010-12-16T16:30:41.210", "UserId": 88}
{"Id": 91, "PostId": 73, "Text": "@jos mayhaps indeed, post that as answer and let's get democratic about it :)", "CreationDate": "2010-12-16T16:46:34.597", "UserId": 135}
{"Id": 92, "PostId": 76, "Text": "I know, right? Day three and we're all stumped on what to ask. We're going to have to expand what we find acceptable, I think. I also think we need to consider that the Community Wiki is going to be a huge part of our community. How long before we accept \"Do atheists like bacon?\"", "CreationDate": "2010-12-16T17:05:41.747", "UserId": 88}
{"Id": 93, "PostId": 79, "Text": "Modified mine a bit. Waiting until some arbitrary point was a silly suggestion, since my only problem was lack of moderation.", "CreationDate": "2010-12-16T17:24:42.423", "UserId": 88}
{"Id": 94, "PostId": 76, "Text": "@Josiah: Very true. It seems that there are certain people who are obviously smarter than me getting their (very well thought-out) answers in way before me ( ;-P ), so I've taken it upon myself to try to come up with interesting questions instead!", "CreationDate": "2010-12-16T17:28:22.810", "UserId": 65}
{"Id": 95, "PostId": 76, "Text": "@Richard, I'm wondering if this question is more accurate than is immediately obvious. Can you think of any tags we have where someone might actually be an expert at answering just those tags?", "CreationDate": "2010-12-16T17:35:10.163", "UserId": 88}
{"Id": 96, "PostId": 76, "Text": "@Richiard, A Raft? More like an armada.", "CreationDate": "2010-12-16T18:45:28.877", "UserId": 88}
{"Id": 97, "PostId": 78, "Text": "Yeah, I mentioned that it's too early as well. But you're correct, without moderation, trolling will make things impossible.", "CreationDate": "2010-12-16T19:03:42.597", "UserId": 27}
{"Id": 98, "PostId": 78, "Text": "I agree completely, was just adding that we should do so once we go open beta on community sites, then suggested a time frame for big guys.", "CreationDate": "2010-12-16T19:12:42.303", "UserId": 88}
{"Id": 99, "PostId": 76, "Text": "@Richard Cook, I think that means a healthy closed+open beta. How long does our open beta run?", "CreationDate": "2010-12-16T19:24:28.437", "UserId": 88}
{"Id": 100, "PostId": 87, "Text": "The way you describe things I think you see the question flow visually.", "CreationDate": "2010-12-16T19:39:25.860", "UserId": 88}
{"Id": 101, "PostId": 81, "Score": 4, "Text": "Much of the beta process is seeding the site with standard, referential questions and really getting good answers behind them. The [debate-points] is a great place to start the seeding process. For me I'm less worried about 1500 questions, than I am about this: if there are 10 questions every atheist should know a good answer to, they should already be on this site, voted on numerously, and answered before we leave beta. I not only recommend using [debate-points] as a progenitor tag, but other tags too: http://meta.atheism.stackexchange.com/questions/47/how-to-ask-questions-among-atheists", "CreationDate": "2010-12-16T19:43:53.967", "UserId": 135}
{"Id": 102, "PostId": 81, "Text": "I agree completely.", "CreationDate": "2010-12-16T19:44:50.643", "UserId": 88}
{"Id": 103, "PostId": 88, "Text": "Yeah, I've wondered about this too. A couple of questions I asked have become part of the community wiki. Who is able to do this?", "CreationDate": "2010-12-16T20:00:33.057", "UserId": 65}
{"Id": 104, "PostId": 88, "Text": "I've been telling people we had to wait to cw things, so it's a bit unnerving thinking I've lied to so many.", "CreationDate": "2010-12-16T20:01:45.520", "UserId": 88}
{"Id": 105, "PostId": 85, "Score": 1, "Text": "I would like to get a feel as to whether people feel it is good info to have. Maybe just throw a yes or no comment on here?", "CreationDate": "2010-12-16T20:01:48.020", "UserId": 184}
{"Id": 106, "PostId": 88, "Score": 1, "Text": "If you follow the “edited 4 hours ago” link, it says, “Post Made Community Wiki by Robert Cartaino” there. His profile says he's a moderator and the Community Coordinator for Stack Exchange\nat Stack Overflow, Inc. Apparently, not a local Atheism.Stackexchange moderator. :-/", "CreationDate": "2010-12-16T20:04:15.693", "UserId": 106}
{"Id": 107, "PostId": 88, "Text": "Oh! Cool. So he is a super moderator. Thanks Vitaly!", "CreationDate": "2010-12-16T20:04:51.350", "UserId": 88}
{"Id": 108, "PostId": 88, "Text": "You're quite welcome.", "CreationDate": "2010-12-16T20:05:36.723", "UserId": 106}
{"Id": 109, "PostId": 89, "Text": "Yeah, I was just wondering because I've been under the impression we have to wait for that. A huge percentage of our questions so far seem to fit cw a lot better than the QA format. Thanks, good sir!", "CreationDate": "2010-12-16T20:16:36.810", "UserId": 88}
{"Id": 110, "PostId": 76, "Text": "Good question. I haven't figured that out yet.", "CreationDate": "2010-12-16T20:22:47.227", "UserId": 65}
{"Id": 111, "PostId": 89, "Text": "We've cut way back on how CW is applied. Wiki should *not* be used to excuse bad, subjective questions... but those questions **have to adhere to** the \"Guidelines for Great Subjective Questions\": http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/", "CreationDate": "2010-12-16T20:27:10.340", "UserId": 155}
{"Id": 113, "PostId": 84, "Score": 1, "Text": "OOHhh!  I'm badge-bound! :-)", "CreationDate": "2010-12-16T22:07:16.340", "UserId": 149}
{"Id": 114, "PostId": 17, "Text": "Really? \"Amocentrism\" is a large part of the reason why atheists are a disenfranchised minority? Care to clarify?", "CreationDate": "2010-12-16T22:14:33.623", "UserId": 149}
{"Id": 115, "PostId": 82, "Score": 1, "Text": "Spain?  Spain... lemmee see...Oh, that's right.  We haven't invaded you yet. :-)  No wonder I didn't recognize the name.  The things you describe... acronyms, perspective, etc. are part of the joy of mingling with other cultures.  If you don't understand a reference, ASK. I'll do the same for Spain, Britain, or any other future protectorate. :=)   I kid.  No flame war taken. ", "CreationDate": "2010-12-16T22:17:28.020", "UserId": 149}
{"Id": 116, "PostId": 12, "Score": 1, "Text": "Without adding even an inkling of support to the OP, I did hear an interesting piece on tracing the history of culture, based on naming conventions.  Which nation is the only one that does not have its name on stamps? Britain, as the originator of postal systems. (fact check me) Which internet nation doesn't have a 2 letter suffix?  US, because the originated the internet naming scheme.  EvanCarroll HAS to be joking though, right?", "CreationDate": "2010-12-16T22:23:04.913", "UserId": 149}
{"Id": 117, "PostId": 92, "Text": "I don't know how much power we would have on the underlying coding, but as more of us approach the ability to edit I think we'll start getting more comfortable with doing so.", "CreationDate": "2010-12-16T22:24:52.310", "UserId": 88}
{"Id": 118, "PostId": 12, "Text": "Why would I be joking? Above and beyond the points discussed, the poof is in the pooding. [Ask Jeff to stop censoring stuff](http://www.quantcast.com/stackexchange.com) -- you can find out really quick how much the US matters.", "CreationDate": "2010-12-16T22:30:53.630", "UserId": 5}
{"Id": 119, "PostId": 28, "Text": "I agree too. Perhaps this is the nature of the subject matter?", "CreationDate": "2010-12-16T22:42:16.440", "UserId": 65}
{"Id": 120, "PostId": 17, "Score": 1, "Text": "Absolutely, \"care to clarify?\" beyond \"...I imagine 75% of the users are in the US\", \"...It's like Aluminum vs Aluminium, there are two perspectives that matter: USA, and Europe. And, we outnumber them and are more likely to speak English. Like it or hate it, you're using UTF-8 because we accommodate the world in exchange for it not getting in our way when we chose not to...\" We, as atheists, I believe can be more politically effective on a global scale. Working together can be difficult when sentiments like this come to dominate what is in effect a global discourse. They're not uncommon.", "CreationDate": "2010-12-16T23:01:24.480", "UserId": 30}
{"Id": 121, "PostId": 92, "Text": "@jos I like the idea but it seems like a solution for a niche problem, especially considering the context of stackexchange.  That said maybe we have a corollary to recipe swapping questions on cooking, it might be called an idea swap. It's where questions don't have a problem looking for a solution but a type of problem asking for multiple solutions. We would need to police these as grounds for closure.", "CreationDate": "2010-12-17T00:01:35.757", "UserId": 135}
{"Id": 123, "PostId": 41, "Text": "\"Why does the Pope say that Hitler was an Atheists when in fact he is a Catholic?\"  That was my question and I think you are right. How would you have worded it if at all? I am angry that such a thing can be said about Atheists (me), why did the press not point out the errors in such a statement? It was a horrible thing to say. I suppose I wanted to know if anyone knew more about the historical accuracy of the Popes statement.", "CreationDate": "2010-12-17T01:18:03.233", "UserId": 182}
{"Id": 124, "PostId": 41, "Text": "Been thinking about you points. At the moment it seems to be a bunch of Atheists talking to themselves and the question \"If you don't believe in a God and an ultimate meaning, why get up in the morning?\" seems to be a bit daft but what is this is a Christian who asks that question and genuinely believes that there cant be a reason if you dont believe. Would that not be a legitimate questions to ask an Atheist? I would not want to be seen to be avoiding a hard question asked by a questioning christian. I also enjoyed thinking about and answering  that question. Please tell me what you think.", "CreationDate": "2010-12-17T01:31:42.717", "UserId": 182}
{"Id": 125, "PostId": 92, "Text": "If a comment is closed is all editing capabilities lost? Can we vote to close for rewording and afterward reopen it? That might save a coding problems. We can include this info in the faq as a guide to why threads get closed. If it will work.", "CreationDate": "2010-12-17T06:26:08.080", "UserId": 184}
{"Id": 126, "PostId": 76, "Text": "Just so I understand (I didn't spend much time on the area 51 part of this - life got in the way): we're in private beta, yes? Does that get expanded to a public beta at all? Or is this week it for us?", "CreationDate": "2010-12-17T10:02:01.703", "UserId": 201}
{"Id": 127, "PostId": 76, "Text": "NVM that last comment - I answered my own comment. =p  That being said, once we go public beta, we'll theoretically get scads more questions, yeah?", "CreationDate": "2010-12-17T10:09:12.303", "UserId": 201}
{"Id": 128, "PostId": 41, "Text": "Hi Philip, I have to agree about the last question. It's definitely a question a religious person can ask to an atheist and thus it deserves a place on this forum. But I still think the one about the Pope is one only the Pope can answer. I understand your anger however. But I'm not so much angered by the Pope as I am angered by the media that echo his silly opinions. ", "CreationDate": "2010-12-17T10:30:43.023", "UserId": 144}
{"Id": 129, "PostId": 94, "Text": "This is a nice idea, especially submitting a question to the prominent bloggers once each month", "CreationDate": "2010-12-17T10:36:32.893", "UserId": 196}
{"Id": 130, "PostId": 70, "Text": "@mfg [An example](http://atheism.stackexchange.com/questions/tagged/place-of-worship) where the guy tagged the question [church].", "CreationDate": "2010-12-17T10:38:46.677", "UserId": 141}
{"Id": 131, "PostId": 95, "Text": "FWIW, I found this through Friendly Atheist. Agreed with your strategy - also agree that we'll need to get mods in place before we go too bigtime, though, because of the amazing trolling we'll get. ", "CreationDate": "2010-12-17T10:39:17.350", "UserId": 201}
{"Id": 132, "PostId": 52, "Score": 1, "Text": "I don't agree with this tag, proselytizing makes me think of the people standing in the mall yelling bible phrases. 'Promotion' would be a better tag", "CreationDate": "2010-12-17T10:39:50.677", "UserId": 196}
{"Id": 133, "PostId": 54, "Text": "Why christians specifically? It should apply equally to all religions!", "CreationDate": "2010-12-17T10:40:33.313", "UserId": 196}
{"Id": 134, "PostId": 69, "Text": "The advantage of using religion names is so that the Asker would imply that he's interested in a Christian perspective, for example, without having to explicitly mention it in the Question itself.", "CreationDate": "2010-12-17T10:41:24.773", "UserId": 141}
{"Id": 135, "PostId": 69, "Score": 2, "Text": "I disagree with the specific religion tag idea. For example: I'm an ex muslim, and questions about Islam are more interesting to me than questions about christianity, hinduism, etc. Therefore I can add 'Islam' to my interesting tags. I disagree with the green/red peppers example, religions are far too complex and have far too many differences between each other than peppers do, which are only different colored.", "CreationDate": "2010-12-17T10:42:26.463", "UserId": 196}
{"Id": 136, "PostId": 66, "Score": 1, "Text": "I think you nailed it as far as mission definition goes. =)", "CreationDate": "2010-12-17T11:13:00.847", "UserId": 201}
{"Id": 138, "PostId": 54, "Text": "True, but check link,  this basically more of an anti example (ie we don't want questions that do this ),  but the phrase was funny in context ", "CreationDate": "2010-12-17T11:59:07.997", "UserId": 135}
{"Id": 139, "PostId": 69, "Text": "@don I like that difference you point out in the analogy as it also means you are likelier to be able to answer questions from that tag", "CreationDate": "2010-12-17T12:01:46.233", "UserId": 135}
{"Id": 140, "PostId": 52, "Text": "@don that's why I left it community wiki so the name/definition could be edited ;feel free to make this a more viable tag, just differentiate from the debate tags ", "CreationDate": "2010-12-17T12:04:22.407", "UserId": 135}
{"Id": 143, "PostId": 98, "Text": "Is that how it will be going forward, or are the community moderators expected to take over then?", "CreationDate": "2010-12-17T15:09:25.227", "UserId": 149}
{"Id": 144, "PostId": 98, "Text": "Yeah, eventually there will be users with the rep required to do this, as well as mods put in place", "CreationDate": "2010-12-17T15:15:12.260", "UserId": 135}
{"Id": 145, "PostId": 96, "Text": "I'm not sure if it's appropriate for *this site*, but forcing someone to actually analyze the opposing point of view is quite constructive.", "CreationDate": "2010-12-17T15:21:38.083", "UserId": 11}
{"Id": 147, "PostId": 98, "Text": "@Rob Schneider: I think there would be polls, but it seems we have [some worries](http://area51.stackexchange.com/proposals/2732/atheism): too few questions, visits etc. I wonder if it's going to change.", "CreationDate": "2010-12-17T16:03:49.133", "UserId": 197}
{"Id": 148, "PostId": 98, "Text": "As for the healthy/unhealthy and based on my experience with betas for a few other sites I think the site has done well so far. It is a surprisingly cohesive group considering how fractured it could have been. The healthiest part I think is that it seems everyone is trying to focus on refining *something* or adding content.", "CreationDate": "2010-12-17T16:49:03.543", "UserId": 135}
{"Id": 149, "PostId": 98, "Text": "@mfg: A couple of times I've been anxious about the possibility that believers may come here and destroy all good initiatives. The other thing I've been thinking about is that a section of the answers which are often asked would be a good stuff. :-/", "CreationDate": "2010-12-17T17:23:54.243", "UserId": 197}
{"Id": 150, "PostId": 98, "Text": "@yas even to that end I think that adding some flavor to the pot would help create a line in the sand on how to write questions; although there will likely be a lot of flagging as offensive on either side", "CreationDate": "2010-12-17T17:26:06.177", "UserId": 135}
{"Id": 151, "PostId": 98, "Text": "@Yasir: as long as I have edit powers, religious people's proselytizing will be edited to 'dongs'. In actuality, I don't think they'll be a problem. We can close them quickly, we have moderators, we'll do fine. They'll learn this is a place to learn, not proselytize.", "CreationDate": "2010-12-17T20:22:07.683", "UserId": 88}
{"Id": 152, "PostId": 82, "Text": "@Rob: he he ;-D", "CreationDate": "2010-12-18T01:08:14.687", "UserId": 80}
{"Id": 153, "PostId": 96, "Text": "I agree with you, Nick - I did sort of mean that last part in direct relation to the site, not in general. =)", "CreationDate": "2010-12-18T09:16:33.117", "UserId": 201}
{"Id": 154, "PostId": 12, "Score": 2, "Text": "@Evan: you may be a victim of the old is-ought fallacy (http://en.wikipedia.org/wiki/Is%E2%80%93ought_problem). The fact that the US has a preponderance in the internet (fact) does not mean that it should (deontic statement) or that we should foster or support it.", "CreationDate": "2010-12-18T19:29:31.580", "UserId": 80}
{"Id": 155, "PostId": 12, "Score": 1, "Text": "@Evan: in addition, US people do not outnumber Europeans. It's roughly 310.000 for US vs. 700.000 for Europe.", "CreationDate": "2010-12-18T19:35:46.413", "UserId": 80}
{"Id": 156, "PostId": 17, "Text": "@colin Mackay  One hyper-America-centric poster does not (to me) seem to make the overall content the same.  I agree with your assessment that the particular comment is absurd and not helpful.  Vote it down, edit it, delete it, whatever we can do to help remove the dreck.  \n\nThat said, I still have a hard time blaming an american spin on atheism for global disenfranchisement... We've been disenfranchised a long time... and it's not because of Jerry Coyne, PZ Myers, or any controversial blogger.  (IMO)", "CreationDate": "2010-12-19T05:12:35.657", "UserId": 149}
{"Id": 157, "PostId": 114, "Text": "That is a very sensible answer. In that case, how do we get the word out? It seems to me that most people here are atheists.", "CreationDate": "2010-12-19T12:37:32.077", "UserId": 80}
{"Id": 158, "PostId": 114, "Score": 1, "Text": "Don't worry, once the site becomes a public beta, a simple Google search will list the site among the top choices. If we have enough question and answers on the site, we are bound to attract more theists.", "CreationDate": "2010-12-19T12:43:46.747", "UserId": 144}
{"Id": 159, "PostId": 112, "Text": "+1, it is inevitable that some measure of debate will occur on this stack. But I still would like it to be reduced to the strict minimum. If this stack just becomes another debate forum, there is no point in having a stack for atheism. We should strive to be as close as possible to the Q&A format. See the suggestions in my reply.", "CreationDate": "2010-12-19T12:45:55.670", "UserId": 144}
{"Id": 160, "PostId": 111, "Text": "Useful classification of valid questions. I feel there should be more valid types, though.", "CreationDate": "2010-12-19T12:49:03.220", "UserId": 80}
{"Id": 161, "PostId": 112, "Text": "Agreed. I made a comment to your answer, which I find interesting.", "CreationDate": "2010-12-19T12:49:26.637", "UserId": 80}
{"Id": 162, "PostId": 111, "Text": "Yes, I think we should make it a priority to think about what should be allowed.", "CreationDate": "2010-12-19T12:51:46.023", "UserId": 144}
{"Id": 164, "PostId": 114, "Text": "I guess you're right, yes. Once the site becomes public, the balance between atheists and theists will drift naturally, wherever that takes us. :-)", "CreationDate": "2010-12-19T13:03:41.490", "UserId": 80}
{"Id": 170, "PostId": 107, "Text": "Is the \"Atheist (atheism) means one and one thing only. A person who lacks lack of belief in God\"... response something we might \"stipulate\" or put in a FAQ, so as not to see it repeated on virtually EVERY question?", "CreationDate": "2010-12-19T18:37:14.253", "UserId": 149}
{"Id": 171, "PostId": 110, "Text": "Exactly my point... get beyond the repetitive \"There's only one thing atheists have in common... no belief in God\" answer and look to the next level, which virtually ALL of these questions have.  Also, when questions are badly formed, as you say, moderators (us eventually) will have to re-edit to form them in a meaningful way.  Moderation will solve a lot of this issue, IMO.", "CreationDate": "2010-12-19T18:38:41.913", "UserId": 149}
{"Id": 172, "PostId": 111, "Text": "I think that as moderators/\"police\" of the site, your comment above about \"Questions that someone would ask who is curious about atheism, or has misconceptions\"... as evidenced in the question asked... are GREAT topics for the site. I \"assume\" that is the purpose of the stack... trying to get good comprehensive answers to the most common queries about being an atheist. Like a \"FAQ\" of sorts. Where is the \"mission\" of the stack spelled out?", "CreationDate": "2010-12-19T18:59:02.887", "UserId": 149}
{"Id": 173, "PostId": 119, "Text": "Interesting proposal. Thank you, Peter.", "CreationDate": "2010-12-19T19:43:00.023", "UserId": 80}
{"Id": 174, "PostId": 110, "Text": "Although it will probably be more appropriate of a poll, sort of, I think it's highly relevant.", "CreationDate": "2010-12-19T19:44:55.310", "UserId": 27}
{"Id": 175, "PostId": 119, "Score": 3, "Text": "Can atheists really be trusted to do justice to the arguments of theists? Are we not risking creating a stack were strawman arguments are set up and then demolished? Besides, what's the problem with letting theists ask questions, as long as they don't mean to turn it into a debate. You're scared they might not be inclined to validate answers or give points?", "CreationDate": "2010-12-19T19:47:46.053", "UserId": 144}
{"Id": 176, "PostId": 119, "Text": "They will come in and they will proselytize and we will vote close. If they have genuine questions, though, it won't hurt to answer them.", "CreationDate": "2010-12-19T21:02:58.313", "UserId": 88}
{"Id": 177, "PostId": 108, "Text": "This is where I was trying to go with the question, \"what do Atheist believe. I was trying to come up with a list of point that anyone with no understanding of what it is to be Atheist could look at. I am a firm Atheist, this took me years and years of on and off thought. Even now I read an article or a comment on this site and think \"I've never thought of that\", or \"that's how I feel. Thanks for putting it straight in my head\".", "CreationDate": "2010-12-19T21:30:50.463", "UserId": 182}
{"Id": 178, "PostId": 119, "Text": "+1 for \"refute the same invalid theistic arguments repeatedly with no effect\". Many believers are not used to thinking.", "CreationDate": "2010-12-20T00:56:37.127", "UserId": 197}
{"Id": 180, "PostId": 121, "Score": 1, "Text": "I wholly agree that non-Atheists are essential to some degree of intellectual honesty and they are likely to create a need for answerable questions, objective answers; otherwise this site will suffer from an enormous credibility gap.", "CreationDate": "2010-12-20T16:03:08.847", "UserId": 135}
{"Id": 181, "PostId": 114, "Text": "@Rask A Google search will reveal this site if it is linked to, it will be linked to if it is credible.", "CreationDate": "2010-12-20T16:04:36.783", "UserId": 135}
{"Id": 182, "PostId": 119, "Score": 3, "Text": "@Yas by the nature of stacks you should not need to refute the same argument twice. If it is a question it should be marked as a duplicate; if it is an answer the appropriate prior post should be linked and the answer down-voted if not edited. However, if there was a hole in the argument that they are pointing out, then the refutation did not do a water-tight job arguing. We can then see the weakness of the refutation and scrobble together a patch and improve the rhetorical base of Atheist refutation generally.", "CreationDate": "2010-12-20T16:07:21.993", "UserId": 135}
{"Id": 183, "PostId": 109, "Score": 1, "Text": "Remember, this site is a stackexchange and we play by those rules. 'Where can I buy a beanie' is a mediocre question, but allowable as a CW. It's problem is that it is too narrow in scope, but it can be answered, still no one deserves rep for answering or asking that irrelevant question. If there is no right or wrong answer, it probably shouldn't be asked unless it is specifically for some kind of community wiki that should last the life of the site. I am a hard-liner on questions about semantics and language being the only answerable ones, but I'm sure there's more fun to be had than that :)", "CreationDate": "2010-12-20T16:24:08.547", "UserId": 135}
{"Id": 184, "PostId": 76, "Text": "@Rich , @Jos, @Just (sorry for the mass ping) As a note, four days after this post, we have added 38 questions, or about 10 questions each day (over 6 days we're at about 25 questions/day). Or of each of the 46 avid users, we have each added one question.", "CreationDate": "2010-12-20T20:53:06.333", "UserId": 135}
{"Id": 185, "PostId": 84, "Text": "Often you will see on other stacks a comment to the effect of 'give other people a chance to answer'; but assuming you aren't asking a self-evident, rep-farming question (like Q: what is 1+1? A: 2 and then accepting your own answer immediately), feel free to post an answer to be voted on along with everyone else's. Just be fair when accepting the final answer.", "CreationDate": "2010-12-20T21:37:52.083", "UserId": 135}
{"Id": 186, "PostId": 119, "Score": 1, "Text": "@Raskolnikov  Do you mean to ask, \"Isn't it possible that theists will ask some useful questions?\"  rather than \"Can atheists be trusted to do justice the arguments of theists?\"   If the former, I agree.  If the latter, I say... uh, yeah we've done \"justice\" to their empty arguments for millenia.", "CreationDate": "2010-12-20T21:50:38.550", "UserId": 149}
{"Id": 187, "PostId": 60, "Text": "Your comment hits on the \"quicksand\" of every web-site, or organizational project ever.  As I get older I have often commented, \"I respect reference librarians more every year!\"  The ability to precisely parse up human knowledge into categories that are well defined, mutually exclusive (or as non-overlapping as possible) is an art.  I'm glad you're interested in it here.  Good categorization WILL make the site more useful, though I have my doubts that it will come from the users themselves.  Moderators/super users like you will likely be the source of improvement.", "CreationDate": "2010-12-20T21:55:48.483", "UserId": 149}
{"Id": 188, "PostId": 60, "Text": "@Rob thanks, I think we will migrate there eventually as long as we accurately edit tags according to what the users are asking. I just hope that if we want to increase the breadth of the site the users are providing a perceivable model for us to pick up on and tag (as opposed to a few dozen splinter tags).", "CreationDate": "2010-12-20T21:58:39.473", "UserId": 135}
{"Id": 190, "PostId": 7, "Text": "You have identified two great questions which I will now go ask. :-)", "CreationDate": "2010-12-20T22:06:45.063", "UserId": 149}
{"Id": 191, "PostId": 119, "Score": 1, "Text": "Atheists as a whole may have done justice to their arguments, and I trust the community will act in the same way. But nobody is perfect, atheists also make mistakes. And I've also seen my share of loony atheists.", "CreationDate": "2010-12-20T22:09:01.077", "UserId": 144}
{"Id": 193, "PostId": 60, "Text": "guilty (of splinter tag proliferation) as charged. :-)", "CreationDate": "2010-12-20T22:17:59.940", "UserId": 149}
{"Id": 194, "PostId": 108, "Text": "@Philip Muir:  The irony of your reply about being a \"firm atheist\" is that it provokes the question, \"What is a firm atheist?\"  I've heard of Strong, Weak, Agnostic and Gnostic atheists.  Also, the question \"What do atheists believe?\" is one of those that begs the \"Atheists share only one common trait: lack of belief in Gods\" answer that I'm trying to get away from.  Finally, that question is basically asking for a definition of atheism.  Surely we could ask that as a question?  Or do you see it as asking something different?", "CreationDate": "2010-12-20T22:24:54.897", "UserId": 149}
{"Id": 195, "PostId": 60, "Text": "@rob lol, as long we merge posts with synonymous tags under a combined tag, then vote on the better tag we can make one preferred and the other a synonyms once we have mods,  check this: http://meta.atheism.stackexchange.com/questions/126/anybody-care-about-activism-promotion-tags", "CreationDate": "2010-12-20T22:26:07.607", "UserId": 135}
{"Id": 196, "PostId": 127, "Score": 1, "Text": "I'm inclined toward activism... as a tag.  This is the root of my question \"Should atheists join in political/group solidarity.\"  Phrased in better english, \"Should atheists be activist, and if so... for what causes that directly benefit atheists?", "CreationDate": "2010-12-20T22:26:57.550", "UserId": 149}
{"Id": 197, "PostId": 127, "Text": "I agree. It is direct and unambiguous. I understand promotion but,  like marketing, it is a bit removed from indicating how it relates to atheism. ", "CreationDate": "2010-12-20T22:32:03.513", "UserId": 135}
{"Id": 198, "PostId": 60, "Text": "Side comment:  You seem active and sensible.  Why is your rep going up so slowly, and by the same token, who are Josiah and Evan Carroll sleeping with to get +600 or +700 rep? :-) (Joking guys! Chill. :-)", "CreationDate": "2010-12-20T22:34:48.200", "UserId": 149}
{"Id": 200, "PostId": 127, "Text": "Activism, yes. Promotion sounds too bland.", "CreationDate": "2010-12-20T23:54:15.490", "UserId": 80}
{"Id": 201, "PostId": 76, "Text": "@mfg: Thanks for the update. I'm going to try to come up with a few more over the next couple of days!", "CreationDate": "2010-12-21T01:42:10.430", "UserId": 65}
{"Id": 202, "PostId": 131, "Text": "I hate to be a douche nozzle, but [my questions are at least a gazillion times better than the average](http://atheism.stackexchange.com/users/5/evan-carroll).", "CreationDate": "2010-12-21T01:43:00.850", "UserId": 5}
{"Id": 204, "PostId": 131, "Score": 1, "Text": "The nozzle gets the fun part, the bag is the problem.", "CreationDate": "2010-12-21T05:41:17.947", "UserId": 88}
{"Id": 208, "PostId": 108, "Text": "I have to say I am totally confused. I an not sure I understand what this site is aiming to do. I am an Atheist, period. I would love to chat with you on skype if you want to have a chat. All I want is for this site to work. Look me up on philandclairemuir. You seem to be far more clued up on this than I am. I would love to chat as I find this medium causes misunderstanding. ", "CreationDate": "2010-12-21T06:22:47.650", "UserId": 182}
{"Id": 209, "PostId": 60, "Text": "@Rob, certainly not Jeff - though he does call me on the phone. ;)", "CreationDate": "2010-12-21T06:26:26.883", "UserId": 5}
{"Id": 210, "PostId": 134, "Text": "Resisting...urge...to..call...you...an...aussie....", "CreationDate": "2010-12-21T06:45:09.477", "UserId": 88}
{"Id": 211, "PostId": 134, "Score": 1, "Text": "You Canadians always get the two mixed up......Thanks for Shara Palin.", "CreationDate": "2010-12-21T07:47:46.373", "UserId": 182}
{"Id": 212, "PostId": 109, "Text": "@mfg CW should never be used for a question with an absolute answer. The first example of a beanie for purchase is correct. It's totally objective - assuming an agreed upon definition of \"can\", \"purchase\", and \"beanie\". Just because you don't like it doesn't make it CW; but, it does make it grounds for downvote.", "CreationDate": "2010-12-21T07:54:06.493", "UserId": 5}
{"Id": 213, "PostId": 138, "Text": "Right, but do you want me to fix them, and then not have exp awarded and possibly not progress the site toward production? Do you want to make me a diamond mod so I can -cw them? Or, do you want me to submit a new question and duplicate over it?", "CreationDate": "2010-12-21T08:21:30.370", "UserId": 5}
{"Id": 214, "PostId": 138, "Text": "@Evan: Fix them. It's expected. I will be one of the first ones with nominating power. You're getting nominated, bitch. You will be able to close single handedly, but don't delete immediately. Mods can discuss it. We're all needed for this to work, and while I agree with you most of the time I'm too malleable to do well...", "CreationDate": "2010-12-21T08:37:41.107", "UserId": 88}
{"Id": 215, "PostId": 138, "Text": "Right, but if I fix them and they remain +CW, is that a gain for anyone? Am I over-analyzing. I really hate +CW: I try to stay off of them. How do I go about -CWing them so the answer-writers can get their up votes. Why would I want to make a subjective question objective if not so people will actively engage in it and provide useful answers?", "CreationDate": "2010-12-21T08:41:21.587", "UserId": 5}
{"Id": 216, "PostId": 138, "Text": "@Evan, what do you want atheism.se to be? That is the answer to your questions. It can be a gain. If I ask, as CW, \"What are the answers to the Cosmological Arugment?\" that's CW as fuck, but it's a great thing to have. I, personally, aim for google hits. I want our tagline and our results to be applicable. I want people searching for freedom to be able to easily find it. Yeah, there's some really trivial shit, but some of it is useful. We're still beta and we'll keep refining once we see real life questions.", "CreationDate": "2010-12-21T08:50:14.953", "UserId": 88}
{"Id": 217, "PostId": 138, "Text": "I don't think the answers to the Cosmological Argument are inherently CW. [It is answerable](http://en.wikipedia.org/wiki/Cosmological_argument#Objections_and_counterarguments). There is also nothing wrong with that answer. My objection is to questions that grow O(n) with the number of users. What is the color of Bob's shirt on Tuesday might be forever disputable as some shade of maroon. But, \"what is your favorite color for Atheist socks\" has no attainable answer ever because it is tied to the *reader* of the question.", "CreationDate": "2010-12-21T08:59:06.080", "UserId": 5}
{"Id": 218, "PostId": 138, "Text": "Anyway, back to the subject. In [this example](http://meta.atheism.stackexchange.com/questions/137/un-subjectivizing-questions/138), I can suffice my definition of non-CW, but I can't remove the +CW flag.", "CreationDate": "2010-12-21T09:02:04.080", "UserId": 5}
{"Id": 219, "PostId": 138, "Score": 1, "Text": "@Evan, The answers are many. The answer is CW. It has to be constructed and managed by many people with the intent of it being appropriate and realistic.I agree that O(n) answers are terrible, and I'll try to think about it that way from now on. When people comment on my answers, I feel like O(n^2) and it hurts.", "CreationDate": "2010-12-21T09:09:07.393", "UserId": 88}
{"Id": 220, "PostId": 138, "Text": "@Josiah, [disproof -- TMTOWTDI](http://stackoverflow.com/search?q=wiki%3A0+%5Bperl%5D), but seriously because you know at any time that *more* refutations of the Cosmological Argument can be found, does not mean that it should be CW. I assume that's your reason, and it sounds pretty illogical.", "CreationDate": "2010-12-21T09:13:12.590", "UserId": 5}
{"Id": 221, "PostId": 138, "Text": "@Evan, I more mean that it should be answered in an FAQ sort of collaborative manner. I think it can be objectively answered at any specific time, scientifically, I just don't think people *will* do it.", "CreationDate": "2010-12-21T09:22:15.603", "UserId": 88}
{"Id": 222, "PostId": 109, "Text": "@Evan that question is borderline because he gives no objective qualifications for what would make one shop better than another.  As such there are myriad correct answers and the question, unless better worded, asks for a list of x inadvertently. That's why it could function as a CW, or if it's not a Rep neutral question it should be closed for being too broad as the broadness makes for bad answers. ", "CreationDate": "2010-12-21T12:00:04.560", "UserId": 135}
{"Id": 223, "PostId": 138, "Score": 1, "Text": "How much content here can be unequivocally answered?  Even on computer SE's, a reply to a coding problem could be answered with THREE functional replies.  Voting will nominate the BEST reply.  Do those sites keep all three answers up for others to use?  If yes, then I'd guess that leaving up \"subjective\" replies that have worked for some atheists, might be a useful \"choice set\" for our readers. (I'm particularly considering advice questions for handling common situations or fallacious arguments.", "CreationDate": "2010-12-21T17:25:03.520", "UserId": 149}
{"Id": 224, "PostId": 116, "Score": 1, "Text": "I like the list.  I am advocating an \"advice\" tag, for questions in which an atheist asks \"how do I deal with...XX situation, which is very common.\"  Looks similar to your #2. Moderators have to have a defined rule for what an advice question can contain: Example... one and only one situation. Moderators ought to be able to clean up questions that fit into #2.  Voting on such questions \"OUGHT\" to be validation of the common-ness of the situation, and the value of having a good pool of advice available.", "CreationDate": "2010-12-21T17:45:09.033", "UserId": 149}
{"Id": 225, "PostId": 87, "Text": "You kind of \"spat\" the words \"advice board\" above. I take it you don't like them, or don't see this SE as one? Generalized advice on an \"as-asked\" basis would suck here. Treating it like an Advice FAQ for common, important \"How can I deal with\" or \"How might I refute\" questions could be a valuable resource.  Onus on the moderators to aggressively whittle this type of question, to eliminate duplicates.", "CreationDate": "2010-12-21T17:48:59.123", "UserId": 149}
{"Id": 226, "PostId": 76, "Text": "@mfg  I think you misspelled \"addicted\" above.  You have it as \"avid\"  ;-)", "CreationDate": "2010-12-21T17:51:42.960", "UserId": 149}
{"Id": 227, "PostId": 87, "Score": 1, "Text": "@rob although advice will have its place here I hope it can be in the form of community vetted resources rather than vague meandering questions with rambling subjective posts that only talk about ( rather than answer) the problem posed. ", "CreationDate": "2010-12-21T18:08:01.423", "UserId": 135}
{"Id": 228, "PostId": 140, "Text": "when we close, down vote, edit, delete questions. Maybe I am missing the point. Can you explain what you know about this process?", "CreationDate": "2010-12-21T19:31:26.970", "UserId": 182}
{"Id": 229, "PostId": 144, "Text": "Atheism as a stack exchange may fail, because there aren't all that many objective answers or questions for that matter.  We were up to around 150 today and of those, a good 10%-20% have to be \"advice\" esque.", "CreationDate": "2010-12-21T20:12:56.847", "UserId": 149}
{"Id": 230, "PostId": 143, "Text": "I disagree, [All of these are ideal examples](http://atheism.stackexchange.com/search?q=user:5+\\[philosophy\\]), and the question about pascal's wager are philosophical. All questions about the *existence* of god and refutations are philosophical. ", "CreationDate": "2010-12-21T20:23:51.943", "UserId": 5}
{"Id": 231, "PostId": 143, "Text": "@Evan Huh? I was supporting what you appeared to suggest above; that the tag `philosophy` should be refined and abandoned in favor of more specific tags.", "CreationDate": "2010-12-21T20:35:25.010", "UserId": 135}
{"Id": 232, "PostId": 143, "Text": "I thought you were suggesting that `[philosophical]` should only be used on that one cited question, thus far. I think it should be in use on a lot of questions, just not ones that are already tagged with morality/ethics, or conversational-advice, like this `What is the best response to someone who says, “Oh, you're an atheist but used to be religious? What happened to you??”`, questions about dialog and conversation are not philosophical. And, the person tagging should understand those words above.", "CreationDate": "2010-12-21T20:51:15.267", "UserId": 5}
{"Id": 233, "PostId": 125, "Text": "I don't have a link, but you need not worry about silly high-rep users wrecking havoc here; their deeds are watched, there's rollback, and other users are watching, and these mods can always be reported to the guys who run these sites. A greater safeguard against that is that building 1000's of rep is quite a lengthy process, and it would be strange that someone would do all that work, just to try screw the site up later on.", "CreationDate": "2010-12-21T21:03:37.013", "UserId": 141}
{"Id": 234, "PostId": 133, "Text": "Add to the list epistemology as well. ", "CreationDate": "2010-12-21T21:04:26.760", "UserId": 144}
{"Id": 235, "PostId": 143, "Text": "I see. Yeah, I was saying that of the ones tagged philosophy the tag could be discarded for the more specific tags. I'm not sure about the other one, it seems very conversational and not well suited for Q&A.", "CreationDate": "2010-12-21T21:04:39.617", "UserId": 135}
{"Id": 236, "PostId": 139, "Text": "The tags 'ethics-morality' & 'atheist-norms' might give two avenues for asking any kind of advice question suited for Q&A. ", "CreationDate": "2010-12-21T21:07:42.360", "UserId": 135}
{"Id": 237, "PostId": 114, "Score": 1, "Text": "I'll repeat my mantra:  Atheism:StackExchange:  The site to go to when you have questions about atheism, atheists, or atheistic thinking.  Naturally (aside from the semantic debaters) the majority of questions will likely come from outside the choir.", "CreationDate": "2010-12-21T21:09:03.620", "UserId": 149}
{"Id": 238, "PostId": 144, "Text": "Downvoted because I think advice to fellow atheists is an important thing that this stack should provide. It's also the only type of subjective question for which a best answer can be chosen. Depending on the type of question, it can also often be objectivized. Like \"help, I don't know how to tackle this apologetic argument\" while allowing for lots of different tactics will generally have one valid answer that amounts to pinpointing the fallacy (or fallacies) in the argument.", "CreationDate": "2010-12-21T21:09:56.800", "UserId": 144}
{"Id": 239, "PostId": 113, "Score": 1, "Text": "Hmmm... how ever shall we actively attract theists to the site? What bait would work?  Oh, I know:  rename it SalvationStackExchange.", "CreationDate": "2010-12-21T21:10:08.580", "UserId": 149}
{"Id": 240, "PostId": 144, "Text": "The problem is in fact seldom with the question, if it is the question can be rephrased, but often with the answers. I have seen quite a lot of questions which ask for an objective answer but are littered with subjective interpretations as answers.", "CreationDate": "2010-12-21T21:12:20.837", "UserId": 144}
{"Id": 241, "PostId": 137, "Text": "Once you hit the 1000 points bar, you'll have the possibility to edit questions.", "CreationDate": "2010-12-21T21:17:43.343", "UserId": 144}
{"Id": 242, "PostId": 139, "Text": "... true, and yet, an encompassing \"advice\" tag would apply to both of those.  I'm not sure I see why \"advice\" as a tag can't live in harmony with your two tags.  There isn't going to be a perfect, non-overlapping tag set... though I'm open to good argments refining the set as much as possible.  Still like \"Advice\" as a broad question category, subject to FAQ definition.", "CreationDate": "2010-12-21T21:18:23.303", "UserId": 149}
{"Id": 243, "PostId": 144, "Text": "@Rask You are correct that we can provide advice and that it is important as a stack to do so. That is the value our content provides. However, since a site on atheism can be so open to veering into an overtly subjective direction, we need to have our focus on providing advice through objective answers. In the case of ethics-morality I mention above, what about advice on parenting? Re-word it as an ethical dilemma: a thoughtful question will create more thoughtful answers. The case you mention actually already has a support tag: [debate-points].", "CreationDate": "2010-12-21T21:26:10.083", "UserId": 135}
{"Id": 244, "PostId": 144, "Text": "The people who follow these tags will be better suited to answer and more enthusiastic to support the question asker compared to random site user who follows [advice] and has an opinion about *everything*", "CreationDate": "2010-12-21T21:26:59.317", "UserId": 135}
{"Id": 245, "PostId": 138, "Text": "Even objective answers have to use written language which introduces a level of subjectivity that makes voting useful. I'm saying there is no reason why /this/ SE should be massively more CW. There are plenty of ways to make this site less CW. Please address *this* example if you disagree.", "CreationDate": "2010-12-21T21:30:12.333", "UserId": 5}
{"Id": 246, "PostId": 65, "Text": "Too bad we didn't name the site Atheistic Relijun. Then our abbreviation could be ar.se", "CreationDate": "2010-12-21T21:31:28.237", "UserId": 135}
{"Id": 247, "PostId": 140, "Text": "http://meta.stackoverflow.com/ all those questions and answers are probably addressed", "CreationDate": "2010-12-21T22:34:48.167", "UserId": 135}
{"Id": 248, "PostId": 113, "Text": "@Rob: Ha ha ha ;-D", "CreationDate": "2010-12-21T23:00:23.840", "UserId": 80}
{"Id": 249, "PostId": 142, "Text": "How about \"Remember to ask questions where you seek advice in an objective manner as you would of any technical support.  Outline clear problems to be addressed in the answers so that respondents can provide you concise, unsubjective answers.  Precise tagging is a must ; please break your question down into the following request types - `[ethics-morality]`…\"", "CreationDate": "2010-12-22T04:07:21.700", "UserId": 135}
{"Id": 250, "PostId": 147, "Text": "I'm not sure what part of this answers to the topic.", "CreationDate": "2010-12-22T04:32:41.663", "UserId": 5}
{"Id": 251, "PostId": 89, "Text": "Yea, Stack Exchange employees are by and large morally inept, and badly reasoned.. It's unfortunate that we can't just ban them (like they like to do to others).", "CreationDate": "2010-12-22T04:36:33.530", "UserId": 5}
{"Id": 252, "PostId": 147, "Text": "It seemed you were implicitly asking about how to manage the subjectivity many questions have, I was listing an approach to use that would allow for users to moderate their own questions first without super users needing to first employ any tools that would appear heavy handed or off-setting.", "CreationDate": "2010-12-22T04:38:39.957", "UserId": 135}
{"Id": 253, "PostId": 148, "Score": 2, "Text": "You're right, but I'm only asking here about merging the two (death+afterlife). I went through and did so, but all changes of course can be reversed. Trying to impose a thanatology tag might be a bit unintuitive to users even if it is more precise.", "CreationDate": "2010-12-22T04:43:44.100", "UserId": 135}
{"Id": 254, "PostId": 147, "Text": "I was asking what to do with the instance mentioned, I don't want to reword them if the retain +CW. The question is to reword, or to recreate less subjectively, and dupe over.", "CreationDate": "2010-12-22T07:43:12.120", "UserId": 5}
{"Id": 255, "PostId": 147, "Text": "@Evan Sorry, I thought you were just using that question as a general example. My opinions on that question are in the comment thread. I think the question posed is idiosyncratic and it should have been migrated to the meta so that the list could be tailored using the meta-tools and rules (ie rep free up/down votes, more allowance for discussion-y questions and collaboration). After voting on propositions, the variously agreed upon points of consensus could have been added to a CW for the main site. However, that Q/A shouldn't have rep awarded for participation like meta doesn't.", "CreationDate": "2010-12-22T13:07:44.087", "UserId": 135}
{"Id": 256, "PostId": 147, "Text": "I'm still not sure you're answering the question, so I'll try again to be even more direct: should any of the three revised questions award rep? If not, why?", "CreationDate": "2010-12-22T15:42:53.323", "UserId": 5}
{"Id": 257, "PostId": 69, "Text": "@Tshe I'd say go for it. ", "CreationDate": "2010-12-22T17:36:43.627", "UserId": 135}
{"Id": 258, "PostId": 17, "Score": 1, "Text": "@ rob Schneider Not really about atheism per se but the entry here http://en.wikipedia.org/wiki/American_exceptionalism provides some insight. My issue is not the American people in general, any more than it is religious people in general. It is the fibre of the nation state and particularly the American nation state. The international policy framework of the US appears to be grounded in some form of moral, intellectual and ideological superiority. It's disconcerting when some 5% of the global population imbued of a perceived exceptionalism seek to dominate the global discourse (IMO)", "CreationDate": "2010-12-22T19:41:00.923", "UserId": 30}
{"Id": 259, "PostId": 94, "Text": "There is such a thing as private and public Beta. The latter means anyone can participate. The first week was private Beta.", "CreationDate": "2010-12-23T01:27:32.897", "UserId": 141}
{"Id": 260, "PostId": 94, "Text": "Your idea strikes me as something that will result in the famous blogger pointing to a blog post where they covered that specific topic/question. I mean, how fresh are the questions that are going to be asked here? My uneducated guess says <1% are going to be completely fresh questions that haven't been answered somewhere in public.", "CreationDate": "2010-12-23T01:30:46.790", "UserId": 141}
{"Id": 261, "PostId": 119, "Score": 1, "Text": "I have no problem with debating theists but right now we are still in beta. Once we are in full production I think inviting theists to give us their best arguments will make things very interesting. There are a few theists who are capable of providing arguments that are at least thought provoking. I would love to see them here eventually.", "CreationDate": "2010-12-23T03:50:43.713", "UserId": 168}
{"Id": 262, "PostId": 151, "Text": "+1 good point: atheists.stackexchange.com / atheism.stackexchange.com", "CreationDate": "2010-12-23T06:21:13.660", "UserId": 197}
{"Id": 263, "PostId": 77, "Text": "I don't like the \"weak\" and \"strong\" atheism tags because they're even less clear than atheism + agnosticism. Is \"strong\" atheism gnostic atheism, or is it just a positive belief (agnostic) that there is no god, while \"weak\" atheism is simply the lack of a theistic belief?", "CreationDate": "2010-12-23T07:05:43.953", "UserId": 90}
{"Id": 264, "PostId": 145, "Text": "We can ask no end of questions on ethics and morality from a naturalist perspective. That is, in fact, the only way I can imagine this site surviving.", "CreationDate": "2010-12-23T13:09:32.170", "UserId": 263}
{"Id": 265, "PostId": 53, "Text": "That sort of nomenclature can be relevant in context.", "CreationDate": "2010-12-23T13:23:40.213", "UserId": 263}
{"Id": 266, "PostId": 127, "Text": "I wouldn't know what *promotion* meant as a tag. I think *activism* is more obvious.", "CreationDate": "2010-12-23T13:26:36.407", "UserId": 263}
{"Id": 268, "PostId": 154, "Score": 1, "Text": "We tend to have in-jokes and use purposefully biased language. For example, referring to religion as a virus, or calling God sky daddy and Jesus a zombie. While a lot of us will probably try to scale it back a it, is this something that should be should be altered via moderation tools?", "CreationDate": "2010-12-23T18:16:10.897", "UserId": 88}
{"Id": 269, "PostId": 119, "Score": 1, "Text": "\"Theists are not inclined to listen to reason and appear to have no critical thinking skills.\" - Are you kidding me?", "CreationDate": "2010-12-23T18:25:15.627", "UserId": 362}
{"Id": 270, "PostId": 152, "Score": 2, "Text": "It's often hard for atheists and theists to agree what a valid point is, to be honest. The point of this isn't to debate theists, but to ask and answer questions about atheism. Remember that downvoting is slightly discouraged via the rep system, and SE has rules against outright hostility.", "CreationDate": "2010-12-23T18:44:27.367", "UserId": 88}
{"Id": 271, "PostId": 114, "Score": 1, "Text": "I don't agree with this answer. This is a forum of experts (or perhaps better termed, \"practitioners\"). To draw an analogy, the Physics.SE site is about physics. Physicists certainly already know more about the subject; that doesn't mean that the majority of question will likely comes from outside laymen... quite the opposite, actually. There's always a mix, but the preponderance of questions will be experts talking to experts (practitioners). This is not a recruiting tool, beyond the effectiveness of dispelling myths and compiling well-vetted, canonical information about the subject.", "CreationDate": "2010-12-23T18:57:31.907", "UserId": 155}
{"Id": 272, "PostId": 155, "Score": 1, "Text": "Oh no, it's us: *70-80% of the questions didn’t run much deeper than “When will we have intelligent computers?” and “What is your favorite AI blog?”*", "CreationDate": "2010-12-23T19:09:53.933", "UserId": 88}
{"Id": 273, "PostId": 154, "Score": 5, "Text": "@Josiah: That's not a personal attack. It might be *impolite* if used in mixed company but there is some freedom of expression to communicate within reason. But hostility, personal name calling or *ad hominem* attacks would be crossing that line. Personally, I feel that silly euphemisms detract from the weightiness of an argument (i.e. it suggests to me either misdirection or hand waving). But that's just my opinion. I tend to tune out people who argue against, for example, the evils of Mickey$oft. Anything they say after that is received through a filter of indifference.", "CreationDate": "2010-12-23T19:14:58.610", "UserId": 155}
{"Id": 274, "PostId": 154, "Score": 3, "Text": "@Robert: Thanks. Just wanted a nice, firm line. Also, thanks for all the help and clarification. I don't know where they found you, but you're a gift from God.", "CreationDate": "2010-12-23T19:30:38.713", "UserId": 88}
{"Id": 275, "PostId": 155, "Text": "+1 Interesting answer and very well argued; thank you.", "CreationDate": "2010-12-23T20:12:36.917", "UserId": 80}
{"Id": 276, "PostId": 145, "Text": "@TRiG: Can you give a couple of examples, please?", "CreationDate": "2010-12-23T20:14:22.623", "UserId": 80}
{"Id": 277, "PostId": 154, "Text": "@Josiah, I really wish I could have heard you say that.  Were you being sarcastic. \"a gift from God\" - what?", "CreationDate": "2010-12-23T20:16:58.460", "UserId": 362}
{"Id": 278, "PostId": 154, "Text": "@jjnguy, it was intentional.", "CreationDate": "2010-12-23T20:22:52.143", "UserId": 88}
{"Id": 279, "PostId": 152, "Score": 4, "Text": "Remember that what you refer to as \"standard SE moderation\" is in large part actually implemented through **\"community self-moderation\"**. Keep that in mind when you decide whether to tolerate poor behavior in others. It can quite literally mean the difference between the success and failure of this site.", "CreationDate": "2010-12-23T20:42:57.733", "UserId": 155}
{"Id": 280, "PostId": 114, "Text": "I participate in the physics and mathematics fora, and while there are a lot of experts, my impression is that the non-expert questions are the most preponderant. It is not so on math.overflow for instance, where they specifically aimed for an experts only site. So it is a matter of choice on our part. Anyway, care to explain your expertise in atheism? They hand out diplomas of it now?", "CreationDate": "2010-12-24T03:44:42.670", "UserId": 144}
{"Id": 281, "PostId": 148, "Score": 2, "Text": "@mfg: It (thanatology) would only be intuitive for me if I had a dictionary handy.", "CreationDate": "2010-12-24T12:07:25.347", "UserId": 197}
{"Id": 282, "PostId": 139, "Text": "The real issue is, it seems to me, \"is the question capable (even in theory) of a definitive non-subjective answer?\"  Some of the questions above just need rephrasing in a non-subjective, non-poll way.  (Some already have been.)  \"Favourite quote\" is pushing it... but then, code golf doesn't destroy Stack Overflow.  I'd like to see this kind of question deemphasized until we have a much bigger base, though.", "CreationDate": "2010-12-24T14:18:02.930", "UserId": 445}
{"Id": 283, "PostId": 152, "Score": 2, "Text": "Well @The Preacher, you're being dishonest. He went on to suggest that you remove the inflammatory part of your comment, and you didn't, and now you're crying that your feelings are hurt. I'm sorry, but I just can't take it seriously. A lot of us have considered the fact that we'll have to temper our language to be less offensive, and a lot of us do it. You should consider joining us if you want to have real discourse with us.", "CreationDate": "2010-12-24T18:08:27.283", "UserId": 88}
{"Id": 285, "PostId": 152, "Text": "@ Josiah: I might let such a response discourage me, but I have hope that there are some unbiased folks among your atheist brethren. I have met a few.", "CreationDate": "2010-12-24T18:54:03.710", "UserId": 378}
{"Id": 286, "PostId": 152, "Score": 2, "Text": "@The Preacher, there are some. I'm certainly not one of them, but daddy is a minister so I'm pretty good at being civil while disagreeing. I was probably a bit strong, but it really seems like you're provoking reactions and then playing persecuted.", "CreationDate": "2010-12-24T19:27:13.803", "UserId": 88}
{"Id": 287, "PostId": 114, "Text": "If that’s the case, it would mean that though theists (predominantly) ask questions, only atheists could rightfully answer.", "CreationDate": "2010-12-24T21:59:25.580", "UserId": 82}
{"Id": 288, "PostId": 103, "Text": "My thoughts exactly; see [“Q’n’a format working?”](http://meta.atheism.stackexchange.com/questions/61/qna-format-working)", "CreationDate": "2010-12-24T22:03:40.520", "UserId": 82}
{"Id": 289, "PostId": 12, "Text": "@Rob: [What the heck are you talking about?!](http://en.wikipedia.org/wiki/.us)", "CreationDate": "2010-12-24T22:12:02.973", "UserId": 82}
{"Id": 290, "PostId": 159, "Score": 3, "Text": "It isn't like I came in here and just started claiming atheism is stupid.", "CreationDate": "2010-12-25T01:25:04.263", "UserId": 378}
{"Id": 291, "PostId": 152, "Text": "@The Preacher based on your \"contributions\" to the community so far, I get the distinct impression you're poking a hornets' nest and then crying when you get stung. And that's coming from the guy who posted a (now closed) question asking why most of my fellow atheists are assholes ;)", "CreationDate": "2010-12-25T04:43:36.680", "UserId": 324}
{"Id": 292, "PostId": 159, "Score": 3, "Text": "@The Preacher: I didn’t say that. You are just saying things which are (to us) patently ridiculous. Like saying that Ray Comfort has a point about evolution. This is really a ridiculous statement. Ray Comfort has repeatedly shown that he knows about as much about evolution as a toddler knows about quantum physics. And while you are of course entitled to making such statements, please accept that the community doesn’t share your enthusiasm.", "CreationDate": "2010-12-25T13:16:10.617", "UserId": 82}
{"Id": 293, "PostId": 12, "Score": 1, "Text": "@Konrad... well... I stand corrected, technically.  As that link says, most US Sites do not use the .us suffix, its use falling to state and local government entities.  The point remains, and I will defer to the original article/TV piece's overall point, if I can find it. :-)", "CreationDate": "2010-12-25T15:01:57.383", "UserId": 149}
{"Id": 294, "PostId": 151, "Text": "Well said re: defining atheists as \"people with a lack. I've made a similar comment about labeling the \"other\" side \"arationalists\" \"a-evidentiaries\", etc. But my original post is not about uncomfortable corners... it is about some respondents wanting to narrow the range of discussion with the same basic definition of \"atheism can only mean one thing\" in every response they put forth.  It adds nothing..  It was not about defining atheism, per se, though you offer some very good definitions.", "CreationDate": "2010-12-25T15:09:06.660", "UserId": 149}
{"Id": 295, "PostId": 152, "Score": 1, "Text": "To be honest, I could easily see @The Preacher's comment about being careful about reading the bible coming from an atheist. It doesn't seem incivil to me.", "CreationDate": "2010-12-25T22:51:58.743", "UserId": 270}
{"Id": 296, "PostId": 166, "Text": "I'm not saying it's perfect. I'm saying it's clearly better than our current approach. If someone else has a better suggestion than theistic-argument then we should go with that.", "CreationDate": "2010-12-26T18:05:41.643", "UserId": 484}
{"Id": 297, "PostId": 166, "Text": "It's not that confusing. \"Is the question about a theistic argument?\" Obviously not. It's about anti-theistic arguments so it doesn't belong in \"theistic-argument.\"", "CreationDate": "2010-12-26T18:08:00.003", "UserId": 484}
{"Id": 298, "PostId": 160, "Text": "in that case the tag should be \"comparing\" or \"christianity-comparison\".", "CreationDate": "2010-12-26T23:29:28.977", "UserId": 317}
{"Id": 299, "PostId": 167, "Score": 1, "Text": "How about pro-atheism-arguments and anti-religion-arguments?", "CreationDate": "2010-12-26T23:39:56.740", "UserId": 270}
{"Id": 300, "PostId": 168, "Text": "Well said. You've stumbled upon a common misconception people have about the scope of these sites. This site (Atheism) *has* to be **about athesism**; It simply *cannot* be a site about *\"anything of possible interest to atheists.\"* The latter definition allows anyone to shoehorn virtually *any* discussion into this site. And there’s nothing more toxic to a community than not being able to set boundaries around it.", "CreationDate": "2010-12-27T03:17:10.207", "UserId": 155}
{"Id": 301, "PostId": 167, "Text": "@Andrew maybe `anti` is a strong word?", "CreationDate": "2010-12-27T08:03:33.657", "UserId": 141}
{"Id": 302, "PostId": 167, "Text": "@Andrew @Tshepang, yep \"anti-religion\" doesn't sound good", "CreationDate": "2010-12-27T09:49:28.307", "UserId": 119}
{"Id": 303, "PostId": 168, "Text": "If the target audience was atheists, wouldn't that make it a atheists.SE, not an atheism.SE? (Conflict of interest: I asked the honor killing question)", "CreationDate": "2010-12-27T10:45:17.523", "UserId": 270}
{"Id": 304, "PostId": 148, "Text": "@yas agreed, that's why I retagged the [death] & [afterlife] as [death-afterlife]", "CreationDate": "2010-12-27T19:20:07.107", "UserId": 135}
{"Id": 306, "PostId": 159, "Score": 1, "Text": "\"Being weary of squabbling over well-established facts\" would only occur if people asked duplicate questions. If there was only one question claiming that the 2nd law of thermodynamics prohibits evolution, that's not a problem. You'd only have a problem if that question was asked 100 times and not closed 99 times.", "CreationDate": "2010-12-28T00:38:18.163", "UserId": 270}
{"Id": 307, "PostId": 99, "Text": "Voting to close as per Yasir's answer.", "CreationDate": "2010-12-28T00:43:04.493", "UserId": 270}
{"Id": 308, "PostId": 173, "Text": "Per my comment from http://atheism.stackexchange.com/q/1497/135; there is no right answer to a poll and they turn into Rep farms. There is no place for meaningless public opinion surveys when they are misused or abused for Rep. Do you want to defend pretending someone is an expert on something because they repped up asking/answering these questions?", "CreationDate": "2010-12-28T01:35:20.700", "UserId": 135}
{"Id": 309, "PostId": 154, "Score": 1, "Text": "Remember - Flagging, and even just *downvoting* is used for things which are off-topic, slanderous, spam, etc. These are not tools for things you \"disagree\" with - or even things which are factually \"wrong\". These are supposed to be \"serious\" remedies for inappropriate posts.", "CreationDate": "2010-12-28T02:02:47.720", "UserId": 555}
{"Id": 310, "PostId": 173, "Score": 2, "Text": "What is wrong with people generating rep points for providing good opinions. I thought discussion would be acceptable to atheists. I didn't realise atheism was only about providing black and white answers. Come on guys -3 if you're gonna vote me down at least have the courage to explain why. A number of the supposedly terrible poll questions highlighted in the original post actually provide some useful info, they are not as bad as say 'Do you like Richard Dawkins?', now that is a  useless polling question.", "CreationDate": "2010-12-28T02:17:37.920", "UserId": 150}
{"Id": 311, "PostId": 159, "Text": "@Andrew: hmm. You’re right of course. But my point is that bad answers *will* be given (just look up the two answers given by The Preacher) and these should of course be downvoted accordingly, and I am loath to downvote without leaving an explanation … which of course spins off into an endless, stupid argument.", "CreationDate": "2010-12-28T09:37:19.597", "UserId": 82}
{"Id": 312, "PostId": 154, "Score": 1, "Text": "@Brad: I don’t agree, and I think you are objectively wrong. Downvotes *are* there to penalize factually wrong answers. How else would that be done? StackExchange isn’t a discussion software, it’s a question and answer site and the whole point is that “good” (i.e. correct, or well-argued) answers bubble to the top, while bad answers get downvoted.", "CreationDate": "2010-12-28T09:39:47.223", "UserId": 82}
{"Id": 313, "PostId": 173, "Text": "It all depends on the opinions and the type of question asked. Please refer to http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/ . However, remember that this is a community. Hopefully it is a community of experts that can serve as a resource for users at large interested in atheism. When reputation is seen as some commodity for prima facie believability, it is imperative that we not entirely bloat our ranks with synthetic rep.", "CreationDate": "2010-12-28T14:41:27.010", "UserId": 135}
{"Id": 314, "PostId": 168, "Score": 1, "Text": "Wouldn't questions about questioning religion, or the actions of followers of a religion be appropriate, as they are part of the reason that people start questioning their theist beliefs? ", "CreationDate": "2010-12-28T15:31:12.100", "UserId": 541}
{"Id": 315, "PostId": 49, "Text": "also see: http://meta.atheism.stackexchange.com/q/165/135 for a discussion on renaming this tag to something more intuitive", "CreationDate": "2010-12-28T15:51:08.053", "UserId": 135}
{"Id": 316, "PostId": 152, "Score": 5, "Text": "+1 for \"stoning\" reference in religious discussion.", "CreationDate": "2010-12-28T16:16:12.983", "UserId": 574}
{"Id": 317, "PostId": 168, "Text": "I don't agree that the site is for atheists only, it should be for anyone having questions about atheism and atheism related issues. But I agree with your larger point, that certain questions simply do not fit here and the ones you mention indeed don't.", "CreationDate": "2010-12-28T16:38:40.097", "UserId": 144}
{"Id": 318, "PostId": 143, "Text": "In this case, http://atheism.stackexchange.com/questions/356/if-you-dont-believe-in-a-god-and-an-ultimate-meaning-why-get-up-in-the-morning DOES ask a philosophical question, as it relates to the nature of values and the meaning of existence.", "CreationDate": "2010-12-28T17:05:42.090", "UserId": 541}
{"Id": 319, "PostId": 143, "Text": "@Ustice Right. Thats what we were sussing out above. By solitary I meant an unqualified; that is its solely [philosophy], not [philosophy]+[teleology] etc", "CreationDate": "2010-12-28T17:28:30.080", "UserId": 135}
{"Id": 320, "PostId": 176, "Score": 2, "Text": "The second isn't an option, it's a misuse of SE. Argue against them in comments, downvote their question.", "CreationDate": "2010-12-28T18:10:02.727", "UserId": 88}
{"Id": 321, "PostId": 174, "Text": "@mfg to write a tag, use the following markup [tag:debate-points]", "CreationDate": "2010-12-28T20:36:47.670", "UserId": 119}
{"Id": 322, "PostId": 174, "Text": "@dmi ok thanks for the tip", "CreationDate": "2010-12-28T20:39:01.037", "UserId": 135}
{"Id": 323, "PostId": 173, "Score": 1, "Text": "I guess I am just looking at the potential of this site from a different (and wrong as far as traditional stack format) angle then. I see being able to get the opinions of other atheists on subjective questions as extremely useful. I personally am far from 'knowing' everything, and do not have easy access to other atheists to discuss subjective things with. The great thing about this site is that you get feedback fast, and assuming there is a strong active base of atheists moderating and voting, the rubbish answers are 'filtered' out. ", "CreationDate": "2010-12-28T21:42:15.583", "UserId": 150}
{"Id": 324, "PostId": 152, "Score": 2, "Text": "Actually I think your comment was more insulting than mine: I at least believed that they would be able to read a holy book and then be able to form the opposite hypothesis, whereas you implied that to read the bible was to be in serious danger of being converted, no matter what your beliefs were. If you can't read a religious text respectfully, or an atheist text critically, then your beliefs are already on shaky ground.", "CreationDate": "2010-12-28T22:42:22.577", "UserId": 169}
{"Id": 325, "PostId": 167, "Score": 1, "Text": "Oops: I meant pro-atheism-arguments and pro-religion-arguments. (Heads I win, tails you lose).", "CreationDate": "2010-12-28T23:25:47.167", "UserId": 270}
{"Id": 326, "PostId": 176, "Text": "I agree with Josiah", "CreationDate": "2010-12-28T23:59:16.057"}
{"Id": 327, "PostId": 180, "Text": "@Peter: I understand there are a lot of religious folks that probably fail on all the points you outlined, but it seems most of the reaction to my posts could be summarized as, \"you (or whoever you cited) don't know the first thing about ___\" with zero explanation. This answer is typical: \"you really have nothing to contribute to a discussion about evolution. And once again, the source you cite is utter [Barbara Streisand]. It contains almost as many factual errors as it contains words, and the conclusion is of course based on a complete misunderstanding of the research it cites.\"", "CreationDate": "2010-12-29T01:48:29.423", "UserId": 378}
{"Id": 328, "PostId": 176, "Text": "@Josiah I agree, but presently it's that kind of answer which is the best answer (by over 8 votes and has only one downvote). Meanwhile, my answer which is of the highest ranked answer of first type got three downvote...", "CreationDate": "2010-12-29T02:42:13.107", "UserId": 484}
{"Id": 329, "PostId": 176, "Text": "@Borror0, how do we fix that?", "CreationDate": "2010-12-29T02:55:39.203", "UserId": 88}
{"Id": 330, "PostId": 176, "Text": "@Josiah On a personal basis, I downvote bad answers whenever I see them. If more do that, we'll see a change. But we may be out-numbered.", "CreationDate": "2010-12-29T02:58:38.453", "UserId": 484}
{"Id": 331, "PostId": 176, "Text": "@Borror0, as long as you comment I don't hate you.", "CreationDate": "2010-12-29T03:40:24.627", "UserId": 88}
{"Id": 332, "PostId": 184, "Text": "That's a fair use if you go through Meta but check out http://meta.atheism.stackexchange.com/questions/149/what-should-be-our-current-etiquette-for-voting-to-close-and-su-editing for some additional ideas on that ", "CreationDate": "2010-12-29T03:42:03.047", "UserId": 135}
{"Id": 334, "PostId": 180, "Text": "@The preacher: Ironically, your comments so far conform to every single point on that list. And since you especially conform to point (3) we (well, I in particular) are not in the mood to explain to you, *once again*, what has already been explain a million times.", "CreationDate": "2010-12-29T11:19:08.170", "UserId": 82}
{"Id": 335, "PostId": 73, "Score": 1, "Text": "See also: http://meta.atheism.stackexchange.com/questions/4/what-should-our-faq-contain/175#175", "CreationDate": "2010-12-29T11:21:24.703", "UserId": 82}
{"Id": 337, "PostId": 180, "Text": "Thanks Konrad, I couldn't have said it better myself. ", "CreationDate": "2010-12-29T12:17:16.013", "UserId": 168}
{"Id": 338, "PostId": 155, "Text": "Isn't the entire point of the voting system to let the cream rise to the top? More answers from more varied people equals better answers in the long run? Perhaps we shouldn't be reaching out to the bottom of the barrel, but guys like those at http://aristophrenium.com/ could do nothing but help us hone our arguments.", "CreationDate": "2010-12-29T12:35:09.947", "UserId": 587}
{"Id": 339, "PostId": 185, "Text": "We haven't quite gotten a formalized etiquette and protocol around closing, wikifying, or even a working definition of atheism. However, check out http://meta.atheism.stackexchange.com/q/4/135 and add your suggestion.", "CreationDate": "2010-12-29T14:13:51.373", "UserId": 135}
{"Id": 340, "PostId": 180, "Text": "@Peter/Konrad: Your responses illustrate my concern because while I might understand your claim that I'm guilty of 2-4, to say that I'm abysmally ignorant of my own religion is whack. That's like me saying that neither of you know the first thing about evolution. At least I have the good sense to know better than that.", "CreationDate": "2010-12-29T14:18:08.743", "UserId": 378}
{"Id": 342, "PostId": 175, "Score": 1, "Text": "I'm not sure if my interest in this question makes what I will say strange or appropriate, but I would suggest that this is *not* included, as it seems to currently be one of the most popular discussion points on this website itself. It may be that atheism is as varied as theism in its formulations, and, IMHO, we should work to not exclude anyone who identifies as an atheist from this community. Giving a definition that conflicts with their definition, might do that. Perhaps instead we just link to the running discussion on the site itself pointing out the difficulty of defining atheism.", "CreationDate": "2010-12-29T14:40:49.153", "UserId": 404}
{"Id": 343, "PostId": 175, "Text": "For the purposes of conversing about Atheism I think we will be best suited with an accommodating definition (i.e. one that includes the largest number of experts).", "CreationDate": "2010-12-29T14:43:25.413", "UserId": 135}
{"Id": 344, "PostId": 175, "Score": 1, "Text": "To have an exclusive one, along the lines of 'atheism denies all supernatural explanations' (which is a few claims further than simply one who lacks a belief in god) or whatever, adds more baggage to the name than necessary and limits the ability to talk about atheism generally. That said, there should be included a good discussion of the various strains of atheism (ie natural materialism, etc) so that those terms can be used effectively/technically as well. ", "CreationDate": "2010-12-29T14:43:55.040", "UserId": 135}
{"Id": 345, "PostId": 175, "Text": "@This that, though, is not a discussion for the front page. It is a meta discussion and should be held (if at all) on the meta.", "CreationDate": "2010-12-29T14:44:35.383", "UserId": 135}
{"Id": 347, "PostId": 60, "Score": 1, "Text": "So I do categorization research in machine learning, the particularized content of this site, as well as the thriving and lively community here may make this a feasible project. I'm going to talk to one of my colleagues about coming up with some algorithms to begin to automate this type of process. Testing it may require some help on your guys' part, and no promises about figuring it out either (the chances of me getting wrapped up in some projects for my actual research are high), but it is now on my official docket.", "CreationDate": "2010-12-29T14:50:32.480", "UserId": 404}
{"Id": 348, "PostId": 60, "Text": "@This sounds good, the only wariness is to always monitor words whose meanings are not agreed upon.", "CreationDate": "2010-12-29T14:53:29.527", "UserId": 135}
{"Id": 349, "PostId": 189, "Score": 1, "Text": "Why do you insist on calling it EXP?", "CreationDate": "2010-12-29T16:21:10.283", "UserId": 362}
{"Id": 350, "PostId": 189, "Text": "Sorry, my mistake. I just realized it.", "CreationDate": "2010-12-29T16:23:32.217", "UserId": 5}
{"Id": 351, "PostId": 190, "Text": "I'm not doubting the quality of the submission -- I read Wikipedia, and if permitted I'd upvote it on Wikipedia. I'm saying that he just copy-and-pasted the article: it isn't his original work. It was illegal, and in the process he now has bettered his own position. Any maxim of equity would lead you to the conclusion that rewarding this behavior is a moral blunder.", "CreationDate": "2010-12-29T16:28:28.890", "UserId": 5}
{"Id": 352, "PostId": 189, "Text": "Also, I don't think that your banning from MSO is relevant here.  No need to bring up old wounds.", "CreationDate": "2010-12-29T16:29:03.070", "UserId": 362}
{"Id": 353, "PostId": 190, "Text": "@Evan, I see where you are coming from.  And I agree that action should be taken, but I stick to my opinion that deleting the content is not the right answer.", "CreationDate": "2010-12-29T16:31:39.123", "UserId": 362}
{"Id": 354, "PostId": 189, "Text": "What will probably happen, and often does, is my post get migrated to MSO where I'm silent to defend it. Then Jeff closes it and deletes it in a final act of censorship. If this one get migrated, I've included some background which will assist the discussion.", "CreationDate": "2010-12-29T16:31:49.030", "UserId": 5}
{"Id": 355, "PostId": 190, "Text": "Well, then at least we agree that Robert Cartaino should be removed. I'd even be willing to entertain reseting the question to 0 reputations, and adding the citation. We could even provide the user with a red-badge **I.P. THIEF**.", "CreationDate": "2010-12-29T16:34:05.017", "UserId": 5}
{"Id": 356, "PostId": 189, "Text": "I don't think this should get migrated.", "CreationDate": "2010-12-29T16:34:42.863", "UserId": 362}
{"Id": 357, "PostId": 189, "Score": 1, "Text": "@jjnguy, I agree. The group here seems much more open minded and willing to partake in civil discussion then the blathering despotic brutes of MSO.", "CreationDate": "2010-12-29T16:36:53.253", "UserId": 5}
{"Id": 358, "PostId": 190, "Score": 2, "Text": "@Evan, I agree with the removing the rep.  But public branding feels so old-western to me.", "CreationDate": "2010-12-29T16:48:14.107", "UserId": 362}
{"Id": 360, "PostId": 194, "Text": "Can we remove all of the votes on the post by a special cased administrative reset? I'm actually fond of Borror0's suggestion.", "CreationDate": "2010-12-29T18:16:11.583", "UserId": 5}
{"Id": 361, "PostId": 194, "Score": 1, "Text": "There's really no precedent for auditing the *intentions* of someone's vote. People vote for difference reasons so I'm not too keen on simply undoing votes place by others (as noted by @jjnguy (http://meta.atheism.stackexchange.com/questions/189/rewarding-plagiarizers-is-a-bad-idea/190#190). Even in cases where up-voted posts can be shown to be \"wrong\" or ill-informed, editing a post has never changed the legitimacy of previous votes. As it stands now, the post will have to be either deleted as non-compliant, or fixed and embraced lovingly by the system.", "CreationDate": "2010-12-29T19:02:49.250", "UserId": 155}
{"Id": 362, "PostId": 194, "Text": "Right, but that's bad logic. If the election is flawed a recount is due. If you're technically incapable of canvasing the voters for the recount then you owe in due diligence to acknowledge the vote was flawed and discard it on the whole. This still doesn't address the punitive aspect of plagiarism. Or, why you feel the burden should be on the us to provide evidence for negative intent when the effect was obviously plagiarism.", "CreationDate": "2010-12-29T19:23:22.597", "UserId": 5}
{"Id": 363, "PostId": 194, "Text": "@Robert, in that case can plagiarized answers be turned into Community Wiki? A penalty for the cheater (no more reputation for the answer) but avoids the penalizing the community.", "CreationDate": "2010-12-29T19:23:38.210", "UserId": 484}
{"Id": 364, "PostId": 194, "Text": "Just for the record, as of now me, mfg, jjnguy, and Borror0 all want the earned rep removed.", "CreationDate": "2010-12-29T19:29:36.523", "UserId": 5}
{"Id": 365, "PostId": 194, "Score": 1, "Text": "Delete the thing and it all goes away. IF someone wants to properly resubmit as cw with citation, whatever works.", "CreationDate": "2010-12-29T20:34:09.073", "UserId": 88}
{"Id": 366, "PostId": 194, "Score": 2, "Text": "@Robert, I would be in favor of deleting it I guess.  I really don't care that the user got some extra rep on the post, but I can see why others might.  I'd rather not raise a big stink about attribution so others become afraid to quot other things they have read.", "CreationDate": "2010-12-29T20:40:32.577", "UserId": 362}
{"Id": 368, "PostId": 175, "Score": 1, "Text": "It's a-theism not a-toothfairyism. I wish people would stop cramming things into atheism.", "CreationDate": "2010-12-29T22:05:16.807", "UserId": 169}
{"Id": 369, "PostId": 194, "Text": "@jjnguy, @Josiah: It's gone. The author is welcome to repost with due attribution. ", "CreationDate": "2010-12-30T00:07:31.363", "UserId": 155}
{"Id": 370, "PostId": 159, "Score": 1, "Text": "@Konrad: Duplicate answers are also a bad thing. One answer you disagree with should suffice.", "CreationDate": "2010-12-30T03:32:22.100", "UserId": 270}
{"Id": 371, "PostId": 196, "Text": "The whole \" experts on atheism\" ( and whatever else) part is up for debate, but that is why this is community wiki ", "CreationDate": "2010-12-30T05:12:09.940", "UserId": 135}
{"Id": 372, "PostId": 60, "Text": "@mfg As I'm thinking about it, you wouldn't consider the actual meanings of the words but the similarity of the questions. Using Latent Semantic Analysis (which is how I think SO does the \"consider this question before you post yours\") we'll get a measurement of the similarity. We can use that measure and consider everything as a member of some subset of mutually exclusive categories, and see how well the categories the algorithm comes up with matches the tags given. Whenever there is a huge mismatch, that could flag someone to look at the post to see if the tags are appropriate.", "CreationDate": "2010-12-30T05:16:45.850", "UserId": 404}
{"Id": 373, "PostId": 60, "Text": "Also there are better judgments of linguistic similarity than LSA, but that's just a quick first pass as I haven't thought of this too deeply yet.", "CreationDate": "2010-12-30T05:17:19.793", "UserId": 404}
{"Id": 374, "PostId": 200, "Text": "I completely agree, but it should eliminate things that it is not, which is why I posted my second response to this question, to clarify what atheism *isn't* is actually really important. Also I like your definition which uses \"lack of belief\" as opposed to disbelief, since disbelief is unclear as to whether it means a \"lack of belief\" or \"belief in the negative of\".", "CreationDate": "2010-12-30T05:20:47.077", "UserId": 404}
{"Id": 375, "PostId": 180, "Score": 1, "Text": "@ The Preacher: your citation that 'proves' the historical accuracy of the bible is perfect example of you being either ignorant of your religion or dishonest in making that claim. You are either unaware of the historical inaccuracies or chose to dishonestly ignore them. ", "CreationDate": "2010-12-30T11:10:22.547", "UserId": 168}
{"Id": 376, "PostId": 200, "Text": "@this I think you have a good rundown of the biggest sticking points that get some posts tripping over themselves after the fact, especially with skepticism and materialism.", "CreationDate": "2010-12-30T11:56:03.863", "UserId": 135}
{"Id": 378, "PostId": 203, "Text": "This answer above is a corollary to your question. This is a partial dupe of \"To death...\" but I understand the tangent you are addressing. My other answer actually directly addresses the question.", "CreationDate": "2010-12-30T15:57:33.860", "UserId": 135}
{"Id": 379, "PostId": 200, "Text": "Well, you know I agree with that. But it seems like people always get ticky when you hold them to the strict definition. I think this question is useful, if only so we can say, \"No one could come up with anything to add\"", "CreationDate": "2010-12-30T15:58:58.757", "UserId": 169}
{"Id": 380, "PostId": 200, "Text": "Same here. I think that having some negative and positive quantifiers for the definition should be wedged into the FAQ definition as some kind of list.", "CreationDate": "2010-12-30T16:04:35.477", "UserId": 135}
{"Id": 381, "PostId": 204, "Text": "OK, I'm guessing from the \"to death with polls\" question that \"Is it tough...\" is the hated poll kind of question. Why does it have zero close votes then? Do they expire or something?", "CreationDate": "2010-12-30T16:17:03.960", "UserId": 89}
{"Id": 382, "PostId": 139, "Text": "+1 for `keep some polls`.", "CreationDate": "2010-12-30T16:24:00.240", "UserId": 89}
{"Id": 383, "PostId": 194, "Text": "@\"Just for the record\": the comment I made is this - \"Although I don't feel a heavy handed approach is best, I hadn't realized that the answer contains no original material. It seems reasonable to strip the rep, though it also seems like a harsh way of welcoming someone to the site.\ni still don't know what i would do if it were my choice, but i havent been in that spot before. i suppose that i would strip the rep, and basically let that be a warning shot[.]\nit's only one questions worth of rep [and if losing that is worth so much to a user they value the rep too much.]\"", "CreationDate": "2010-12-30T16:24:03.527", "UserId": 135}
{"Id": 384, "PostId": 131, "Score": 3, "Text": "[Closing some of them is very inconsistent](http://meta.atheism.stackexchange.com/questions/201/is-atheism-community-extremely-inconsistent-in-judging-what-to-close). I'm most happy with \"keep all\", followed by \"close all\" - definitely not \"pick which ones to keep randomly\".", "CreationDate": "2010-12-30T16:25:48.630", "UserId": 89}
{"Id": 385, "PostId": 191, "Text": "From above: Although I don't feel a heavy handed approach is best, I hadn't realized that the answer contains no original material. It seems reasonable to strip the rep, though it also seems like a harsh way of welcoming someone to the site... i suppose that i would strip the rep, and basically let that be a warning shot[for others who would plagiarize.] it's only one questions worth of rep [and if losing that is worth so much to a user they value the rep too much.]", "CreationDate": "2010-12-30T16:26:17.610", "UserId": 135}
{"Id": 386, "PostId": 204, "Text": "@Romy nah. there's always a few crappy questions that get up there in the first few days, and are too popular and the community embraces them. I think it's a terrible question. it's a poll. but do i want to go uphill against a CW to get it closed now that nobody is getting rep rewards from it? not so much.", "CreationDate": "2010-12-30T16:33:17.137", "UserId": 135}
{"Id": 387, "PostId": 201, "Score": 2, "Text": "We've gotten better at it. Are you expecting us not to figure out what is and isn't okay? Vote close things and tell us in chat. If we agree, we'll do it.", "CreationDate": "2010-12-30T17:02:24.870", "UserId": 88}
{"Id": 388, "PostId": 204, "Text": "@mfg So you don't mind CW polls that much. Now if only I could actually tag mine CW.", "CreationDate": "2010-12-30T17:06:25.227", "UserId": 89}
{"Id": 389, "PostId": 205, "Score": 1, "Text": "Forgive me for quoting you without permission, but you said \"I'm not touching the country thread because it's actually interesting to read\" in chat. Does this mean that you advocate closing based on personal interest as opposed to being or not being a poll?", "CreationDate": "2010-12-30T18:03:23.860", "UserId": 89}
{"Id": 390, "PostId": 201, "Text": "@Josiah it's not about that. It's about consistency. There is zero consistency in the current approach. I've added some further points to my question.", "CreationDate": "2010-12-30T18:06:17.507", "UserId": 89}
{"Id": 393, "PostId": 175, "Text": "@Satanicpuppy: and I wish people would learn to distinguish between shape and meaning. “atheism” is merely a (very stupid) name. A-theism that does not contain a-toothfairyism is a philosophically irrelevant concept. Not something you would need a q’n’a site about. I concur that it certainly exists (take buddhism, if you insist) but it is, as I argue, utterly meaningless.", "CreationDate": "2010-12-30T23:02:52.683", "UserId": 82}
{"Id": 394, "PostId": 175, "Text": "@This: that would be a *great* question on a philosophy SE. Not here. The question boils down to “so what’s this site actually about?” and having this question pop up at least five times a day annoys the hell out of me. *And* I am apparently really confused in the answer (or at least in the apparent minority concerning the definition). The literalism of people here really makes me despair.", "CreationDate": "2010-12-30T23:05:24.940", "UserId": 82}
{"Id": 395, "PostId": 208, "Score": 3, "Text": "This question belongs on meta.atheism.stackexchange.com. Vote to close and move.", "CreationDate": "2010-12-30T21:47:42.847", "UserId": 541}
{"Id": 396, "PostId": 205, "Text": "As mfg explained, the country question could pass [the six steps test](http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/) for subjective questions. *That* is why I don't mind it staying around. With that said, I voted to close the country question. Don't be so quick to label someone an hypocrite next time.", "CreationDate": "2010-12-31T00:13:58.537", "UserId": 484}
{"Id": 399, "PostId": 211, "Text": "What in the world is that?", "CreationDate": "2010-12-31T02:21:06.643", "UserId": 378}
{"Id": 401, "PostId": 199, "Text": "I think the one about amoralism doesn't belong. The others we know they are (or can be) confused with atheism, not this one.", "CreationDate": "2010-12-31T03:29:19.900", "UserId": 484}
{"Id": 402, "PostId": 208, "Text": "You should know how a stackexchange sites work. (Area51)", "CreationDate": "2010-12-31T05:21:49.840", "UserId": 639}
{"Id": 403, "PostId": 201, "Score": 1, "Text": "@rom, that was my point. We're all learning. It would be nice to see consistency, but we're probably not going to notice things that aren't on the first page.", "CreationDate": "2010-12-31T05:23:04.243", "UserId": 88}
{"Id": 405, "PostId": 207, "Text": "@Borror0 - agreed, thanks. I especially like your suggestion =:-)", "CreationDate": "2010-12-31T07:31:17.427", "UserId": 638}
{"Id": 406, "PostId": 211, "Text": "@ThePreacher It's a reference to a meme known as \"All your base are belong to us.\" http://www.youtube.com/watch?v=qItugh-fFgg/", "CreationDate": "2010-12-31T09:55:05.863", "UserId": 484}
{"Id": 409, "PostId": 215, "Text": "How to delete your account:\n\n   1. Edit your profile to say \"please delete me\" so we can confirm your ownership of the account.\n   2. Obtain your user page URL or numeric user ID. This is linked from the top of every page of the site, when you are logged in.\n   3. Email the support address linked at the bottom of every web page on the site. Where it says \"contact us\", click that. In your email, you MUST include your user page URL or user ID so we can find your account. \n\nfrom: http://meta.stackoverflow.com/questions/5999/can-i-delete-my-account", "CreationDate": "2010-12-31T16:31:05.747", "UserId": 398}
{"Id": 410, "PostId": 217, "Text": "So what you're saying is a plagiarizer with 10 marks of \"It helped, thanks!\" is appropriate because \"helped\" isn't predicated on being non-plagiarized. Brilliant.", "CreationDate": "2010-12-31T16:47:05.203", "UserId": 5}
{"Id": 411, "PostId": 217, "Text": "I also don't agree that malicious intent is unlikely or that the burden of proving an impure intent should be on the person who committed the plagiarizing. That's like requiring a victim of gunshot to prove it was the intent of the shooter to shot him.", "CreationDate": "2010-12-31T16:51:30.177", "UserId": 5}
{"Id": 412, "PostId": 217, "Text": "I am sorry but I must say I agree with your particular sentence given above. It is especially true on sites like stackexchange & superuser, where what I want is just an answer. Not that it is very correct, but it helped. ", "CreationDate": "2010-12-31T16:55:29.270", "UserId": 398}
{"Id": 413, "PostId": 217, "Text": "I don't think we have so many members here spending time on a site earning \"reputation points\" by plagiarizing - I would suggest those who do \"plagiarize with a malicious intent to earn reputation points\" to get a life. ", "CreationDate": "2010-12-31T16:57:54.023", "UserId": 398}
{"Id": 414, "PostId": 219, "Text": "@Rob: I like that you focus on the type of questions rather than the beliefs of the questioner. Not sure what atheistic thinking is, though. ", "CreationDate": "2010-12-31T22:27:19.980", "UserId": 638}
{"Id": 415, "PostId": 156, "Text": "In is profile, Rob Schneider say : \". I hate the label \"atheist,\" and prefer to take the LaPlace'ian stance on where God fits into the world. \"Sir, I have no need of that hypothesis.\"\"  I think this stance could be an interesting idea of an alternative name.", "CreationDate": "2010-12-31T22:39:27.520", "UserId": 408}
{"Id": 416, "PostId": 219, "Score": 2, "Text": "@WikiSpeedia...  perspective.  We all know that believers look at the world with a certain lens or filter.  Atheists do too, and sometimes the new perspective can be shocking or misunderstood by believers.  So \"Atheistic thinking\" is \"perspective\" on things believers take for granted.  Could be almost any topic... and I SPECIFICALLY try to avoid the answer, \"There is no such thing as atheistic thinking.  The only thing atheists agree on is lack of belief in God\" or some such.  You'll see I have a couple posts/questions on that topic, even here on Meta.", "CreationDate": "2011-01-01T06:08:57.093", "UserId": 149}
{"Id": 417, "PostId": 219, "Text": "@Rob - great answer for me because it went beyond what I was expecting. Thanks again.", "CreationDate": "2011-01-01T07:15:03.087", "UserId": 638}
{"Id": 418, "PostId": 212, "Score": 2, "Text": "Could it be a SE 1.0 site?", "CreationDate": "2011-01-01T13:44:00.380", "UserId": 270}
{"Id": 419, "PostId": 210, "Text": "I wish the religion one was up and running. So many anti-religion questions, so off-topic for this SE... There's also an Islam SE being proposed.", "CreationDate": "2011-01-01T13:49:08.820", "UserId": 270}
{"Id": 420, "PostId": 220, "Score": 2, "Text": "I vote up your question.", "CreationDate": "2011-01-01T14:51:23.407", "UserId": 197}
{"Id": 421, "PostId": 220, "Text": "I'd like more questions to be asked, but I certainly don't have any myself. Not sure what I'd like to ask about atheism. I know everything I want to know about it. I still learn stuff where I didn't expect it, but it's kinda hard to ask questions to receive answers you don't expect.", "CreationDate": "2011-01-01T18:43:30.610", "UserId": 144}
{"Id": 422, "PostId": 211, "Text": "It's also pretty damned accurate.", "CreationDate": "2011-01-02T09:36:29.027", "UserId": 524}
{"Id": 423, "PostId": 199, "Text": "I don't believe that you are correct about \"Atheism is not skepticism: one need not be a skeptic about the existence of everything including, e.g., fairies or unicorns to be an atheist\" - If you review the mythological literature whatever *you* might consider merely a superstition might well have been worshiped by others.  Fairies are a good example, take a look at wiccans.  Honestly I think atheism leads to a pretty fundamental disbelief in supernaturalism.", "CreationDate": "2011-01-02T09:47:56.587", "UserId": 524}
{"Id": 424, "PostId": 189, "Text": "Evan, if _you_ don't bring up the issues from MSO, _we_ won't bring up the issues from MSO. I was actually (no kidding) looking to see if Robert had opened the conversation regarding initial moderators with the idea of nominating you. I think you are a driving force behind this site .. but lets leave MSO out of this.", "CreationDate": "2011-01-02T15:14:14.647", "UserId": 208}
{"Id": 425, "PostId": 65, "Text": "An interesting thing about this world, people would be more shocked at someone _cloning_ a baby than eating one. I like your second idea.", "CreationDate": "2011-01-02T15:17:36.453", "UserId": 208}
{"Id": 426, "PostId": 212, "Text": "@Andrew - I think there _is_ a SE 1.0 site for that, but I fail to recall the name / link.", "CreationDate": "2011-01-02T15:19:14.017", "UserId": 208}
{"Id": 427, "PostId": 210, "Text": "Sir, I resemble that remark!", "CreationDate": "2011-01-02T21:03:31.980", "UserId": 587}
{"Id": 428, "PostId": 189, "Text": "Wow. I just now made the connection between the most productive and most constructive contributor on this site and the greatest troll on meta.stackoverflow.com.", "CreationDate": "2011-01-03T12:26:42.097", "UserId": 82}
{"Id": 429, "PostId": 189, "Score": 2, "Text": "@Konrad I've never been trolling before, not even once. Those posts  on MSO were unpopular because they were a minority opinion, and MSO is burdened by majority tyranny twice over: by the populous and the great despotic majesty.", "CreationDate": "2011-01-03T16:08:49.047", "UserId": 5}
{"Id": 430, "PostId": 227, "Text": "I don't see any reason to down vote and vote to close. I think closing is enough of a notice that they done goofed.", "CreationDate": "2011-01-04T01:09:48.770", "UserId": 88}
{"Id": 431, "PostId": 206, "Text": "possible duplicate of [Is this only for atheists?](http://meta.atheism.stackexchange.com/questions/113/is-this-only-for-atheists)", "CreationDate": "2011-01-04T01:24:27.530", "UserId": 80}
{"Id": 432, "PostId": 220, "Score": 1, "Text": "I'm trying to picture an elite atheist. Do they believe in God even less?", "CreationDate": "2011-01-04T04:15:59.417", "UserId": 88}
{"Id": 433, "PostId": 199, "Text": "There are a few philosophies atheists may hold that are amoral. You meant to say immoral, I think. They're not the same.", "CreationDate": "2011-01-04T04:22:38.850", "UserId": 88}
{"Id": 434, "PostId": 220, "Text": "@Josiah - I think they just believe in themselves more. There cannot be anything lower than a mere zero. ", "CreationDate": "2011-01-04T06:30:34.273", "UserId": 398}
{"Id": 435, "PostId": 199, "Text": "@Borror0: This historically has been a huge one, particularly among theists, so tossing that in on the faq i think would be useful. @ObdurateDemand: No a fundamental belief in supernaturalism is Metaphysical Naturalism if you want to be strict about it. Skepticism is going even further than that, e.g. an atheist might believe in the goodness of \"natural remedies\" that a skeptic might dismiss. @Josiah: to say that atheism is not amoralism is not to say no atheists are amoral, but that not all atheists must be amoral. I meant to say amoral, for atheists can believe in morals (e.g. Sam Harris).", "CreationDate": "2011-01-04T14:44:40.120", "UserId": 404}
{"Id": 436, "PostId": 227, "Text": "But in any case, leave a comment why you did whatever you did that was negative. So they know HOW they done did wrong. :)", "CreationDate": "2011-01-04T15:08:17.083", "UserId": 587}
{"Id": 437, "PostId": 227, "Text": "I actually try to leave a comment, then wait for some time, before acting. Unless the question/answer  itself is completely unsalvageable - in which case I down vote or close and leave a message (if needed - when closing you have to give a reason).", "CreationDate": "2011-01-04T15:18:13.277", "UserId": 675}
{"Id": 438, "PostId": 234, "Score": 1, "Text": "I'm in agreement with you, @Satanicpuppy. It's your personal opinion if you want to be an atheist. I just can't stand when someone gets in my face and condescends to me because I believe in God. Doesn't \"live and let live\" apply to atheism? It obviously just comes down to the person.", "CreationDate": "2011-01-04T16:01:29.860", "UserId": 382}
{"Id": 439, "PostId": 234, "Score": 4, "Text": "@ramy: I agree. My point is more that being an in-your-face jerk isn't attached to religion/lack thereof. I think, in a more general sense, the whole SE community still skews toward Stackoverflow/Serverfault/Superuser users, and those people skew toward geeky know-it-alls who believe there is a *right* answer.", "CreationDate": "2011-01-04T16:13:15.127", "UserId": 169}
{"Id": 440, "PostId": 233, "Score": 4, "Text": "+1 for \"Atheism.SE isn't about debating the validity of atheism\"; you might add that to http://meta.atheism.stackexchange.com/questions/4/what-should-our-faq-contain/196#196", "CreationDate": "2011-01-04T17:30:42.957", "UserId": 135}
{"Id": 441, "PostId": 234, "Score": 1, "Text": "@Satanicpuppy: I believe you describe the whole Internet there, not just StackOverflow/ServerFault/SuperUser users. ;)", "CreationDate": "2011-01-04T18:48:32.327", "UserId": 484}
{"Id": 442, "PostId": 238, "Score": 1, "Text": "I love how people downvote but don't comment. Nice way to contribute to the conversation guys! ", "CreationDate": "2011-01-05T11:33:42.863", "UserId": 484}
{"Id": 443, "PostId": 238, "Text": "Those are probably my anti-fans dispatched by Jeff from MSO. That's their MO.", "CreationDate": "2011-01-05T15:29:13.313", "UserId": 5}
{"Id": 444, "PostId": 244, "Text": "Do you think that the tag `resources-references` is sufficient for this? It is a highly adopted tag", "CreationDate": "2011-01-05T19:53:48.033", "UserId": 135}
{"Id": 445, "PostId": 244, "Text": "To some degree, but I think that it is better to collect them in one location, or once it gets too big, by topic.", "CreationDate": "2011-01-05T19:57:54.670", "UserId": 541}
{"Id": 446, "PostId": 219, "Text": "Perhaps it should say \"atheistic philosophy\"? That way it captures both 'thinking' and 'worldview', while also avoiding the argument that there is no commonality to atheistic thinking (well, it avoids that for anyone who understands that philosophies are diverse). Though honestly, I'm not sure how important the distinction is...", "CreationDate": "2011-01-06T00:26:51.177", "UserId": 658}
{"Id": 447, "PostId": 218, "Text": "I would like to do the same, but just on the atheism.stackexchange.com site. I would like to leave my other accounts on stack exchange intact. Is this possible?", "CreationDate": "2011-01-06T06:41:53.117", "UserId": 206}
{"Id": 448, "PostId": 232, "Score": 4, "Text": "Is there so much outright hostility and proselytizing? Could you link to some examples?", "CreationDate": "2011-01-06T07:05:26.230", "UserId": 658}
{"Id": 449, "PostId": 145, "Score": 1, "Text": "Could you clarify your answer? It seems you're saying the opposite of what you mean. I.e., your programming example is a question with a known answer (many known answers in fact). Do you mean an 'unknown answer' is a response to a question with no single correct answer, but many? Or that the 'unknown' part is that the questioner doesn't know the answer, though an answer does exist? I assume it's not the latter, since that applies to every question that anyone asks (unless it's rhetorical). In short, I don't understand your criteria for what constitutes a 'real question'.", "CreationDate": "2011-01-06T07:20:02.723", "UserId": 658}
{"Id": 451, "PostId": 218, "Text": "@bakoyaro: Just follow the procedure listed in the comments in @bubu's answer: http://meta.atheism.stackexchange.com/questions/214/is-there-a-way-to-delete-my-account-completely/215#215", "CreationDate": "2011-01-06T14:35:42.297", "UserId": 155}
{"Id": 452, "PostId": 232, "Text": "the example i had in mind has been deleted. I could find some others if you'd like.", "CreationDate": "2011-01-06T16:19:44.390", "UserId": 382}
{"Id": 453, "PostId": 227, "Text": "I vote to close and down vote later. It's not so much retaliatory in the event of a question not being closed, it's frequently that there are still problems with the questions relevance/structure that may not have been enough to close but enough to not have bubble up to the top.", "CreationDate": "2011-01-06T18:19:03.867", "UserId": 135}
{"Id": 454, "PostId": 145, "Text": "@Solus: +1 Sorry that I didn't explain too well. By \"unknown answer\" I mean that a clear and more or less objective answer exists, but the questioner does not know it. I am editing my answer to show this. Thanks for your point.", "CreationDate": "2011-01-06T19:18:47.403", "UserId": 80}
{"Id": 456, "PostId": 232, "Score": 4, "Text": "Yes, we would like.  ", "CreationDate": "2011-01-07T14:17:19.677", "UserId": 149}
{"Id": 458, "PostId": 219, "Text": "Okay... so, I know 5 upvotes does not a majority make.  But, if this is the currently accepted answer, how do we go about making the change to the definition out in the publicly visible space?", "CreationDate": "2011-01-07T14:41:36.157", "UserId": 149}
{"Id": 459, "PostId": 242, "Score": 1, "Text": "+1 for simplicity, flexibility.  The only \"work\" to be done on this approach is to make sure we don't end up with duplicate, though slightly differently phrased, answers.  Good approach.", "CreationDate": "2011-01-07T14:46:32.720", "UserId": 149}
{"Id": 460, "PostId": 249, "Score": 2, "Text": "I have to agree with you, Rob. Religion has had a free ride far too long. I keep finding questions posted that assume the religious point of view is somehow valid. We have to fight this at every step and question everything - both religious and atheistic. \n\nThe idea that atheists are proselytizing when they fight back against the religious tide originates with the assumption of religious privilege.", "CreationDate": "2011-01-07T20:00:55.443", "UserId": 168}
{"Id": 461, "PostId": 238, "Text": "-1 for categorical absolutism.", "CreationDate": "2011-01-08T04:42:09.260", "UserId": 740}
{"Id": 462, "PostId": 145, "Score": 1, "Text": "Ah excellent, that makes sense now, and I agree. I suspect a major reason that there are few real questions with clear answers is because a large part of atheism is philosophy, which is notoriously unclear (or at least, less than straightforward). There *are* other sorts of questions though, e.g., those of a more pragmatic nature as Rob suggested, e.g., 'What can be done to ensure public schools remain free from the influence of specific religions?'", "CreationDate": "2011-01-08T04:51:16.830", "UserId": 658}
{"Id": 464, "PostId": 131, "Text": "Since you've posted one yourself, what do you consider a polling question that shouldn't be posted? The criterion you've mentioned also applies to your question: http://atheism.stackexchange.com/questions/86/what-are-some-other-online-atheist-communities", "CreationDate": "2011-01-08T04:57:00.740", "UserId": 658}
{"Id": 465, "PostId": 131, "Score": 1, "Text": "@Solus That's not really a polling question. It might be a shitty question, but it isn't as much a polling one. At least in theory it is possible to publish a list of all of the atheist's communities and then the question concludes. It isn't explicitly tied to the reader. It would be a polling question if I asked *\"What community do you like best and why?\"*", "CreationDate": "2011-01-08T16:28:00.583", "UserId": 5}
{"Id": 466, "PostId": 238, "Text": "@Matthew Read, would you ever close a question for being \"Too good for atheism.stackexchange\" ?", "CreationDate": "2011-01-08T16:30:00.410", "UserId": 5}
{"Id": 467, "PostId": 250, "Text": "I can actually see it working in this context, but that's only one of the three reasons people are using \"Too Local\": *\"This question would only be relevant to a small geographic area, a specific moment in time, or an extraordinarily narrow situation that is not generally applicable to the worldwide audience of the internet\"*", "CreationDate": "2011-01-08T16:31:42.687", "UserId": 5}
{"Id": 468, "PostId": 238, "Text": "@Evan Yes, if it were beneficial to this site.  Just because I can't imagine such a question means little.  And the comparison is bad because there is a large subset of localized questions that are detrimental to the site, whereas I know of no good questions that are detrimental to the site.  There are guidelines about what Too Local is for a reason.  Your fairly localized question is not *too* local.", "CreationDate": "2011-01-08T20:43:25.473", "UserId": 740}
{"Id": 469, "PostId": 145, "Text": "@Solus: Indeed.", "CreationDate": "2011-01-08T22:56:27.847", "UserId": 80}
{"Id": 470, "PostId": 239, "Text": "@downvoter: It would be nice if you explained why the downvote. If you downvote and don't comment on it, you are not helping much.", "CreationDate": "2011-01-08T23:02:00.040", "UserId": 80}
{"Id": 471, "PostId": 232, "Text": "ObdurateDemand's answer to this question is a good example:  http://atheism.stackexchange.com/questions/1539/what-is-the-proven-fact-to-support-the-argumentation-that-god-does-not-exist/1562#1562  The fact that it has been up-voted 7 times reinforces that there is some hostility in the community.", "CreationDate": "2011-01-09T02:49:55.320", "UserId": 340}
{"Id": 472, "PostId": 234, "Score": 2, "Text": "This thing called believe can make someone cause harm to another, while thinking it was the right thing to do. Point? You __should__ care what other people believe.", "CreationDate": "2011-01-09T05:52:44.953", "UserId": 141}
{"Id": 473, "PostId": 232, "Text": "Without analyzing, the simple answer is, because there is a lot of proselytizing going around, atheist or otherwise. In my estimate, there is less of it here than on other discussion forums with similar topics. So maybe this format is able to control it. I agree there are problems, but I'm hoping it is worth our efforts to work through them. ", "CreationDate": "2011-01-10T12:37:58.220", "UserId": 584}
{"Id": 474, "PostId": 223, "Score": 1, "Text": "However the question can be over generalized to the point of toothless. It can be carried one step further to account for any group with religious underpinnings.  Leaving that example as localized as it is remains a gamble; either there will be members from within the community to answer or there won't.  It should be up to OP to revise if they're. Not getting answers", "CreationDate": "2011-01-10T12:50:45.347", "UserId": 135}
{"Id": 475, "PostId": 252, "Score": 4, "Text": "If it's a genuine question people can answer with expertise, it's cool. If it's a poll asking for everyone's opinion I vote to close. If the site isn't working under proper SE rules, then it is the topic's fault, not ours, for failing to meet the necessary standards.", "CreationDate": "2011-01-10T15:27:03.510", "UserId": 88}
{"Id": 476, "PostId": 252, "Text": "These sites are community-centric. If the community as a whole decides to let things slide, they tend to. If the general consensus of us in this beta is we'd rather see the it go away than tolerate a little subjective discussion about the philosophy of Atheism, That's fine. But it does seem telling that we will have deemed our own arguments for validity subjective.", "CreationDate": "2011-01-10T15:36:01.367", "UserId": 587}
{"Id": 477, "PostId": 254, "Score": 2, "Text": "Also, we should spent a lot more energy on improving the clarity of answers. The fact that semantics is more important here than usual means that those with the ability to edit will need to edit questions more often, to avoid unnecessary debates.", "CreationDate": "2011-01-10T15:44:55.213", "UserId": 484}
{"Id": 478, "PostId": 254, "Text": "+1 because this is also true.", "CreationDate": "2011-01-10T15:48:46.037", "UserId": 587}
{"Id": 479, "PostId": 255, "Score": 2, "Text": "The problem here is that ANY question with subjective answers is being closed. Not just the ones that don't have satisfying, to Atheists, answers. I'd say that part of the point of this Q&A is to offer satisfying responses to arguments against atheism that atheists have come across. This is actually how things started out, but in the last few days those questions have all been closed very quickly.", "CreationDate": "2011-01-10T15:51:56.767", "UserId": 587}
{"Id": 480, "PostId": 255, "Text": "@DampeS8N: Without examples, it's hard to debate. You're going to have to list a few examples and argue for their usefulness.", "CreationDate": "2011-01-10T15:56:19.213", "UserId": 484}
{"Id": 481, "PostId": 255, "Text": "http://atheism.stackexchange.com/questions/2018/is-there-any-solid-authoritative-source-on-secular-ethics-morality here is the first example I found. Is the question perhaps poorly worded, sure, but too subjective?", "CreationDate": "2011-01-10T16:13:01.757", "UserId": 587}
{"Id": 482, "PostId": 255, "Text": "@DampeS8N: I think it says a lot about the question (and Atheism.SE) that the highest ranked answer isn't a book even though Sam Harris' book was the first answer posted. It's blatantly off-topic and is clearly about moral philosophy, not atheism.", "CreationDate": "2011-01-10T16:30:34.253", "UserId": 484}
{"Id": 483, "PostId": 255, "Score": 2, "Text": "I think it says a lot about A.SE that you didn't address my point and did exactly what you are complaining about.", "CreationDate": "2011-01-10T16:31:30.540", "UserId": 587}
{"Id": 484, "PostId": 255, "Text": "@DampeS8N: Let me elaborate: the fact that the upvotes were distributed like that is, to me, a good indicative of why the question is off-topic. People on this site are atheists, not experts of ethics. They are not the right audience to answer that question.", "CreationDate": "2011-01-10T16:41:23.450", "UserId": 484}
{"Id": 485, "PostId": 255, "Text": "Changing my comment here. I think rolling us into a larger group would help. I would support a full-scale religion or philosophy SE.", "CreationDate": "2011-01-10T16:44:07.190", "UserId": 587}
{"Id": 486, "PostId": 255, "Text": "http://area51.stackexchange.com/proposals/2578/philosophy?referrer=P4Tv-77p6C6Wm0SjsRBE2g2", "CreationDate": "2011-01-10T16:51:01.087", "UserId": 587}
{"Id": 487, "PostId": 252, "Text": "If you want to tear down the walls we have now, you'll have to propose a location for the new ones.", "CreationDate": "2011-01-10T17:35:44.037", "UserId": 88}
{"Id": 488, "PostId": 252, "Text": "I'm pointing out that the walls are falling down all by themselves.", "CreationDate": "2011-01-10T18:05:18.120", "UserId": 587}
{"Id": 489, "PostId": 252, "Text": "You're saying we're being too strict, I'm just suggesting that you'll get more traction if you suggest how strict we should be. Just saying \"ur doin it wrong\" won't help.", "CreationDate": "2011-01-10T19:45:30.960", "UserId": 88}
{"Id": 490, "PostId": 252, "Text": "I was looking for dialogue, but I can answer the question myself, I guess.", "CreationDate": "2011-01-10T19:47:50.607", "UserId": 587}
{"Id": 491, "PostId": 256, "Score": 1, "Text": "\"Are there benefits to religious education for atheists?\" or something similar might do better. And if you do edit it at some point, toss us the link in chat. On topic, though, I asked because I genuinely have no clue where to draw the line most of the time myself, and the more thoughts the better.", "CreationDate": "2011-01-10T22:53:32.410", "UserId": 88}
{"Id": 492, "PostId": 249, "Text": "I think there are plenty sites that allow for expressions of that anger. This SE seems to be an attempt to force an honest discussion without the labeling. You can be respectful without being subservient. One person's proselytizing is another's sharing of their passion. And atheists have plenty of passion. I'm all for being intolerant of intolerance, but in the right place. In this place, I think more is getting accomplished because of the respect. ", "CreationDate": "2011-01-10T23:15:54.740", "UserId": 584}
{"Id": 493, "PostId": 260, "Text": "OK, if you say so :)", "CreationDate": "2011-01-11T13:40:27.350", "UserId": 756}
{"Id": 495, "PostId": 261, "Text": "Why ban the possibility of merging into another StackExchange site (philosophy, religion, etc.) from this discussion? I think it's worthwhile to discuss as possibilities. The exclusion sounds, to me, as arbitrary. ", "CreationDate": "2011-01-11T15:35:59.913", "UserId": 484}
{"Id": 498, "PostId": 261, "Text": "@Bor add that as an answer; I personally agree with the likelihood that we will just end up with a bunch of thepreacher cross-posting disciplines, but to open up the field seems a good idea to consider at the very least", "CreationDate": "2011-01-11T16:26:46.017", "UserId": 135}
{"Id": 500, "PostId": 264, "Score": 2, "Text": "+1, for skepticism.", "CreationDate": "2011-01-11T17:48:44.010", "UserId": 106}
{"Id": 501, "PostId": 264, "Text": "@Vit remember, for either skeptics, 13% or 45% are already users of this site; 17% for philosophy", "CreationDate": "2011-01-11T18:45:25.430", "UserId": 135}
{"Id": 502, "PostId": 260, "Text": "It is exactly *those* types of questions that are driving these  *\"what is the value\"* threads. People are looking for \"meaning to those questions\"; or more accurately stated, hoping for questions that *have* meaning. The two cases you cited -- (1) no meaning, just mere curiosity, and (2) rhetoric just to make a point -- are a bane that will cause the eventual decay of this site.", "CreationDate": "2011-01-11T19:12:41.347", "UserId": 155}
{"Id": 503, "PostId": 260, "Score": 1, "Text": "@Robert: Statistics are important to *know* in and of themselves. For example, if a theist say \"atheists divorce far more often than theists\" having those statistics easily searchable on ASE *is* useful. Whether there are any study showing a relation between religiosity and if those results are of any significance is useful to *know* - especially if you want to shut up an anti-theist who keeps pointing you to that inane study. In of themselves, those questions don't have any meaning but they *are* useful.", "CreationDate": "2011-01-11T19:23:24.820", "UserId": 484}
{"Id": 504, "PostId": 255, "Text": "Great post, @DampeS8N.  IMO, many of the more interesting questions have been closed.  However, will rolling up SE.Atheism into Philosophy just swallow SE.A into the maelstrom of Kant and Nietzsche discussions?  ;-)  ", "CreationDate": "2011-01-11T19:23:39.887", "UserId": 58}
{"Id": 505, "PostId": 256, "Text": "I'm hoping that the question authors are being given a chance to clarify their questions before it's closed, at least.... ?", "CreationDate": "2011-01-11T19:29:52.707", "UserId": 58}
{"Id": 506, "PostId": 256, "Text": "Not really. No.", "CreationDate": "2011-01-11T20:15:40.563", "UserId": 587}
{"Id": 507, "PostId": 255, "Text": "Yes, it will. If you think that's bad, post more questions.", "CreationDate": "2011-01-11T20:16:58.050", "UserId": 587}
{"Id": 512, "PostId": 266, "Text": "I completely agree.", "CreationDate": "2011-01-12T02:07:32.353", "UserId": 587}
{"Id": 513, "PostId": 266, "Text": "I figured that [\"Are babies born atheist?\"](http://atheism.stackexchange.com/questions/2107/are-babies-born-atheist) was a good question, if only to kill the bad argument.", "CreationDate": "2011-01-12T03:27:11.470", "UserId": 484}
{"Id": 514, "PostId": 256, "Text": "Yeah, I guess I was being somewhat sarcastic.  I see that as well.", "CreationDate": "2011-01-12T14:22:00.383", "UserId": 58}
{"Id": 515, "PostId": 264, "Score": 1, "Text": "+1. I didn't like the \"rollup\" idea before, but I'm starting to warm up to it now.", "CreationDate": "2011-01-12T14:40:51.983", "UserId": 58}
{"Id": 516, "PostId": 269, "Score": 2, "Text": "Personally, I think the kind of discourse I would be most interested in would be Philosophy.SE however there's a lot of questions people would like to that would fall off-topic. Skepticism.SE would be the one where there could be the smoothest integration (though we would run into a lot of special pleading skeptics) but it would suffer the same problem as Philosophy: a lot would still fall off-topic. Thus, the best choice would probably be Religion. I might need to be named \"Religion & Atheism\" though, to make it clear atheists are welcomed...", "CreationDate": "2011-01-12T17:23:08.587", "UserId": 484}
{"Id": 517, "PostId": 266, "Text": "I think we agree that is a bad logical argument if it is intended to be a logical argument that gives evidence for non-existence of god. Since that seemed obvious, I thought maybe you were looking for something else and I took it in a different direction. And that's my point; given the impossibilty of defining either religion or atheism, almost every time one of those words is used, it should be qualified, at least a little. ", "CreationDate": "2011-01-12T21:38:34.867", "UserId": 584}
{"Id": 518, "PostId": 273, "Text": "Is there even a need for a vote (especially because I don't enough of a score)?", "CreationDate": "2011-01-13T21:08:55.683", "UserId": 141}
{"Id": 519, "PostId": 273, "Text": "You should be able to vote, and a vote is necessary: \"Users with more than 1250 reputation on the tag, can **suggest** tag synonyms. Users with a total answer score of 5 or more, can **vote** for tag synonyms. Suggestions will be automatically approved when they reach a score of 4, and automatically deleted when they reach a score of -2.\" ", "CreationDate": "2011-01-13T21:10:40.727", "UserId": 484}
{"Id": 520, "PostId": 273, "Text": "You're right though. I can't vote either \"You do not have the required score on this tag to vote for this tag synonym.\" It would seem the description was poorly defined. There are a few users with scores high enough on the tag. Hopefully they will vote to merge.", "CreationDate": "2011-01-13T21:34:01.627", "UserId": 484}
{"Id": 521, "PostId": 232, "Text": "@Chris: Actually, it's been upvotes 11 times and downvoted 4 time. I agree, it's garbage and it should be all the way at the bottom. This is not the type of answer we should want around.", "CreationDate": "2011-01-14T02:00:16.713", "UserId": 484}
{"Id": 522, "PostId": 212, "Text": "`Irrational Beliefs` is your value judgement. I think if you take the time to truly study with an open mind what is really being discussed on **Inward Quest** http://www.inwardquest.com  (yes, it is one of the original SE 1.0 sites), there is a great deal of *rational* thought and belief involved.", "CreationDate": "2011-01-14T12:19:11.373", "UserId": 826}
{"Id": 523, "PostId": 212, "Text": "@Joe - `spirituality, reality creation, metaphysics ...` ∈ irrationality. I got that from the FAQ; I couldn't even understand what the questions were about. The most positive possibility is that the site discusses rational topics in such a metaphorical way that it *seems* irrational to an outsider.", "CreationDate": "2011-01-14T13:05:01.700", "UserId": 339}
{"Id": 524, "PostId": 212, "Text": "@david4dev  - `I couldn't even understand what the questions were about` - I appreciate your honesty - it is certainly an alternative viewpoint to that of those who might call themselves *atheists* and the language used is probably very different. Human Spirituality is not a subject that interests everyone but, then again, neither is atheism :)", "CreationDate": "2011-01-14T13:39:35.737", "UserId": 826}
{"Id": 525, "PostId": 265, "Score": 1, "Text": "It is clear that \"building a canonical archive; a source for authoritative answers\" is what StackExchange sites are meant to be. However, that works for themes that correspond to fields of knowledge, such as computer programming or biking. Atheism is not a field of knowledge, and therefore the notion of an \"authoritative answer\" about atheism makes no sense to me. That's why we should be a bit more relaxed about an Atheism StackExchange site if we want it to succeed. Please see http://meta.atheism.stackexchange.com/questions/131/to-death-with-polling-questions-to-death-with-them-all/145#145.", "CreationDate": "2011-01-14T13:51:07.247", "UserId": 80}
{"Id": 526, "PostId": 265, "Score": 1, "Text": "@CesarGon : Correct, and we've long since recognized the subjective nature of some subjects. But polls do not encourage \"good subjective.\" Take a look at this blog post: http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/. Polls, by design, invite everyone to post their opinion. Read Guideline #4: *\"It takes zero effort or imagination to have an opinion about anything and everything.\"* You can answer a question with authority when you have specific knowledge or experience. In the context of subjectivity, that's what makes it \"authoritative.\" Not random opinions, as in polls.", "CreationDate": "2011-01-14T15:24:37.413", "UserId": 155}
{"Id": 527, "PostId": 265, "Text": "@Robert: +1, I totally agree with you there. However, my experience is that some members of the community are too zealous in the application of the \"good subjective vs. bad subjective\" policy, sometimes forgetting the final goals of the site and focussing too much on the rules (which are just a means). (continued...)", "CreationDate": "2011-01-14T16:23:42.533", "UserId": 80}
{"Id": 528, "PostId": 265, "Text": "@Robert: (...) This question of mine (http://atheism.stackexchange.com/questions/1945/the-not-so-fine-line-between-respect-and-indolence-where-should-atheists-stand) was voted to close as \"bad subjective\" by some people, but then showed as capable to produce a valuable and clear answer in a short time through the interaction of the participants. I see it as an example of the kind of question that is perfectly OK for this site precisely because atheism is not a field of knowledge.", "CreationDate": "2011-01-14T16:25:09.460", "UserId": 80}
{"Id": 529, "PostId": 265, "Text": "@CesarGon: You'll thank those users someday. I have been watching and studying forums for 30 years and the vast, vast majority of forums (who do not practice these \"zealous\" behaviors), **break down in very predictable patterns** (http://scobleizer.com/2009/11/02/the-chat-roomforum-problem-an-apology-to-technosailor/). Vigilant adherence to an ideal (yes, maybe even *over-adherence*, on occasion) plays a big part. Be amazed that Stack Overflow still receives such high-quality, world-class answers... even after two+ years and millions and millions of posts. Hope you can do 1/100th as well.", "CreationDate": "2011-01-14T18:10:43.033", "UserId": 155}
{"Id": 530, "PostId": 265, "Score": 1, "Text": "@Robert: I don't disagree with the policy, and I respect the ideas and aims behind it. I am convinced that this policy is the way to go for disciplines defined around a well-known body of knowledge, what I have called \"fields of kwowledge\", and what in theory of science are often characterised as having an ontology, an epistemology, a theory, a method, a methodology, etc. What I am questioning is whether this policy is equally applicable to something such as atheism, which is not a field of knowledge. StackOverflow is successful, yes, but it *is* a field of knowledge. So I am not convinced :-)", "CreationDate": "2011-01-14T18:18:22.420", "UserId": 80}
{"Id": 531, "PostId": 276, "Text": "I like the idea, and we have been taking about expanding scope. Why don't you post an example of how to include these over at \"How should we broaden scope\"? http://meta.atheism.stackexchange.com/questions/261/how-should-we-broaden-the-scope-of-our-site-while-tightening-up-its-focus", "CreationDate": "2011-01-14T19:42:34.853", "UserId": 135}
{"Id": 532, "PostId": 265, "Text": "@CesarGon: And that's *exactly* why we established the \"Guidelines\" of [Good Subjective, Bad Subjective](http://blog.stackoverflow.com/2010/09/good-subjective-bad-subjective/), to adapt and preserve our ideals of \"good Q&A\" in light of subjects that don't necessarily have a one-right-answer canon of knowledge.", "CreationDate": "2011-01-14T19:58:38.077", "UserId": 155}
{"Id": 533, "PostId": 265, "Text": "@Robert: Yes, I know. I know what the rationale is. But I am not persuaded yet. I guess only time will tell. :-)", "CreationDate": "2011-01-14T20:00:53.690", "UserId": 80}
{"Id": 534, "PostId": 276, "Score": 2, "Text": "I think apatheists outnumber atheists, it's just that by definition, they will never be vocal about it.", "CreationDate": "2011-01-14T22:25:01.610", "UserId": 144}
{"Id": 535, "PostId": 264, "Text": "I think the best candidate is skepticism. How come there are two different skepticism stacks though?", "CreationDate": "2011-01-14T22:30:17.763", "UserId": 144}
{"Id": 536, "PostId": 264, "Text": "@ras you'd need to ask them, but one group fragmented ; a reason I was semi-concerned with in terms of merging.  ", "CreationDate": "2011-01-15T00:29:08.083", "UserId": 135}
{"Id": 538, "PostId": 269, "Score": 2, "Text": "@Borror0 I think such a site runs the risk of becoming a mess of flamewars. Can you genuinely imagine stark atheists not flaming a question like \"How can I express my love for Jesus\"? I think the two should be kept as far as possible, and only brought together in media suited for _discussion_, not Q&A.", "CreationDate": "2011-01-15T12:59:43.677", "UserId": 89}
{"Id": 539, "PostId": 269, "Text": "@rom and the flagged button would be flying.  So the community would be the issue not the content?  ", "CreationDate": "2011-01-15T13:41:52.983", "UserId": 135}
{"Id": 540, "PostId": 269, "Score": 1, "Text": "@romkyns: There's a flag button. Users who can't behave will be *kicked out*. PS: \"How can I express my love for Jesus?\" would be close for being too subjective.", "CreationDate": "2011-01-15T15:40:55.573", "UserId": 484}
{"Id": 541, "PostId": 269, "Text": "@mfg yes, the community. That's my opinion, anyway. @Borror0 there is, yes, but instead of constantly battling one could just keep them separate.", "CreationDate": "2011-01-15T20:29:52.917", "UserId": 89}
{"Id": 542, "PostId": 281, "Text": "The problem with having a tag for questions that  are different to answer due to ambiguous semantics is, for me, differentiating  them from questions that are just poorly asked. I think that separating the two would result in a meta-tag for bad questions, which we are encouraged not to have. But have I misunderstood; do you mean ambiguous semantics in some other way?", "CreationDate": "2011-01-16T03:31:32.733", "UserId": 135}
{"Id": 543, "PostId": 264, "Score": 1, "Text": "@mfg @Raskolnikov: As I understand it, one is *about* Skepticism and the other is about *applying* Skepticism (ie only to debunk stuff). IMO, Skepticism Exchange is redundant.", "CreationDate": "2011-01-16T05:24:35.407", "UserId": 484}
{"Id": 544, "PostId": 96, "Text": "@Nick but if analyzing the opposing point of view is quite constructive, isn't there value for an atheist community to refine their arguments in this fashion (through questions that are appropriately worded and phrased in this context)?", "CreationDate": "2011-01-18T17:52:12.350", "UserId": 135}
{"Id": 545, "PostId": 273, "Text": "However, ethics and morality are not synonyms, but rather similar manners in which to evaluate a situation.", "CreationDate": "2011-01-18T18:13:32.633", "UserId": 135}
{"Id": 546, "PostId": 196, "Text": "btw, feel free to find more authoritative links for the things i found at the cooking.se", "CreationDate": "2011-01-18T18:32:40.807", "UserId": 135}
{"Id": 547, "PostId": 273, "Text": "@mfg: Ethics interchangeable with moral philosophy. ", "CreationDate": "2011-01-18T19:21:38.923", "UserId": 484}
{"Id": 548, "PostId": 273, "Text": "The tag is morality. Morality is not interchangeable with moral philosophy or science of morals; nor is it interchangeable with ethics. They are kin and kissing cousins, but distinct. Any merger with philosophy or religion in the future for instance would make a whitewash of their distinctness a future ambiguity. *In particular* for Philosophers with a semantic knife to grind, or a Religious segment trying to co-opt all ethical open-endedness under the guise of being derived from religious morality. Unfortunately morality alone doesn't cover it.", "CreationDate": "2011-01-18T19:29:49.820", "UserId": 135}
{"Id": 549, "PostId": 273, "Text": "@mfg: All of that is talk: *prove it*. Show me a scenario where conflating morality and ethics would be highly problematic to a conversation. ", "CreationDate": "2011-01-18T19:33:59.947", "UserId": 484}
{"Id": 550, "PostId": 284, "Text": "If the tag about something common requires to open a dictionary of philosophy, we're going at it the wrong way. This is Atheism, not Philosophy. Such unintuitive use is counterproductive here.", "CreationDate": "2011-01-18T19:34:43.567", "UserId": 484}
{"Id": 551, "PostId": 282, "Text": "+1 Great question. So necessary.", "CreationDate": "2011-01-19T01:04:35.260", "UserId": 80}
{"Id": 552, "PostId": 288, "Text": "I think that the tenuous tie between children and education is redundant, so I think that linkage makes the most sense. Education might stand as a tag on its own, so far it does with some decent questions.", "CreationDate": "2011-01-19T05:01:29.303", "UserId": 135}
{"Id": 553, "PostId": 286, "Text": "@Yasir: Nice edit!", "CreationDate": "2011-01-19T06:30:46.433", "UserId": 484}
{"Id": 554, "PostId": 286, "Text": "@Yasir, @Borror0: Indeed!", "CreationDate": "2011-01-19T07:36:33.707", "UserId": 80}
{"Id": 555, "PostId": 292, "Score": 2, "Text": "I never find a shortage of atheists willing to blather or express opinions (myself included) but the \"proof in the pudding\" is at the local level of involvement... fostering communities, seeeking change... making these arguments where required publicly. ", "CreationDate": "2011-01-19T22:29:15.307", "UserId": 149}
{"Id": 556, "PostId": 296, "Text": "Definitely. Most sites make a separate question asking only for those suggestions, do you want to make one where we ask for them? ", "CreationDate": "2011-01-20T11:28:49.677", "UserId": 135}
{"Id": 557, "PostId": 281, "Text": "I mean ambiguous semantics exactly as you had posed it - cases where the semantics of a term is what many of the answers are hinging on, but that the question itself is not asking about a semantic distinction. For example, some question might be asking about the way in which atheists respond to verbal assaults on their beliefs. Now this question may depend heavily on what each person means by atheist, and could vary along those lines. Nonetheless the definition of atheist is not really what the question was asking, and thus doesn't deserve the distinction of a semantics tag.", "CreationDate": "2011-01-21T02:32:29.633", "UserId": 404}
{"Id": 558, "PostId": 279, "Text": "I'm with you, Borror0... I think the questioner embeds an assumption about what he thinks \"strict atheism\" means, and so therefore it doesn't include the things he mentions. Others (like us) would say that all of the non-beliefs are contained under the umbrella. It's the same, very tired, issue of dealing with the fact that \"atheist\" when spoken by a believer means one thing, and when spoken by an atheist, quite another. Or, ThisIsTheID... do I read you wrongly?  What is this \"strict atheism\" you seem to keep wanting to push in multiple question threads?", "CreationDate": "2011-01-22T23:38:03.553", "UserId": 149}
{"Id": 559, "PostId": 296, "Text": "In that other thread it was mentioned that a lack of moderators might make the influx of users unmanageable. Do we have moderators yet? If not, when do we get them?", "CreationDate": "2011-01-23T21:19:12.753", "UserId": 658}
{"Id": 560, "PostId": 232, "Score": 1, "Text": "I disagree of course.  :-)  Religion is worthy of scorn and outright condemnation.  It has had a free ride for a ridiculously long time, and the harm it does is nearly immeasurable.  Its proponents should be held up to scorn and ridicule, just as con-artists, thieves, rapists and child molesters are.  I am overtly hostile to religion, and I am not alone.  To exclude hostility from the site because it makes the religious uncomfortable or because it can be seen as an assertion of correctness is to exclude a very real segment of atheist thinking.", "CreationDate": "2011-01-25T15:53:11.247", "UserId": 524}
{"Id": 561, "PostId": 264, "Text": "+1 for skepticism - you could maybe say atheism is a form of skepticism.....", "CreationDate": "2011-01-26T06:09:58.803", "UserId": 222}
{"Id": 562, "PostId": 232, "Text": "The odd thing is that the \"offensive\" answer is *exactly the same* as the answer below it by Mudak. The *tone* is different, the *content* is the same. If people are going to be offended because someone feels strongly about a topic, I would argue they are over-sensitive. ‎\"No one has the right not to be offended. And, don’t forget, just because you’re offended, doesn’t mean you’re in the right.\" --Ricky Gervais", "CreationDate": "2011-01-26T06:18:21.023", "UserId": 222}
{"Id": 563, "PostId": 234, "Text": "Oh I see @Satanicpuppy, the right answer is that there is no right answer? You just defeated your own argument. Just because we don't know something doesn't mean there is no right answer in principle. Also agree 100% with @Tshepang, there is plenty of evidence showing that religion leads to harm. Would you want a climate change denier in a position to make policy on climate change? It is incredibly easy to see how blind belief can cause harm.", "CreationDate": "2011-01-26T06:23:24.573", "UserId": 222}
{"Id": 564, "PostId": 233, "Text": "\"This site is for experts on atheism and how it fits onto the world stage; and anyone else who is an atheist, lives with an atheist, knows an atheist, is scared of atheists, or just wants to understand what is going through the atheistic mind.\" --from the FAQ. Surely to understand what is going through an atheist's mind you need to understand why atheism is valid?", "CreationDate": "2011-01-26T06:25:41.403", "UserId": 222}
{"Id": 565, "PostId": 245, "Text": "I haven't seen a lot of name-calling and hostility, I think you are mis-representing atheists. See my answer below.", "CreationDate": "2011-01-26T06:38:52.743", "UserId": 222}
{"Id": 566, "PostId": 293, "Score": 1, "Text": "One way is to convince Jeff to mention it on his twitter feed. Strange and amazing things happen when he does that.", "CreationDate": "2011-01-26T12:50:10.347", "UserId": 208}
{"Id": 567, "PostId": 296, "Text": "Well, everyone over 1K has access to moderator tools. Essentially, having a consistent and agreed-to application of those tools in place by the effective mods is what makes it work. After our evaluation in ~50 days, we might have mod elections (2k is the rep minimum to nominate oneself).", "CreationDate": "2011-01-26T13:25:20.477", "UserId": 135}
{"Id": 568, "PostId": 234, "Text": "@grimsqueaker: All bad beliefs can cause harm. But who gets to decide which beliefs are bad? Clearly you think it's you. Other people will certainly disagree.", "CreationDate": "2011-01-26T14:51:36.720", "UserId": 169}
{"Id": 569, "PostId": 298, "Text": "...and also can confuse trading punches with actual activity on a thread; and leave a trail of detritus beneath, where genuine non-noise should go", "CreationDate": "2011-01-27T13:51:01.630", "UserId": 135}
{"Id": 570, "PostId": 300, "Text": "How should we weigh flagging as noise? Recently, I was initially conflicted in a particular case on whether to be accommodating or flag as noise, but I don't want to stifle something that might lead to the clarity of a question. ", "CreationDate": "2011-01-27T13:54:53.980", "UserId": 135}
{"Id": 571, "PostId": 300, "Text": "@mfg: Just use your best judgment. There are a lot of tools at your disposal -- In order of escalation: voting, comments, vote to close, flagging. It typically takes the consensus of a few users to affect a change. If something come up were the 'policy' or 'community norm' has not been seen before, bring it up in meta.", "CreationDate": "2011-01-27T15:21:30.037", "UserId": 155}
{"Id": 572, "PostId": 298, "Text": "There have been some pretty hard-core, even offensive trolls visiting the site recently. I wonder if we shouldn't have a way of voting down individuals, rather than just their posts. I would recomment that it would take a large number of downvotes to actually boot out someone, but there should be a way of banning individuals who are consistently disruptive and/or outright offensive. ", "CreationDate": "2011-01-27T19:45:33.297", "UserId": 122}
{"Id": 573, "PostId": 165, "Text": "Not all of the debate points should be misconstrued as theistic or responses to theism.  Some like ignosticism are critiques of epistemology,  others are responses to formal or semantic issues. A shinier snappier name isn't a bad idea though.", "CreationDate": "2011-01-28T03:02:34.433", "UserId": 135}
{"Id": 574, "PostId": 165, "Text": "@mfg: Putting questions about ignosticism in the same category as theist argument doesn't make practical sense. Two completely different topic. If debate-points is meant to encompass the two, it's a meta tag [and thus it should die](http://blog.stackoverflow.com/2010/08/the-death-of-meta-tags/). ", "CreationDate": "2011-01-28T05:02:27.590", "UserId": 484}
{"Id": 575, "PostId": 234, "Text": "That's not what you said. You spoke disparagingly of \"geeky know-it-alls who believe there is a right answer\". There *is* a right answer *in principle* (and often in practice), or do you not believe in objective truth? Are we not allowed to speak up and say that it makes no sense to believe in the Christian god because there is no evidence for it? Or must we keep quiet and pretend we know nothing and that everything is relative? Surely a rational person cannot support such a self-defeating way of living and thinking.", "CreationDate": "2011-01-28T05:29:44.897", "UserId": 222}
{"Id": 576, "PostId": 165, "Text": "What I mean is, debate-points should be a reference for decoding/disarming/implementing arguments. These questions are not *about* those topics, just as a debate-point refuting [theist argument] doesn't need to talk at all about the [theist argument] but could just be asking for clarification on the debate-point itself. BTW, I am one of the people who up-voted this question; I just think that a better name should be inclusive.", "CreationDate": "2011-01-28T14:54:19.100", "UserId": 135}
{"Id": 577, "PostId": 165, "Text": "@mfg: A name inclusive to that extent would not be *descriptive*. \"Oh, well, it's a question about something that happens in an argument.\" It doesn't tell you any meaningful information about the content nor allows you to filter content for which you're not qualified. ", "CreationDate": "2011-01-28T14:58:50.917", "UserId": 484}
{"Id": 578, "PostId": 165, "Text": "Isn't that further description supposed to come from the additional tagging on the context of the question; that's the reason we have <Christianity> and <ignosticism> as tags. We have consistently used the <debate-points> tag to indicate that part of the topic discussed is a point of debate. That's pretty effective, especially when compared to having <theist-debates>, <agnostic-debates>, <Christian-debates>", "CreationDate": "2011-01-28T15:06:08.480", "UserId": 135}
{"Id": 579, "PostId": 165, "Text": "@mfg But what information does saying that something is \"debates\" useful? Now, if you divide that a bit you can have meaningful tags such as <logical-argument>. You can have specialists on *that*. But \"debates\" is just too vague. ", "CreationDate": "2011-01-28T15:09:29.777", "UserId": 484}
{"Id": 581, "PostId": 165, "Text": "@mfg Read my last comment again. I didn't defend the position that you're attacking.", "CreationDate": "2011-01-28T15:16:08.907", "UserId": 484}
{"Id": 582, "PostId": 165, "Text": "See http://bit.ly/fr8aPm for the original discussion for which the debate tag was intended and has been used. This why I would say, if I am the kind of person who wants to match wits, I will follow <debate-points>. If I want to help people match wits, same thing. But I would not want to need to follow [x] different types of debate-tags (for every descriptor you can come up with) to do so. Moreover, I don't want to hunt down new ones. The usefulness and meaningfulness of specific derivatives will get lost in their proliferation. Keep it simple.", "CreationDate": "2011-01-28T15:42:59.150", "UserId": 135}
{"Id": 583, "PostId": 305, "Text": "Thanks Jeff. That's what I did, flag the post for moderator attention. This answer of yours here, is it expressed anywhere in the FAQs or guidelines to StackExchange sites? I think it would be good to have it there if it isn't already.", "CreationDate": "2011-01-29T11:35:47.210", "UserId": 80}
{"Id": 585, "PostId": 306, "Text": "You say that the edit was OK because \"it made the originally very narrow question broader\". But what if the intention of the question's author was to make a narrow question? What's wrong with narrow, focussed questions? Also, I am not sure what you mean by \"better answers\". The question as is now may elicit *different* answers, but not necessarily *better*. Care to explain?", "CreationDate": "2011-01-29T16:42:17.787", "UserId": 80}
{"Id": 586, "PostId": 307, "Score": 1, "Text": "I think that the particular case I am discussing in my question above falls under \"Significantly alter content or add totally new content\". If this is so, then the editing shouldn't have been made. Do you think that we should capture these guidelines shown here in the FAQs or the StackExchange official codes of conduct?", "CreationDate": "2011-01-29T16:47:26.297", "UserId": 80}
{"Id": 587, "PostId": 306, "Text": "@Cesar: Well, this *is* a community q’n’a site. On Stack Overflow at least it’s an established and widely accepted practice to edit the question so that a more general answer can be given, as long as it also solves the problem. I admit that the situation is necessarily different on atheism.SE but I still think that Borror0’s edit was most likely in the interest of the question asker. In fact, the only definite answer to the original question is that “we don’t know”. Your answer, while good, “merely” advances a plausible hypothesis. The new question has potential better answers.", "CreationDate": "2011-01-29T16:55:07.427", "UserId": 82}
{"Id": 588, "PostId": 307, "Text": "If I had an objection to an edit I would cite the \" SU editing etiquette\" link above to support myself. @ces", "CreationDate": "2011-01-29T20:41:06.403", "UserId": 135}
{"Id": 589, "PostId": 306, "Text": "Konrad's approach is ultimately how I evaluate the edit too. I think that as the question was originally it had problems, Bor tried to correct them to make a better question.  Although this rendered the two answers awkward they can be edited to better fit the nuances of an improved question.", "CreationDate": "2011-01-29T20:46:21.563", "UserId": 135}
{"Id": 590, "PostId": 306, "Text": "@mfg, @Konrad: I get your point, and I understand that it is *possible* to modify a question in order to obtain a better one. But I am not sure that this is a good practice. @Jeff Atwood's answer here seems to point in a different direction, i.e. editing should not change the meaning of a question. To me, that includes making it better.", "CreationDate": "2011-01-29T23:36:40.093", "UserId": 80}
{"Id": 591, "PostId": 307, "Text": "@mfg: Thanks, that's good enough.", "CreationDate": "2011-01-29T23:37:12.167", "UserId": 80}
{"Id": 592, "PostId": 309, "Score": 1, "Text": "I think this belongs to meta.", "CreationDate": "2011-01-28T21:14:26.107", "UserId": 80}
{"Id": 593, "PostId": 309, "Score": 1, "Text": "@CesarGon I don't think so. Can you develop? This question is clearly a phylosophy question about the definition of atheism. Its aim is to reach an answer on a particular aspect of atheism. What's wrong with it? I'have removed \"Stack exchange\" from the title if it makes it looks like something else. ", "CreationDate": "2011-01-28T21:56:04.837", "UserId": 923}
{"Id": 594, "PostId": 309, "Text": "@robin girard: I get your point. If your intention is to discuss the philosophy behind the sentence in quotes alone, then I think it belongs in here. If, to the contrary, you want to discuss why that motto is applied to this site, then meta is its place.", "CreationDate": "2011-01-28T22:26:16.957", "UserId": 80}
{"Id": 595, "PostId": 309, "Text": "That phrase is less than ideal. A better one has been proposed: http://meta.atheism.stackexchange.com/questions/206/who-is-this-site-for/219#219", "CreationDate": "2011-01-28T22:38:32.490", "UserId": 658}
{"Id": 596, "PostId": 309, "Text": "Vote to close. I'm not even sure if the question is on the up and up. I think it's a joke. ", "CreationDate": "2011-01-29T16:00:17.223", "UserId": 122}
{"Id": 597, "PostId": 309, "Text": "What do you mean by \"on the up and up\" ? I don't understand? Why do you think my question is a joke? Asking question on the terms we use is a joke ? ", "CreationDate": "2011-01-29T21:10:24.730", "UserId": 923}
{"Id": 598, "PostId": 310, "Text": "@noisician says: \"Are you just saying that use of the word \"higher\" implies that there is also a \"highest\" (maximal)?\" you don't get the point. I mean that if the higher power does not exist it implicitely mean that lower power exist and that between this lower and the higher there is necessarily a maximum possible power that is compatible with existence, otherwise that would contradict the non existence of a higher power. ", "CreationDate": "2011-01-29T06:41:15.797", "UserId": 923}
{"Id": 599, "PostId": 311, "Text": "Interesting answer! this translates the question from higher power to \"higher cause\" and as I understand, ahteism takes a strong materialist position, reducing the causes to  what is called efficient cause\" by Aristote (hence rejecting the final cause, material cause, and formal cause). ", "CreationDate": "2011-01-29T13:04:43.740", "UserId": 923}
{"Id": 600, "PostId": 312, "Text": "@Andrew, +1, Thanks, I though it was point 1. I did not think of point 2. I am not sure point 2 is in adequation with people that want to close a question asking to discuss the word we use :). ", "CreationDate": "2011-01-30T06:23:50.387", "UserId": 923}
{"Id": 601, "PostId": 303, "Text": "Link Bombing Target: Week of 1/31/11 - 2/6/11", "CreationDate": "2011-01-31T13:38:44.537", "UserId": 135}
{"Id": 602, "PostId": 301, "Text": "Huh? \"A question asked by a question...\" and \"They won't straw man...\" These two statements do not make sense to me.", "CreationDate": "2011-01-31T17:51:21.250", "UserId": 585}
{"Id": 604, "PostId": 301, "Text": "@JYelton: Fixed the typo. A straw man is a deliberate misrepresentation of an argument, presenting a weaker form of the argument to more easily refute it. A theist would not deliberately misrepresent his/her position", "CreationDate": "2011-01-31T18:28:53.997", "UserId": 484}
{"Id": 605, "PostId": 301, "Text": "@Borror0: Thanks for the clarification. You might want to enclose \"straw man\" in quotation marks to indicate its use as a verb.", "CreationDate": "2011-01-31T18:37:17.170", "UserId": 585}
{"Id": 606, "PostId": 316, "Score": 1, "Text": "One might assume that the Abrahamic [god] should be recognized as the one with the capital 'G' however it could easily be countered that this is an institution embedded in our shared language to disempower the other gods. I understand the distinction and why believers make it, however I disagree that it is incumbent upon atheists to observe the bias they hold against other gods by further edifying theirs with a capital letter or other subtle regalia.", "CreationDate": "2011-02-02T00:01:08.643", "UserId": 135}
{"Id": 607, "PostId": 316, "Text": "In our normal discussions, do we capitalize the names of other gods, such as Thor, Zeus, or Vishnu?  If yes, then why make an exception for the most familiar name associated with the Abrahamic god? ", "CreationDate": "2011-02-02T00:24:27.153", "UserId": 891}
{"Id": 608, "PostId": 315, "Text": "The process has begun: http://meta.atheism.stackexchange.com/questions/73/how-should-we-create-a-definition-of-atheism (I think that other thread covers the requirements, even though it's asking how we proceed)", "CreationDate": "2011-02-02T05:37:11.090", "UserId": 658}
{"Id": 611, "PostId": 77, "Text": "I'm not sure it's helpful to mix the discussion of how to create a definition of atheism with the discussion of the definition itself. But I do agree that we need a definition which includes related terms (i.e., agnosticism, ignosticism, etc).", "CreationDate": "2011-02-02T05:49:29.467", "UserId": 658}
{"Id": 612, "PostId": 73, "Text": "It seems this question hasn't had enough attention, to the detriment of the site and the plethora of questions about definitions. How do we get more people involved?", "CreationDate": "2011-02-02T05:51:48.093", "UserId": 658}
{"Id": 613, "PostId": 196, "Text": "I don't think it should be for experts (mostly because expertise in this field is difficult to evaluate; there is no Doctorate of Atheism as far as I'm aware). I've edited it slightly based on Rob's answer (http://meta.atheism.stackexchange.com/questions/206/who-is-this-site-for) I think it captures everything that Rob's answer did.", "CreationDate": "2011-02-02T06:10:09.287", "UserId": 658}
{"Id": 614, "PostId": 311, "Text": "'Time to go' is a hidden reason? What kind of reason shall that be? We know arrangements from the theater, where the autor made a story up. An accident there might be part of a story to tell, but in the real life, to whom is a story told? The explanation 'behind the scene' doesn't explain anything. It's just a fear. ", "CreationDate": "2011-02-02T07:17:33.367", "UserId": 992}
{"Id": 615, "PostId": 73, "Text": "@Sol my initial answer was to make a final question eventually with a massive bounty. this would involve maintaining a repository of partial answers under the semantics tag, and also the definition-of-atheism tag. I don't know if we have bypassed that idea at this point though. Quite possibly. Our meta seems a bit uninvolved on certain structural elements. IE, your (good) edit on the FAQ was the most recent activity there since I-don't-know-when.", "CreationDate": "2011-02-02T16:45:57.273", "UserId": 135}
{"Id": 616, "PostId": 66, "Text": "If this is the mission, it explains why I am having trouble \"getting into\" this site, and possibly why it is not attracting others. Your's is the mission of a humanist's group, with an existing/agreed upon definition of belief. Atheism does not exist without theism and, IMO, the atheism movement is working to define itself. So, understanding and discussing theology would be a core goal of that mission. ", "CreationDate": "2011-02-02T17:34:23.093", "UserId": 584}
{"Id": 617, "PostId": 4, "Text": "Please also see the thread on creating a definition of Atheism: http://meta.atheism.stackexchange.com/questions/73/how-should-we-create-a-definition-of-atheism", "CreationDate": "2011-02-03T02:25:06.900", "UserId": 658}
{"Id": 618, "PostId": 175, "Text": "I think it's a valid point, particularly since there is division not only over the definition, but also how strict it should be. So perhaps it would be useful to discuss the definition separate from the FAQ, i.e. here: http://meta.atheism.stackexchange.com/questions/73/how-should-we-create-a-definition-of-atheism", "CreationDate": "2011-02-03T02:26:53.167", "UserId": 658}
{"Id": 619, "PostId": 196, "Text": "For anyone reading this, please also see the question about how we should create a definition of Atheism: http://meta.atheism.stackexchange.com/questions/73/how-should-we-create-a-definition-of-atheism", "CreationDate": "2011-02-03T02:27:57.830", "UserId": 658}
{"Id": 620, "PostId": 303, "Text": "Of course, this only works if people participate. Any idea how we can track this?", "CreationDate": "2011-02-03T08:30:40.897", "UserId": 82}
{"Id": 621, "PostId": 303, "Text": "@rude right, did anyone else put this question up anywhere?", "CreationDate": "2011-02-03T11:47:13.633", "UserId": 135}
{"Id": 622, "PostId": 318, "Score": 1, "Text": "Agreed, atheists have a low opinion of religion. I know because I am one. I also remember that I have that bias when I am talking with anyone on the subject and try to not let it shut down the conversation. I am descended from people who owned slaves, prayed to invisible beings and somewhere way back there sacrificed their fellow humans. It would be arrogant to act as if I have it all figured out. ", "CreationDate": "2011-02-03T13:50:50.277", "UserId": 584}
{"Id": 623, "PostId": 310, "Text": "You're right, I misunderstood your point. And I'm assuming I continue to misunderstand.... All I can think to say is that the lack of a god/\"higher power\" implies nothing about what does exist, and to say that it does seems like a non-sequitur. Similarly, the lack of leprechauns really implies nothing about what actually exists.", "CreationDate": "2011-02-03T19:29:54.950", "UserId": 90}
{"Id": 624, "PostId": 320, "Text": "You may want to move this post to http://meta.stackoverflow.com/", "CreationDate": "2011-02-04T13:58:26.323", "UserId": 135}
{"Id": 625, "PostId": 303, "Text": "@Kon not sure about tracking, i guess. But I guess if we want to start voting some in lets put up some more? Just add any particularly good questions you come across.", "CreationDate": "2011-02-04T14:31:27.357", "UserId": 135}
{"Id": 626, "PostId": 319, "Score": 1, "Text": "I'm not looking for apologetics. I'm looking for more subtle commentary than \"religion is bad\". Understanding someone else's culture is very different than \"indulging their mythology\". It is not irrational to attempt to understand people who are different. ", "CreationDate": "2011-02-04T14:42:11.950", "UserId": 584}
{"Id": 627, "PostId": 96, "Text": "Part of my journey out of belief was a search for the most compelling arguments. I didn't feel it was right to define myself as an atheist until I had considered the most compelling argument against it. It seems silly now, because all the arguments are pretty ridiculous, but it is still a good question. ", "CreationDate": "2011-02-04T14:45:56.453", "UserId": 584}
{"Id": 629, "PostId": 320, "Text": "I did and got slammed closed in 5 min.", "CreationDate": "2011-02-04T22:24:13.287", "UserId": 182}
{"Id": 630, "PostId": 321, "Text": "I put the question there and it got closed in 5 min. No interest at all.", "CreationDate": "2011-02-05T00:05:27.590", "UserId": 182}
{"Id": 631, "PostId": 321, "Text": "@philip guy muir :-(", "CreationDate": "2011-02-05T00:11:05.747", "UserId": 197}
{"Id": 632, "PostId": 319, "Text": "Oh, it is clearly of immense value (in my view) to be well versed in the mythology of a culture.  Knowing the myth of Mitra alone gives you amazing insight to Jesus", "CreationDate": "2011-02-05T03:10:41.377", "UserId": 524}
{"Id": 633, "PostId": 323, "Text": "Yup me too. I was told that since programming was a universal language and and therefore there should be no problem. It was a suprise to me. The question had already been asked and it had been closed down as well.", "CreationDate": "2011-02-05T04:25:59.010", "UserId": 182}
{"Id": 634, "PostId": 320, "Text": "It was closed because it was a duplicate of an existing question.", "CreationDate": "2011-02-05T06:08:13.503", "UserId": 658}
{"Id": 635, "PostId": 323, "Text": "I agree that the onus is on the author. However the rest of us might help to author by pointing out that it's difficult to understand, and that we would be willing to fix it for them, and that they should ask for help when they post an answer/question next time. Hopefully they will learn quickly and avoid too many downvotes.", "CreationDate": "2011-02-05T06:10:24.600", "UserId": 658}
{"Id": 636, "PostId": 320, "Text": "@Solus Do you mean mine? if so I am aware of that. The origonal was closed as well. Is there a third? if can you link to it?", "CreationDate": "2011-02-05T06:15:27.377", "UserId": 182}
{"Id": 637, "PostId": 320, "Text": "@philip guy muir: This one hasn't been closed, though it was downvoted: http://meta.stackoverflow.com/questions/53668/fix-my-english-please-tag", "CreationDate": "2011-02-05T06:54:07.347", "UserId": 658}
{"Id": 638, "PostId": 320, "Text": "Here is another relevant question: http://meta.stackoverflow.com/questions/8162/we-need-to-help-non-english-speakers-somehow", "CreationDate": "2011-02-05T06:55:23.430", "UserId": 658}
{"Id": 639, "PostId": 316, "Text": "If you mean a special god, go and capitalize the word. But I as a non-believer in any god do not not believe in that One God. A capital G emphasizes a monotheistic view. If that is what is meant - use God. If that is not what is meant - use god. ", "CreationDate": "2011-02-06T04:18:42.883", "UserId": 992}
{"Id": 640, "PostId": 316, "Text": "... and, btw., I'm not selling a message.", "CreationDate": "2011-02-06T04:20:53.723", "UserId": 992}
{"Id": 641, "PostId": 197, "Text": "What is that 'strict dictionary' - don't you have a link? Is this strict-dictionary-entry too long to fit in here?", "CreationDate": "2011-02-06T04:37:24.383", "UserId": 992}
{"Id": 642, "PostId": 319, "Text": "@Lausten: I don't visit a atheism-site to be subtle, but to speak clearly, open and free. Having said that - maybe I will in one case or another - be more subtle; it will depend on the situation. ", "CreationDate": "2011-02-07T04:20:36.837", "UserId": 992}
{"Id": 643, "PostId": 188, "Text": "But if it was \"Use Windows because x, y, z\" then it would stand up - right tool for the right job...", "CreationDate": "2011-02-07T04:22:46.020", "UserId": 921}
{"Id": 644, "PostId": 326, "Text": "Why do I need to prove so often not being a robot? (And why do I succeed so often? +ü+ü##..,)", "CreationDate": "2011-02-07T04:53:27.487", "UserId": 992}
{"Id": 645, "PostId": 319, "Text": "I am okay with the occasional offhand remark, or emotional outbursts. I raised the concern because one of them was getting upvoted as if it was an actual answer to a question. Please don't take my inquiry as a coded message to suppress yourself. ", "CreationDate": "2011-02-09T22:54:52.800", "UserId": 584}
{"Id": 646, "PostId": 317, "Text": "@Lausten:  Lately I've been wondering the same thing.  It feels like there are a lot of questions and replies where *atheism* is a synonym for *anti-theism*.", "CreationDate": "2011-02-11T01:49:43.730", "UserId": 891}
{"Id": 647, "PostId": 328, "Text": "+1 Succint and so true.", "CreationDate": "2011-02-11T23:02:16.733", "UserId": 80}
{"Id": 648, "PostId": 331, "Text": "If you look at Crazy Eddie's questions on Area51, you can see he's doing a lot of trolling. So if his answers are being flagged in Atheism.SE, the community is doing its job correctly.", "CreationDate": "2011-02-13T00:41:01.267", "UserId": 270}
{"Id": 649, "PostId": 326, "Text": "fun is great, I like fun. There are plenty of sites where people go wild making fun of religion. We can do that too, but is it the primary goal?", "CreationDate": "2011-02-16T17:32:33.137", "UserId": 584}
{"Id": 650, "PostId": 326, "Text": "No, not the primary goal. From the Ahteism-FAQ and the Atheism-about-page I find nearly no information what the goal of the founders was. Just 'for skeptics of a higher kind'. I am a skeptic - maybe not of a higher kind, but of the usual kind. :) ", "CreationDate": "2011-02-16T21:13:54.120", "UserId": 992}
{"Id": 651, "PostId": 336, "Score": 2, "Text": "Perhaps \"Philosophy\" would be a better, more general site and this topic should be folded into it?", "CreationDate": "2011-02-17T04:34:41.457", "UserId": 207}
{"Id": 652, "PostId": 336, "Text": "@Jeff: I think so. It wouldn't cover *everything* this site covers -  advice questions like the boyscout one would be off-topic on a Philosophy site - but I think it's the best compromise we'll get.", "CreationDate": "2011-02-17T05:14:32.913", "UserId": 484}
{"Id": 653, "PostId": 338, "Score": 1, "Text": "Hi @oos, I'm sorry you feel that way. Are there any examples in particular, or what specifically didn't work for you? The community is still in beta and it's a challenging topic (for this format) and any constructive criticism would be appreciated.", "CreationDate": "2011-02-17T11:46:59.257", "UserId": 135}
{"Id": 654, "PostId": 74, "Text": "as a note; `definition-of-atheism` was picked up", "CreationDate": "2011-02-17T15:01:32.930", "UserId": 135}
{"Id": 655, "PostId": 317, "Text": "I think he meant more that to have a stance on either side's actions, beyond being critical of people acting solely out of religious import, would be beyond the scope of atheism and would require some added moral judgment. A moral judgment that would be based in personal opinion, not atheist consensus.", "CreationDate": "2011-02-17T19:30:55.397", "UserId": 135}
{"Id": 656, "PostId": 264, "Text": "+1 skepticism. maaaaaaybe philosophy. Not religion.", "CreationDate": "2011-02-17T20:00:41.707", "UserId": 71}
{"Id": 657, "PostId": 269, "Text": "I would be unhappy to the point of leaving the site if Atheism merged with [Religion]. I have truly had my life's fill of defending what I think against hostile theists. I don't mean interesting, thought-provoking discussions, but the \"Atheism is just another religion\" or \"you're mad at god so you don't believe in him\" kind of crap. If we must merge, Skepticism would be a much better fit. I was a member of AOL's Religion & Ethics board waaaay back when that was the only place for atheists to hang out there, and it got so exhausting so fast that we all left for manual mass emails.", "CreationDate": "2011-02-17T20:05:29.593", "UserId": 71}
{"Id": 658, "PostId": 270, "Score": 1, "Text": "Could someone sell me on the why? Although skepticism and atheism maintain a base in disbelief, I don't see how they combine. I'm not saying there can't be additional options (beyond merging with skepticism, philosophy...), I just don't see skepticism being a good place for discussing atheism.", "CreationDate": "2011-02-17T20:06:08.533", "UserId": 135}
{"Id": 659, "PostId": 336, "Score": 1, "Text": "I think Skepticism is a more natural partner than Philosophy.", "CreationDate": "2011-02-17T20:06:25.240", "UserId": 71}
{"Id": 660, "PostId": 336, "Text": "@LaurenIpsum: Skepticism is going to be closed, [as it would overlap with Skeptic Exchange.](http://discuss.area51.stackexchange.com/q/25/) As for Skeptic Exchange, it's about *applying* skepticism only.", "CreationDate": "2011-02-17T20:33:55.793", "UserId": 484}
{"Id": 661, "PostId": 269, "Text": "@Lauren I appreciate you being so direct on that point; may I ask, do you feel flagging and community policing of this issue would be sufficient? We are fortunate to have minimal issues (to my knowledge) right now, but do you think merging would feed the trolls beyond our ability to fend them off? Or is the effort to fend them off too much? (Personally, I would hate to lose your efforts)", "CreationDate": "2011-02-17T20:49:54.033", "UserId": 135}
{"Id": 662, "PostId": 340, "Text": "Perhaps it would be enough to expand the scope of atheism, without going to the trouble of creating an entirely new site. I think your proposal would more accurately capture the breadth of what ends up being discussed, but at the cost of the label which signifies that identity you mentioned, a label that evokes the emotional response (and hence motivation to participate) that Billare recently asked about.", "CreationDate": "2011-02-17T22:33:04.677", "UserId": 658}
{"Id": 663, "PostId": 340, "Text": "@solus I personally think my prop IS the wrong way to go. A new site could be seeded with our content, but if you refer to the post asking *how* we could broaden the scope, merger was the only viable suggestion. One with philosophy is my preference, but I'm still not convinced it would be enough. I think some kind of intellectual brand is vital, as you suggest. Lesswrong is taken...", "CreationDate": "2011-02-17T22:43:09.693", "UserId": 135}
{"Id": 664, "PostId": 336, "Text": "If merged with either Skeptic Exchange.SE or Philosophy.SE, would it still be clear to people that they could ask questions about atheism/religion? Alternatively, could we not just broaden the scope of this site?", "CreationDate": "2011-02-17T22:43:20.847", "UserId": 658}
{"Id": 665, "PostId": 336, "Text": "Nevermind that last question, I see the preference is for a merger to avoid cross-posting & multiple sites covering the same scope.", "CreationDate": "2011-02-17T22:50:12.027", "UserId": 658}
{"Id": 666, "PostId": 338, "Text": "I share some of your concern, though I think there is still hope, and that for that hope to be fulfilled it needs the participation of people who want the site to be more polished and professional.", "CreationDate": "2011-02-17T22:53:09.950", "UserId": 658}
{"Id": 667, "PostId": 336, "Text": "@Solus I confess I can't understand what it is interesting about atheism qua atheism.  Suppose this Stack Exchange were to merge into some more vibrant one.  Even there, I don't think a tag \"atheism \" would be very productive, because to talk about anything that will get a factual sort of answer, you need to talk about \"atheism + X\", where X is dominant.  \"What astronomical evidence is there that God doesn't exist?\" will get much better answers from physicists, say, than from self-described atheists. ", "CreationDate": "2011-02-17T23:22:43.590", "UserId": 1095}
{"Id": 668, "PostId": 269, "Text": "We haven't had many issues with theist trolls yet (AFAIK), but there have been a couple of atheist trolls recently. I think a merger with Religion is the best way to appropriately expand the scope of the site, but I also agree with Lauren and romkyns that it's a poor match because of the excessive friction it will cause. However, I think that's something we all have to learn to manage more effectively, so my vote is to merge, and to manage trolling with a firm hand.", "CreationDate": "2011-02-17T23:23:03.510", "UserId": 658}
{"Id": 669, "PostId": 336, "Text": "@Billare: That's the problem with such a basic definition of atheism; it ignores the important associations which fuel the identity which mfg mentioned in his answer. So to use your example, an astronomer who is also an atheist would probably provide the best answer. That doesn't invalidate atheism as an interesting or relevant topic.", "CreationDate": "2011-02-17T23:27:31.493", "UserId": 658}
{"Id": 670, "PostId": 336, "Text": "@Solus (cont'd) The latter will only be able to talk in vague generalities, and because atheism is a negative philosophy, topics will quickly exhaust themselves.  Self-described atheists would be much better addressing sociological aspects of the  new \"atheism\", as a sort of social movement, because that is what is actually drawing many of them to this site.  Activism, how to mold the world in an atheist mindset, and so on.  IMO, that doesn't lend itself to questions that can be answered in nonsubjective manner and it additionally corrodes the site's mentality. ", "CreationDate": "2011-02-17T23:28:46.237", "UserId": 1095}
{"Id": 671, "PostId": 336, "Text": "@Solus Are you sure you want a Q/A site or _a community_?  Everyone on the Internet deserves a community, but I don't think the StackExchange platform and ethos is designed to provide that need.", "CreationDate": "2011-02-17T23:31:06.000", "UserId": 1095}
{"Id": 672, "PostId": 342, "Text": "@CesarGon That's a wonderful answer of yours you linked to. You expressed what I struggled to in the recent thread I created very clearly, with more appropriate vocabulary too. ", "CreationDate": "2011-02-17T23:52:15.440", "UserId": 1095}
{"Id": 673, "PostId": 336, "Text": "@Billare: Self-described experts in any field face the same issue of speaking in vague generalities. I agree with Lausten that there are experts on Atheism. The signal-to-noise ratio on any site is going to be fairly low, but if we can attract those who are more knowledgeable than the average atheist, we can increase the signal strength. As for community, every Q&A site *is* built around a community. The 2 aren't independent. I think mfg's answer is a better place to comment on that topic.", "CreationDate": "2011-02-17T23:55:48.257", "UserId": 658}
{"Id": 674, "PostId": 342, "Text": "@Billare: Thank you. I am glad you like it. :-)", "CreationDate": "2011-02-18T00:19:10.810", "UserId": 80}
{"Id": 675, "PostId": 269, "Text": "@mfg: I think good modding can handle trolls. My point is the same as romkyns's: even polite Religion questions are \"How can I invite Jesus more into my marriage?\" which not only doesn't interest me, it actively repulses me. There would be no reason for me to participate. It would be the same as saying \"We're not getting enough participation on VeganSE, so let's merge with BarbecueSE because they're both about food.\" It would literally be killing the reason this SE exists. Not for anything, but the theists have 90% of the world as their sandbox. Can't we have one damn corner for us?", "CreationDate": "2011-02-18T00:37:36.250", "UserId": 71}
{"Id": 676, "PostId": 336, "Score": 2, "Text": "So if \"Skepticism\" would be closed in favor of \"Skeptic Exchange,\" why not merge THEM (Skepticism) into US instead? Then we'd be \"Atheism and Skepticism\" and both SEs don't have to give up their identities. ", "CreationDate": "2011-02-18T00:39:33.657", "UserId": 71}
{"Id": 677, "PostId": 344, "Text": "I think loosening the standards of \"on topic\" would be a bit subjective but I think its the most manageable. Loosening standards on the quality of questions / answers, however, would defeat the purpose of the site. If we can come up with a list of topics adjacent to atheism we could make for a broader scope, which would be a win in my book.", "CreationDate": "2011-02-18T02:08:14.217", "UserId": 135}
{"Id": 678, "PostId": 344, "Text": "I've posted a question to get some clarity on scope: http://meta.atheism.stackexchange.com/questions/345/what-should-the-scope-of-this-site-be", "CreationDate": "2011-02-18T06:27:28.160", "UserId": 658}
{"Id": 679, "PostId": 344, "Text": "+1 @Solus: I agree with your views.", "CreationDate": "2011-02-18T11:47:20.910", "UserId": 80}
{"Id": 680, "PostId": 346, "Text": "+1 on the majority of what you're saying, but how is Philosophy divorced from Critical Thinking? Could you clarify what aspect of philosophy is anti-critical thinking, or pro-dogma? ", "CreationDate": "2011-02-18T15:56:11.257", "UserId": 135}
{"Id": 681, "PostId": 346, "Text": "It's not anti. It's apples and oranges. \"Are we machines?\" is a philosophical question, not a concrete one. (Unless you can prove it, which would open an entire other matrix of worms.) \"How do I seat a married lesbian couple at a formal dinner party?\" is not a vegan vs. BBQ question. It's not in the same field.", "CreationDate": "2011-02-18T17:58:22.307", "UserId": 71}
{"Id": 682, "PostId": 348, "Text": "I think you hit on a rich segment of possible users that have been unaccomadated in the FAQ. good pickup; definitely one we should try to incorporate in broadening our scope", "CreationDate": "2011-02-18T18:41:20.313", "UserId": 135}
{"Id": 683, "PostId": 348, "Text": "@Lausten: I don't disagree with anything that you say. But I wanted to remark that I never had the feeling that this site was for atheists only. There have been discussions here on meta about this issue, and I believe that consensus is that anyone is welcome as long as good manners are respected. In spite of this, I have had a few experiences with some people being too arrogant or pushy in their arguments and their opinions about how things should be done here, and I don't think these people were what we would call theist trolls. This is the price we pay for keeping an open door.", "CreationDate": "2011-02-18T18:55:03.190", "UserId": 80}
{"Id": 684, "PostId": 269, "Score": 3, "Text": "+1 for being the right answer. If you're discussing the existence/non-existence of God, religion is appropriate. Moreover, having no religious people on this site turns it into a self-indulgent wankfest.", "CreationDate": "2011-02-18T19:43:16.123", "UserId": 169}
{"Id": 685, "PostId": 348, "Text": "@CesarGon: Heh. I've always had the feeling that I was getting crap for not being *enough* of an atheist, mainly in that I don't have any problem with the godbotherers, as long as they don't try to dictate to me.", "CreationDate": "2011-02-18T20:00:54.313", "UserId": 169}
{"Id": 686, "PostId": 348, "Text": "@CesarGon, @SatanicPuppy; I think the door is open, and some of this will need to be worked out by the community. I don't claim to have THE answer. I've made many comments about being more open about questions. When \"religion is evil\" type answers get voted up, there isn't a whole lot I can do, and moderating them would seem like going against the grain of the community. Someone commented that the subtitle \"skeptics of a higher power\" makes a certain statement, maybe just making that more neutral like, \"what does it mean?\" or \"we don't believe anything\". Okay, just brainstorming there. :)", "CreationDate": "2011-02-18T20:15:48.923", "UserId": 584}
{"Id": 687, "PostId": 335, "Score": 2, "Text": "It'd help if this question was a little less rantish.", "CreationDate": "2011-02-19T12:54:27.823", "UserId": 270}
{"Id": 688, "PostId": 352, "Text": "If you're a Christian or other theist, you may be wondering \"Am I doing this Christianity thing correctly\"? Similarly, if you're a Mac user, your sole concern isn't converting users from Windows. But if you're an atheist, you can't do the atheism thing incorrectly. Isn't your only remaining concern converting theists to atheism?", "CreationDate": "2011-02-20T07:00:18.457", "UserId": 270}
{"Id": 689, "PostId": 352, "Score": 3, "Text": "@Robert Cartaino: -1 With all due respect, I think you may be mixing up two things that are very different: the question is whether anti-theism should be in scope here or not. However, your answer argues against immature, rantish behaviour. What's the connection between the two? None, in my opinion. I totally agree that childish rants and wars are absolutely not on. But I also think that anti-theism can (and should) be discussed here from a mature and rational position. This is why I think your answer does not address the question being asked.", "CreationDate": "2011-02-20T14:15:06.483", "UserId": 80}
{"Id": 690, "PostId": 354, "Text": "I like the intent, how do we do that, considering we weren't exactly anti before?", "CreationDate": "2011-02-20T16:17:29.733", "UserId": 135}
{"Id": 691, "PostId": 352, "Score": 1, "Text": "@Andrew Grimm: No. Your concerns also include how to live your life as an atheist while allowing others to live their life as they choose.", "CreationDate": "2011-02-20T21:53:40.673", "UserId": 658}
{"Id": 692, "PostId": 351, "Text": "+1 Good summary.", "CreationDate": "2011-02-21T04:09:00.587", "UserId": 80}
{"Id": 693, "PostId": 352, "Score": 1, "Text": "Could you define \"Atheism, in it's own right\"? Wouldn't a discussion of how to express oneself be appropriate? ", "CreationDate": "2011-02-22T03:31:13.220", "UserId": 584}
{"Id": 694, "PostId": 63, "Text": "Since most, perhaps all, questions about existence have been answered, I tend to agree. Often the person asking the quesiton doesn't know the category, so linking it to the \"Problem of Evil\" answer, or wherever it fit, would cover those. Some philosophical questions would result in more than one valid answer if it was something less settled, like determinism.    I have been arguing for more openess, but if that fails, perhaps an extremely narrow focus would be worth a try. ", "CreationDate": "2011-02-22T20:38:54.033", "UserId": 584}
{"Id": 695, "PostId": 356, "Text": "In response to a couple points in your linked comment. \"Ask 2 computer programmers to solve a problem and you will get 3 answers\". In other words even a scientific discipline can have opinions worht discussing. You asked for 20 questions, look up the book \"36 arguments for the existence of god\". Some of those have been asked here, but I think one place that had all of them and a few more, plus their variations would be valuable. I have spent a few years tracking them all down individually, and I don't always recognize the variations. ", "CreationDate": "2011-02-22T20:52:41.343", "UserId": 584}
{"Id": 696, "PostId": 356, "Text": "@Lausten: Giving multiple answers is easy. My point is that coming up with multiple *questions* is the hard part.", "CreationDate": "2011-02-22T22:34:19.227", "UserId": 80}
{"Id": 697, "PostId": 303, "Text": "@Kon are you interested in culling questions and maybe picking a new one, and trying this again?", "CreationDate": "2011-02-24T13:53:33.433", "UserId": 135}
{"Id": 698, "PostId": 303, "Text": "@mfg Sorry, I’m currently in the UK for PhD interviews and expect to be very busy in the next few weeks so please go ahead, I’ll not be able to contribute very actively right now.", "CreationDate": "2011-02-24T16:07:15.170", "UserId": 82}
{"Id": 699, "PostId": 357, "Text": "These are proposed standards and criteria. I'd appreciate feedback, especially on this part: \"Posts that have extraneous commentary of this ilk should be flagged edited to excise the problem areas (with a comment to inform and explain why). If the answer no longer works, this is a matter for the original respondent to address.\" I think it is a way of teaching people not to add the flair, but I understand it can lead to abuses.", "CreationDate": "2011-02-24T16:29:58.137", "UserId": 135}
{"Id": 700, "PostId": 303, "Text": "@Kon np good luck with that :)", "CreationDate": "2011-02-24T16:30:22.223", "UserId": 135}
{"Id": 701, "PostId": 346, "Text": "I still mostly agree, but Critical Thinking is derived from Philosophy. Search any Philosophy department at any college and there will be a Phil101: Critical Thinking syllabus, and it will discuss fallacies, semantics, logic, deductive/inductive reasoning etc. Sorry but it's not Apples and Oranges; its Oak Tree and Acorn.", "CreationDate": "2011-02-24T19:50:22.380", "UserId": 135}
{"Id": 702, "PostId": 346, "Text": "I'll agree with the syllabus you're discussing, but Critical Thinking is a tool (the scientific method) where Philosophy is a subject (what's being studied). You can apply critical thinking to the study of apple germination, or to the symbolic linkages between the apple in Genesis and the one that legendarily landed on Newton's head. The syllabus you describe could also be Rhetoric & Communication 101, or Criminal Justice 117, or a Sherlock Holmes seminar. The original question is re merging, and I just think Philosophy SE is a less perfect fit than Skeptic/ism.", "CreationDate": "2011-02-24T20:23:53.073", "UserId": 71}
{"Id": 703, "PostId": 354, "Text": "@mfg Make the intent more obvious. Maybe in a written header statement or something.", "CreationDate": "2011-02-25T05:37:02.430", "UserId": 210}
{"Id": 704, "PostId": 354, "Text": "One way to start is to use the Meta to call out behavior, assess whether it's on topic, and determine rules for dealing with it. Check out the \"anti-theism\" thread on Meta for instance.  Feel free to post about whatever strikes you as problematic", "CreationDate": "2011-02-25T11:45:51.060", "UserId": 135}
{"Id": 705, "PostId": 353, "Text": "A moderate, well-argued statement whose only negative is that it is wrong. Atheism is not a \"non-commital\" position, it is a rejection of theism. Nobody would call Hitchens or Dawkins \"non-commital\".", "CreationDate": "2011-02-25T18:58:37.813", "UserId": 1151}
{"Id": 706, "PostId": 353, "Text": "I didn't mean 'non-commital' in the sense of not being committed or not aligning oneself with a certain position. Maybe I need a better word.", "CreationDate": "2011-02-26T14:28:18.473", "UserId": 210}
{"Id": 707, "PostId": 357, "Text": "+1 mfg: Very good!", "CreationDate": "2011-02-27T16:51:06.193", "UserId": 80}
{"Id": 708, "PostId": 342, "Text": "I agree with this as well: the way SE works is intentionally hostile to debate and argument in dozens of ways, because that's not what it's for.", "CreationDate": "2011-02-27T17:04:36.983", "UserId": 1058}
{"Id": 709, "PostId": 342, "Score": 1, "Text": "+1  I assumed when I signed up for this that it would have to be a bit different from regular SE sites.  I assumed that philosophical discussions would naturally include more \"polling questions\" and debate.  I was honestly surprised to see people attempting to enforce Stack Overflow rules here.  I believe that SE could be used for debate, and like that people can vote on answers, and even accept the \"best\" answer, but we have to admit that what we're using it for is a little different.", "CreationDate": "2011-03-01T05:21:22.597", "UserId": 340}
{"Id": 710, "PostId": 342, "Text": "Or perhaps some enterprising web developer needs to adapt the Stack Exchange model to support more open-ended philosophical discussions...", "CreationDate": "2011-03-01T05:23:44.670", "UserId": 340}
{"Id": 711, "PostId": 366, "Text": "I actually recommended adding a secularism focus to the site. However, it is surprisng how difficult it was to compose a case use for it (i.e. a set of on-topic and off-topic questions, and it seems very abstract). Can you think of a way to make it tangible enough to add as a topic for the faq?", "CreationDate": "2011-03-01T14:07:06.333", "UserId": 135}
{"Id": 712, "PostId": 366, "Text": "I expanded on my answer to further explain what I thought the site was going to be about when I joined. Since it is still beta, maybe it is still possible for it to move in that direction.", "CreationDate": "2011-03-01T22:30:01.963", "UserId": 1164}
{"Id": 713, "PostId": 362, "Score": 1, "Text": "Please, by all means, ask some! I'd like to move into new areas.", "CreationDate": "2011-03-03T03:21:43.750", "UserId": 1107}
{"Id": 714, "PostId": 368, "Text": "Are there any edits you would make to try to clean up the question then? (Sorry, this post was just meant to help dissect the question and clarify it a bit)", "CreationDate": "2011-03-03T13:32:36.190", "UserId": 135}
{"Id": 715, "PostId": 373, "Score": 1, "Text": "Why is this a bug rather than a discussion?", "CreationDate": "2011-03-07T09:51:51.487", "UserId": 270}
{"Id": 716, "PostId": 372, "Text": "+1 for the \"open to commentary\" bit.", "CreationDate": "2011-03-07T23:54:56.783", "UserId": 80}
{"Id": 717, "PostId": 371, "Score": 1, "Text": "Is the site DOA or have there been any proposed mergers or other actions to salvage the stack?", "CreationDate": "2011-03-08T19:49:24.423", "UserId": 135}
{"Id": 718, "PostId": 372, "Score": 4, "Text": "Although I agree with opening the topic a bit, [opening to too much commentary I do think is ill-advised.](http://meta.atheism.stackexchange.com/q/376/135)", "CreationDate": "2011-03-08T19:55:14.033", "UserId": 135}
{"Id": 719, "PostId": 378, "Text": "@mfg: thank you! ", "CreationDate": "2011-03-08T20:16:38.353", "UserId": 71}
{"Id": 720, "PostId": 371, "Text": "@mfg: 90 days is coming up pretty fast. I don't see any sites (launched or proposed) for which this content will add to the substance or vitality of that site. It will likely be archived for distribution under Creative Commons.", "CreationDate": "2011-03-08T21:05:48.027", "UserId": 155}
{"Id": 721, "PostId": 376, "Text": "I didn't realize I had so many flagged comments. I only knew about one and that got deleted and fueled my only question on this site: http://meta.atheism.stackexchange.com/questions/152/i-proved-harsh-treatment-to-the-heretics-of-atheism-what-will-be-done-to-prevent ", "CreationDate": "2011-03-09T01:07:03.563", "UserId": 378}
{"Id": 722, "PostId": 370, "Score": 7, "Text": "I'm sorry, but I don't believe in sites. ;~ ", "CreationDate": "2011-03-09T01:16:57.290", "UserId": 992}
{"Id": 723, "PostId": 371, "Score": 1, "Text": "The first graph lacks axis labels. What is measured? About 50 days horizontally? And vertically? Traffic in visitors, in Bytes? ", "CreationDate": "2011-03-09T01:33:57.957", "UserId": 992}
{"Id": 724, "PostId": 152, "Text": "I downvoted for 'going to be stoned with downvotes'. It's not an appropriate metaphor here. It seems to be meant just for provocation, and renders the question unuseful. ", "CreationDate": "2011-03-09T02:19:52.143", "UserId": 992}
{"Id": 725, "PostId": 380, "Text": "@user unknown: what?", "CreationDate": "2011-03-09T02:40:08.893", "UserId": 378}
{"Id": 726, "PostId": 380, "Text": "@THe Preacher: What what? ", "CreationDate": "2011-03-09T03:12:35.337", "UserId": 992}
{"Id": 727, "PostId": 372, "Score": 2, "Text": "mfg - There has to be a line between a 'sterile' question/answer format and a free-for-all discussion / trolling board.  The problem with the Q&A only format is that there are a relatively few and very common questions that will frequently recur about atheist, and if we limit it to Q&A we'll mostly only see variations of those.", "CreationDate": "2011-03-09T06:12:30.953", "UserId": 524}
{"Id": 728, "PostId": 376, "Text": "@the it's not that a flagged comment is necessarily \"bad\" though. It seems people don't flag typically, until the tangent has gotten so far off topic.  I don't think any have considered the comments offensive, but often they seem to be hijacking a question. Don't be concerned with posting a contrarian answer, or disagreeing, but try not to go off topic on someone else's question /answer.", "CreationDate": "2011-03-09T12:06:05.833", "UserId": 135}
{"Id": 729, "PostId": 382, "Text": "@Jeff: Sorry, too much jargon in your third sentence. Could you rephrase for me?  ", "CreationDate": "2011-03-09T14:14:23.690", "UserId": 71}
{"Id": 730, "PostId": 375, "Text": "Thank you Nostradamus", "CreationDate": "2011-03-09T14:17:57.960", "UserId": 584}
{"Id": 731, "PostId": 376, "Text": "A key question within your question is \"what is the point of flagging, is there a consequence to being flagged?\" I would think that would have an answer.", "CreationDate": "2011-03-09T14:25:58.137", "UserId": 584}
{"Id": 732, "PostId": 376, "Score": 1, "Text": "@Lausten , the point of flagging is to bring comments, etc to the attention of moderators, so they can take action if necessary. A flagged question that does have an action taken against it will be deleted. It's possible further actions are necessary; but unlikely. The key *problem* for me, that I really want to address, is developing a community standard for avoiding off-topic comment threads. It doesn't look good, and often **the resulting questions/answers could have been funneled into something productive, i.e. discrete question/answers.**", "CreationDate": "2011-03-09T14:35:31.357", "UserId": 135}
{"Id": 733, "PostId": 383, "Text": "It seems the more fatal flaw was a lack of draw; there was not sufficient content to hold the interest of the people who were originally interested in grooming the beta. Social forces or no, if something is boring, it's hard to invest one's self in it.", "CreationDate": "2011-03-09T14:58:57.790", "UserId": 135}
{"Id": 734, "PostId": 375, "Text": "@Lausten: Point taken. ;-)", "CreationDate": "2011-03-09T17:59:43.730", "UserId": 80}
{"Id": 735, "PostId": 371, "Text": "The graph is page views. The labels are not included because we generally do not provide detailed, per-site analytics.", "CreationDate": "2011-03-09T19:07:34.627", "UserId": 155}
{"Id": 736, "PostId": 383, "Text": "I meant to answer \"what have you learned\". Maybe I should learn to be careful where I post. :)", "CreationDate": "2011-03-09T19:09:05.853", "UserId": 584}
{"Id": 737, "PostId": 383, "Text": "@mfg - I often question my own fascination. To engage in this topic requires constant repetition of centuries old questions. It interests me more for the historical impact than the actual details. I think there is a cutting-edge of atheism, but once most people cross it, they don't care to discuss, or they are born into it and don't see it as a problem. If it only affected churches, I wouldn't care, but I think it bleeds into public debates like vaccine/autism. Only magical thinking could support that bad science at this point. And don't get me started about global warming. ", "CreationDate": "2011-03-09T19:21:40.680", "UserId": 584}
{"Id": 738, "PostId": 264, "Text": "I believe atheism is strongly tied to religions so yes, it could be merged with religions. With skepticism, too. Philosophy seems a bit stretched, and SF or Mythology has nothing really to do with atheism.", "CreationDate": "2011-03-10T01:28:39.320", "UserId": 1221}
{"Id": 739, "PostId": 385, "Text": "+1 Well put....", "CreationDate": "2011-03-10T01:42:36.000", "UserId": 80}
{"Id": 740, "PostId": 270, "Text": "I thought so initially, but Skepticism has the stench of death around it already. Unfortunately.", "CreationDate": "2011-03-10T22:02:21.927", "UserId": 169}
{"Id": 741, "PostId": 369, "Score": 3, "Text": "who was the wiseass who put our make-or-break day on the *Ides of March*?", "CreationDate": "2011-03-11T16:00:19.937", "UserId": 71}
{"Id": 742, "PostId": 387, "Score": 1, "Text": "\"If the answers are good ...\" I think that's currently evaluating to `false`.", "CreationDate": "2011-03-11T22:08:42.510", "UserId": 270}
{"Id": 743, "PostId": 389, "Text": "If you ask to qualify different religions quantitatively (silly question?) it seems to necessarily preempt and prelude the across the board statements that all religions are equally harmful (valid answer?) This is what I see as the double standard. And it's a ridiculous bias that we make an extreme judgement about all religion but refer to a step back to examine if different degrees of that judgement exist as subjective, argumentative, or even silly.", "CreationDate": "2011-03-11T23:48:34.360", "UserId": 1107}
{"Id": 744, "PostId": 389, "Text": "To clarify: there are two type of poorly phrased questions- one is as you say pointless and silly. The other, through not optimally written, has a clear and useful intent. In this case- can we place a range of judgement values upon religion rather than simply going to the extreme and saying that they are all equally bad. I find that just as valid as: http://atheism.stackexchange.com/questions/3045/does-religion-have-positive-effects-on-society and http://atheism.stackexchange.com/questions/3045/does-religion-have-positive-effects-on-society", "CreationDate": "2011-03-12T00:04:05.567", "UserId": 1107}
{"Id": 745, "PostId": 369, "Text": "what happens if we don't pass? stay in beta or do we go to stack heaven (or maybe hell)? ", "CreationDate": "2011-03-12T02:33:25.467", "UserId": 1107}
{"Id": 746, "PostId": 387, "Score": 1, "Text": "I agree- must we worry about being popular and widely visited? (I'm fuzzy on the rules for our existence) The few of us who are here regularly seem to be enjoying ourselves and are actually making some headway on interesting issues. I think getting a bunch of new users in here with some simpler questions (with well agreed upon answers) about atheism would be beneficial.", "CreationDate": "2011-03-12T02:49:29.883", "UserId": 1107}
{"Id": 747, "PostId": 390, "Text": "Facebook has been disappointing as an intellectual forum for me :(  You and @Cesar are both dancing around the issue. We support and laud ranting on the stupidity and base evil of all religion but we apply our rules to censor a question that would potentially supply answers contrary to that. You can call it a poll or whatever reason- its a clear selective bias. And in the Vegan forum- the proper analogy would be a question on which animals they should focus on primarily for activism/morality purposes. If they closed that question they'd be lying about what they do in real life.    ", "CreationDate": "2011-03-12T15:52:17.107", "UserId": 1107}
{"Id": 748, "PostId": 390, "Text": "And (ran out of room) we are lying if we say that we do not find certain religions more/less offensive. The criteria for this judgement and that it does exist is just as much about atheism as an other question on this site. Even if the answers may differ for different people- almost every question fits that description. And this isn't a poll: Once again...http://atheism.stackexchange.com/questions/3045/does-religion-have-positive-effects-on-society?  ", "CreationDate": "2011-03-12T15:58:12.373", "UserId": 1107}
{"Id": 749, "PostId": 369, "Text": "@jaskey13: Usually, if we,re not ready for launch, the site stays in beta longer until it's ready. In the case of Atheism, however, it's looking so bad that we might join Artificial Intelligence in afterlife (also known as \"Creative Commons data dump\").", "CreationDate": "2011-03-12T18:27:22.977", "UserId": 484}
{"Id": 750, "PostId": 390, "Score": 1, "Text": "@jaskey: Your Vegan question is about *activism,* not preference, and the equivalent would be \"What religion should atheists focus their efforts on to free people from its clutches?\" \"Least/most acceptable religion\" is deliberately asking what people *like* or *dislike.* If you were asking a question about activism, I would leave it open.", "CreationDate": "2011-03-12T19:25:07.690", "UserId": 71}
{"Id": 751, "PostId": 390, "Score": 1, "Text": "(continuing) And I am not dancing around any issue. We are not here on SE to *debate* whether religion is good or bad. Is your ultimate goal to have a bunch of atheists say how fabulous X religion is? I do not understand why else you would be pursuing questions aimed at eliciting some form of \"why yes, X religion *does* in fact have some wonderful things going for it.\" If you want that kind of *discussion,* there's nothing wrong with it, but SE is not the forum for it. ", "CreationDate": "2011-03-12T19:25:25.363", "UserId": 71}
{"Id": 752, "PostId": 379, "Score": 2, "Text": "Unfortunately, the 6.4 answer ratio is not a good thing in our case since many of those answers are crap answers to crap questions.", "CreationDate": "2011-03-12T19:27:17.170", "UserId": 135}
{"Id": 754, "PostId": 373, "Score": 1, "Text": "I have put up a pretty massive edit, let me know if it fits.", "CreationDate": "2011-03-12T19:49:38.540", "UserId": 135}
{"Id": 755, "PostId": 390, "Text": "That is not my goal. I've clearly stated what I see as a problem here. Debate about the shading of meaning/semantics is common here and is used to justify contradictory actions. If everyone is ok with ranting in answers and selecting for questions that allow that then fine- I withdraw.", "CreationDate": "2011-03-12T21:34:03.863", "UserId": 1107}
{"Id": 757, "PostId": 379, "Text": ":) I don't comment this answer. :)", "CreationDate": "2011-03-12T21:48:49.127", "UserId": 992}
{"Id": 758, "PostId": 391, "Text": "Honestly I'm not sure what to say anymore except that I object to the way things are handled on this site. There is an agenda to incite and an ignorance of evidence. I'm starting to have my doubts if anything useful can come out of any of this.  ", "CreationDate": "2011-03-12T21:54:03.643", "UserId": 1107}
{"Id": 759, "PostId": 390, "Text": "And now I've read the flurry of other meta posts surrounding this general idea. It seems I'm not the only one whose noticed these contradictions. Hmmmm... site use has gone down- the status quo remains. Guess I'll just be another voice overwhelmed by the shouts of those who know best.", "CreationDate": "2011-03-13T00:25:55.160", "UserId": 1107}
{"Id": 760, "PostId": 391, "Score": 2, "Text": "@Jaskey the only problem, in terms of 'handling' that I see, is a symptom of the low population of users. Earlier in the beta, a bad question would show up, it would be posted in chat/ on meta, and the 3-4 on chat would vote to close. because people come here less often, if at all, and don't hang around, this no longer happens. debates about whether [question x] needs closed no longer happens. Bad questions go unnoticed. I don't see a double standard as much as i see apathy.", "CreationDate": "2011-03-13T01:17:49.327", "UserId": 135}
{"Id": 761, "PostId": 394, "Score": 1, "Text": "In one post, Robert Cartaino said \"I don't see any sites (launched or proposed) for which this content will add to the substance or vitality of that site\" (and, sadly, he's right as things stand now). Can you think of a proposition for a site that would benefit from the content of this site? By that I mean, can you think of a way to incorporate the valuable parts of this site within another more generalized, or specifically niche site? I'd rather this site not just end up in the CC data dump, and any thoughtful proposition would be appreciated.", "CreationDate": "2011-03-13T05:47:20.123", "UserId": 135}
{"Id": 762, "PostId": 373, "Text": "@mfg Thanks. It fits quite well.", "CreationDate": "2011-03-13T11:37:05.060", "UserId": 1173}
{"Id": 763, "PostId": 393, "Text": "Downvotes with no explanation- just another feature of a successful site.", "CreationDate": "2011-03-13T13:49:53.310", "UserId": 1107}
{"Id": 764, "PostId": 391, "Score": 1, "Text": "That may be. But in reading through meta it seems these problems were noticed early on. Nothing was done to address the obvious issue that atheism is a subjective belief and as a result you can't have a proper objective Q&A forum about a belief system. There can't even be a base of acceptable questions/answers with the exception of one (the before mentioned existence of God question.) So atheism was allowed to languish within the stack exchange model and no one did anything to stop it. My answer to my own question here is downvoted- but it's the only remedy. Your right- apathy + bruised egos.", "CreationDate": "2011-03-13T14:14:31.620", "UserId": 1107}
{"Id": 765, "PostId": 391, "Text": "I predict now a similar failure in a Philosophy or Comparative Religion exchange. And I'll place the blame squarely on the small group of higher level users who believe that they know what is appropriate for the site. There are no \"experts\" in these fields- anyone who claims they are is employing the conceit that their view on the rest of the world is superior to everyone else's. Religion/lack thereof is personal. Philosophy, though much has been written about it, is personal. Interpretation is a necessary feature, polls and subjectiveness  always exist in a meaningful exchange around these.", "CreationDate": "2011-03-13T14:26:21.143", "UserId": 1107}
{"Id": 766, "PostId": 391, "Text": "@jas the problem in that is that the population of objectively q/a questions was low and many filler questions were belched up. The desire for the site exists, finding a suitable field of inquiry, with sufficient objective material is the task I recommend we set upon ourselves. These topics are problematic for their prescriptive push, but valuable as q/a for the volume of descriptive and research based questions", "CreationDate": "2011-03-13T17:18:45.937", "UserId": 135}
{"Id": 767, "PostId": 391, "Score": 1, "Text": "Correct- I've tried to post questions just for the sake of having more on the site myself. The desire is there- I think those of us who are still here regularly would miss it- even if it's frustrating at times. Questions involving statistical data and proper analysis would be objective- however from what I've seen so far not many here have demonstrated capable reasoning around rules of evidence and logical consequence. I fear it would again degenerate into opinions with voices of reason being lost. Anyway I suppose for now I could help by forming some questions along those lines. Sound good?  ", "CreationDate": "2011-03-13T19:41:47.100", "UserId": 1107}
{"Id": 768, "PostId": 393, "Text": "@jaskey13: That happens in all SE sites, unfortunately. :-(", "CreationDate": "2011-03-14T09:41:21.983", "UserId": 80}
{"Id": 769, "PostId": 330, "Text": "+1 I'm not sure it would work, but it sounds reasonable.", "CreationDate": "2011-03-14T09:45:36.800", "UserId": 80}
{"Id": 770, "PostId": 391, "Text": "@jaskey: I just upvoted your very interesting question re atheism and suicide. It's a question with room for debate and argument, but it's definitely more objective. :)", "CreationDate": "2011-03-14T12:33:39.180", "UserId": 71}
{"Id": 771, "PostId": 382, "Score": 1, "Text": "@Lauren have you seen the VTC: Off-Topic, how it has one for \"Send to meta.atheism\" ? I think thats what he means by \"paths\"; the history of closures leading to up to 4 might mean there is that path and (maybe?) 3 others based on neighbor topics (i.e. many religion questions closed on atheism unlocks a move-to religion path (again, maybe?))", "CreationDate": "2011-03-14T16:11:37.127", "UserId": 135}
{"Id": 772, "PostId": 391, "Score": 1, "Text": "@Lauren I'm hoping to see some good unbiased statistics. The Web is full of crappy representations of that science that are used to further biased agendas. I'm going to be hard on the cites to hopefully catch any bias/statistical misuse and possibly curb the arguing. But that's probably going to just spawn more of it huh?   ", "CreationDate": "2011-03-14T17:07:28.333", "UserId": 1107}
{"Id": 773, "PostId": 397, "Text": "I say edit it per your criteria", "CreationDate": "2011-03-14T20:43:22.170", "UserId": 1107}
{"Id": 774, "PostId": 396, "Score": 1, "Text": "A little emotional rant of my own: the Titanic comment makes me sad :(", "CreationDate": "2011-03-14T21:07:44.923", "UserId": 1107}
{"Id": 775, "PostId": 398, "Text": "Even if I posted it VTC anything that fits the criteria for bad subjective questions laid out above. They're good guidelines and the site could use a purge. Be sure to set up a VTC post on the Meta to bring attention to it. Don't forget,  you need to lay out a thought out critique so it's clear why you think it should be closed.  Also leave comments on how to improve the question if you think that's possible, and claim your VTC by linking to its Meta ; we need to be accountable for these votes.", "CreationDate": "2011-03-14T21:22:46.377", "UserId": 135}
{"Id": 776, "PostId": 398, "Text": "@mfg Can you explain the \"claim your VTC by linking to its Meta ; we need to be accountable for these votes\" please?", "CreationDate": "2011-03-14T21:38:17.253", "UserId": 1107}
{"Id": 777, "PostId": 398, "Text": "actually I'm not clear about linking at all- I read your \"link bomb\" idea too- I can't seem to find instructions ", "CreationDate": "2011-03-14T21:48:13.377", "UserId": 1107}
{"Id": 778, "PostId": 398, "Text": "By claim your VTCs I mean explain the 'why' and no drive-by voting without explanation unless one's already there. We are accountable and responsible for not only getting rid of bad questions, but also improving our community by trying to explain how to better ask a question. i.e. If you vote  to close, and put up a meta post to explain it, link to the post (or explain in the comments). Comment links are done with `[alt-text for link](http://www.url.com)`. Link bombing was just an idea to get people to promote good q/a's by any means of dropping links; twitter, facebook, blogs, etc.", "CreationDate": "2011-03-14T22:09:16.710", "UserId": 135}
{"Id": 779, "PostId": 400, "Text": "Again that's why I *like* the question. As it is *currently* posed, however, it is unconstructive for the reasons above.", "CreationDate": "2011-03-15T17:11:12.303", "UserId": 135}
{"Id": 780, "PostId": 400, "Text": "\"unconstructive\" in a \"normal\" SE where questions have answers, like \"how do I install an electrical outlet\". Atheism has common points of contention and definitional problems that have not been handled here and are weighing the site down.", "CreationDate": "2011-03-15T17:32:13.393", "UserId": 584}
{"Id": 781, "PostId": 385, "Text": "Deeper understanding\nhttp://atheism.stackexchange.com/questions/93/what-is-the-difference-between-atheism-and-agnosticism\nMorality\nhttp://atheism.stackexchange.com/questions/3039/summary-of-philosophical-or-scientific-basis-for-non-supernatural-morality\nTerms\nhttp://atheism.stackexchange.com/questions/3091/name-of-the-theory-that-dinosaur-fossils-were-placed-by-satan\nHow to deal with...\nhttp://atheism.stackexchange.com/questions/1742/how-can-an-atheist-answer-lewiss-trilemma\n", "CreationDate": "2011-03-15T17:52:57.523", "UserId": 584}
{"Id": 782, "PostId": 385, "Text": "Resources\nhttp://atheism.stackexchange.com/questions/18/what-is-the-single-most-influential-book-every-atheist-should-read\nRaising Children\nhttp://atheism.stackexchange.com/questions/2469/how-would-you-explain-atheism-to-a-child\nHistorical\nhttp://atheism.stackexchange.com/questions/2033/historically-speaking-is-there-someone-that-is-recognized-as-the-first-atheist", "CreationDate": "2011-03-15T17:53:30.487", "UserId": 584}
{"Id": 783, "PostId": 400, "Text": "@mfg: so how would you reword it? I can't come up with any better way to put the question. Atheists often bitch about the evils of religion. Theists protest its positives. So, what criteria do we use to measure the impact religion has had on society?", "CreationDate": "2011-03-16T13:00:13.653", "UserId": 71}
{"Id": 784, "PostId": 400, "Text": "@Lauren @Lausten [compromise: how about this?](http://meta.atheism.stackexchange.com/questions/399/vtc-how-could-we-calculate-the-impact-of-religion/401#401)", "CreationDate": "2011-03-16T17:52:34.310", "UserId": 135}
{"Id": 785, "PostId": 401, "Score": 1, "Text": "I am totally for the \"churches gone wild\" tag. :D Seriously, I think this is a great compromise. It encompasses the spirit of the original question but is correctly more specific, objective, and answerable. ", "CreationDate": "2011-03-16T18:06:58.847", "UserId": 71}
{"Id": 786, "PostId": 401, "Text": "@Lauren I will start a meta asking for how to do this. I think the community should definnitely weigh in, since it definitely will require a disciplined approach to avoid the big disclaimer at the bottom. I want to encourage positive growth, but not at the expense of decency. We'll need to define a way to craft these questions.", "CreationDate": "2011-03-16T18:21:14.583", "UserId": 135}
{"Id": 787, "PostId": 403, "Text": "If you feel like you understand the underlying intent, feel free to try to clean this up a bit. It's CW so that we can try to come to a standard for allowing questions like this to exist while providing some cover against the caveat at the end", "CreationDate": "2011-03-16T19:36:22.887", "UserId": 135}
{"Id": 788, "PostId": 403, "Score": 1, "Text": "And yes, this is totally an experiment. My hope is that it works and can spark more interest in the site. [I have posted an attempt at using this tag.](http://atheism.stackexchange.com/q/3184/135) It focuses on a specific figure. Please feel free to leave criticism of the question so that this approach can be refined and improved.", "CreationDate": "2011-03-16T19:43:20.990", "UserId": 135}
{"Id": 789, "PostId": 401, "Text": "I'm having trouble following this because you introduce this \"prove gawd doesn't exist thing\" as a bullet point. Where did that come from? I thought this SE was intended for those who already think that, and we would allow for outsiders to query their beliefs, but we would moderate them. I see the \"how do we act in a religious world\" and \"how do we communicate atheism\" as more important purposes. Given that, determining how to measure the impact of religion seems like an important topic. ", "CreationDate": "2011-03-16T20:22:34.317", "UserId": 584}
{"Id": 790, "PostId": 403, "Score": 1, "Text": "Would the Westboro Baptist Church Supreme Court decision fall under this tag? There's been a lot of back and forth about free speech vs. the right of privacy at a funeral there. ", "CreationDate": "2011-03-16T20:28:02.097", "UserId": 71}
{"Id": 791, "PostId": 401, "Text": "@Lausten I respect that you value [ethics] and [promotion-activism] more, what I was doing was drawing an analogy to a general atheist purpose and method. Like I said, it's unlikely we necessarily agree on what the \"purpose\" of atheism is; I may be weak on purpose and believe it's sole purpose is to disprove deities, you may be stronger and believe we should promote atheist points of view. Either way, both rely on a foundation of disproving deities; I was seeking a greatest common factor (disproving deities) from which to build a perspective on method.", "CreationDate": "2011-03-16T20:31:11.430", "UserId": 135}
{"Id": 792, "PostId": 401, "Text": "(\"Method,\" to me, implies *active* atheism, not passive lack of belief, hence my reliance on the term disprove)", "CreationDate": "2011-03-16T20:31:38.217", "UserId": 135}
{"Id": 793, "PostId": 403, "Text": "@Lauren This isn't asking for free speech, church-state separation; I'd say Westboro is a great example of a community effort at going-wild. Try to stay on track though; mine is a bit broad to a fault. Their condoning of IEDs in Iraq is pretty wild. In a way, think of it as continuing to document cases of \"God is not Great\". Seriously have never seen one, but inner monologue just came up with a rating scale based on those girls-gone-wild videos, like \"Westboro is Mardi Gras GGW!\"", "CreationDate": "2011-03-16T20:41:09.657", "UserId": 135}
{"Id": 794, "PostId": 403, "Text": "@mfg: the court decision was about free speech, but the SE question could be something about \"Does the WBC trample the rights of others in its expression of its religious beliefs?\" ", "CreationDate": "2011-03-17T00:31:28.037", "UserId": 71}
{"Id": 795, "PostId": 369, "Text": "Now what? see everybody on one of the Skepticism SEs?", "CreationDate": "2011-03-17T02:10:26.437", "UserId": 71}
{"Id": 797, "PostId": 404, "Score": 1, "Text": "Okay, I voted until I could vote no more. @Lausten and @jaskey should be pleasantly surprised. :)", "CreationDate": "2011-03-17T13:03:46.710", "UserId": 71}
{"Id": 798, "PostId": 404, "Text": "@Lauren W00T!!!", "CreationDate": "2011-03-17T13:05:44.293", "UserId": 135}
{"Id": 799, "PostId": 404, "Score": 1, "Text": "Is there an opposite of rep-farming? rep-planting? :) I'll admit it; I just wanted another badge.", "CreationDate": "2011-03-17T13:27:26.470", "UserId": 71}
{"Id": 800, "PostId": 404, "Score": 1, "Text": "@Lauren If there is such a thing as rep-planting, I think that's what this is basically. Actually, I'm shooting for <strunk & white> badge before the CC-Rapture!", "CreationDate": "2011-03-17T13:31:39.140", "UserId": 135}
{"Id": 801, "PostId": 404, "Text": "@mfg: feel free to edit any of my posts and add random spaces if it gets you there faster. :D", "CreationDate": "2011-03-17T14:21:13.710", "UserId": 71}
{"Id": 802, "PostId": 404, "Text": "@Lauren [woo hoo](http://atheism.stackexchange.com/badges/12/strunk-white); well hope to see you on another site! Here comes the 3/18 hammer -[\"Dear children, let us not love with words or speech but with actions and in truth.\"](http://www.biblegateway.com/passage/?search=1+John+3%3A18&version=NIV) lol", "CreationDate": "2011-03-17T19:05:48.617", "UserId": 135}
{"Id": 803, "PostId": 404, "Score": 1, "Text": "@mfg: Do not go gentle into that good Creative Commons! Rage, rage against the dying of the exchange! ;) ", "CreationDate": "2011-03-17T20:09:24.007", "UserId": 71}
{"Id": 804, "PostId": 404, "Text": "@lauren tis all for naught! [we're a joke](http://meta.stackoverflow.com/questions/83612/atheism-is-being-closed-3-18-does-that-mean-at-0000-after-3-17-or-0000-after-3), just [like gadgets](http://meta.stackoverflow.com/questions/64669/what-happens-to-the-reputation-earned-on-gadgets)", "CreationDate": "2011-03-17T20:17:31.067", "UserId": 135}
{"Id": 805, "PostId": 404, "Score": 2, "Text": "@mfg: I want zombie unicorn badges now.", "CreationDate": "2011-03-17T20:39:19.190", "UserId": 71}
{"Id": 806, "PostId": 404, "Score": 1, "Text": "@Lauren I know i wish they were real!", "CreationDate": "2011-03-17T20:41:34.730", "UserId": 135}
{"Id": 807, "PostId": 406, "Text": "+1 for laughs and giggles.", "CreationDate": "2011-03-17T21:45:03.400", "UserId": 270}
{"Id": 808, "PostId": 409, "Text": "ps where can I cash in my points? can I use them for fly buys?", "CreationDate": "2011-03-17T23:37:56.330", "UserId": 182}
{"Id": 809, "PostId": 369, "Score": 1, "Text": "@lauren Well, it would probably be a good thing.   SkepticismSE is insufficiently skeptical in tone at the moment, in my opinion.", "CreationDate": "2011-03-17T23:54:19.417", "UserId": 998}
{"Id": 810, "PostId": 269, "Text": "Since this site is going to be deleted, rather than merging with religion, we should just create a religion SE from scratch.", "CreationDate": "2011-03-18T01:04:02.370", "UserId": 270}
{"Id": 811, "PostId": 411, "Text": "Isn't this somewhat meta?", "CreationDate": "2011-03-18T00:09:56.307", "UserId": 270}
{"Id": 812, "PostId": 412, "Text": "The expectations should be on the Area 51 entry.  Basically, there are far too few visitors to the site, and far too few questions.  The idea is to attract a lot of people, partly from within the Stack Exchange community and partly from searches by people interested in the questions.  This apparently isn't happening, and the SE people aren't interested in supporting a site for relatively few people.", "CreationDate": "2011-03-18T01:28:37.973", "UserId": 516}
{"Id": 813, "PostId": 406, "Text": "did it. you now have 1513 rep.", "CreationDate": "2011-03-18T05:02:51.033", "UserId": 1173}
{"Id": 814, "PostId": 406, "Score": 1, "Text": "Thanks, all!  :)", "CreationDate": "2011-03-18T10:07:42.803", "UserId": 205}
{"Id": 815, "PostId": 414, "Text": "but gis stats were also not enough for it to launch so it was given more time why can't it be the same with this site?", "CreationDate": "2011-03-18T10:25:03.793", "UserId": 1173}
{"Id": 816, "PostId": 269, "Text": "@and a few questions may be merged if that site betas. Check out the \"gadgets \" link here http://meta.atheism.stackexchange.com/questions/404/do-your-civic-duty-and-exercise-your-suffrage-rights", "CreationDate": "2011-03-18T11:14:14.963", "UserId": 135}
{"Id": 817, "PostId": 404, "Score": 1, "Text": "-1 - Oh, were you meaning for me to upvote?", "CreationDate": "2011-03-18T11:24:27.890", "UserId": 270}
{"Id": 818, "PostId": 406, "Score": 1, "Text": "I'm ever-so-slightly annoyed I won't break 4K, but what can you do. :)", "CreationDate": "2011-03-18T18:24:53.497", "UserId": 71}
{"Id": 819, "PostId": 415, "Score": 2, "Text": "We know why it's being closed. We're discussing why it didn't *work*.", "CreationDate": "2011-03-18T18:36:59.617", "UserId": 169}
{"Id": 820, "PostId": 414, "Text": "@alaukik: We peaked months ago. Anything else is just delaying the inevitable.", "CreationDate": "2011-03-18T18:39:18.227", "UserId": 169}
{"Id": 821, "PostId": 415, "Text": "@satanic IMHO this topic is much too narrow to work; a general philosophy site, perhaps", "CreationDate": "2011-03-18T18:48:27.293", "UserId": 207}
{"Id": 822, "PostId": 404, "Text": "@and ha both count so downvote bad stuff", "CreationDate": "2011-03-18T19:53:25.247", "UserId": 135}
{"Id": 823, "PostId": 406, "Text": "I don't know what you're talking about, Lauren. Looks to me like you made it.  Can't say I'm not jealous considering you and I tend to agree more than disagree on most of the answers we've provided, but hey...  ", "CreationDate": "2011-03-19T01:07:24.507", "UserId": 205}
{"Id": 824, "PostId": 414, "Text": "Maybe [skeptics] (http://area51.stackexchange.com/proposals/12612/skeptics) is a good, new home.", "CreationDate": "2011-03-19T07:07:51.163", "UserId": 992}
{"Id": 825, "PostId": 419, "Score": 1, "Text": "Now that you mentioned this being your first beta, it made me think that it may have actually been the case for most users here. For me, this is my first experience with a SE site at all. So, I guess, most of us would naturally have no clue how to handle a SE beta, and this is yet another major way in which we differ from, say, Apple.SE or CS.SE or what not. And yes, this failure is very very sad.", "CreationDate": "2011-03-19T07:48:25.267", "UserId": 106}
{"Id": 826, "PostId": 406, "Text": "@Mudak: I was joking, but I'm at 3878 at the moment. And I will happily keep upvoting you if you like. :)", "CreationDate": "2011-03-19T13:45:58.743", "UserId": 71}
{"Id": 827, "PostId": 419, "Text": "first beta, first SE for me too.", "CreationDate": "2011-03-19T14:13:45.737", "UserId": 71}
{"Id": 828, "PostId": 415, "Text": "@jeff: BT discussed that. Skeptic/ism is a better fit than Philosophy.", "CreationDate": "2011-03-19T14:14:30.153", "UserId": 71}
{"Id": 829, "PostId": 406, "Text": "That's weird.  I upvoted you to 4003 yesterday. ", "CreationDate": "2011-03-19T15:02:59.707", "UserId": 205}
